#pragma once
#include "../common.h"
#include "gameinfo.h"

class TDrawSystem;
class TPanel;
class RGE_Scenario_File_Info;
class TSound_Driver;
class TMusic_System;
class TDigital;
class TCommunications_Handler;
class TDebuggingLog;
class TRegistry;
class TMousePointer;
class RGE_Scenario;

// ----------------------------------------------------------------
// RGE_Game_Options
// Size: 0xA8
struct RGE_Game_Options {
    float versionValue; // 0x0
    uchar scenarioGameValue; // 0x4
    char scenarioNameValue[128]; // 0x5
    uchar singlePlayerGameValue; // 0x85
    uchar multiplayerGameValue; // 0x86
    uchar mapXSizeValue; // 0x87
    uchar mapYSizeValue; // 0x88
    uchar mapZSizeValue; // 0x89
    uchar allowCheatCodesValue; // 0x8A
    uchar mpPathFindingValue; // 0x8B
    uchar cheatNotificationValue; // 0x8C
    uchar fullVisibilityValue; // 0x8D
    uchar fogOfWarValue; // 0x8E
    uchar coloredChatValue; // 0x8F
    uchar numberPlayersValue; // 0x90
    uchar gameDeveloperModeValue; // 0x91
    uchar playerCDAndVersionValue[9]; // 0x92
    uchar difficultyValue; // 0x9B
    uchar playerTeamValue[9]; // 0x9C
};

class RGE_Base_Game {
public:
    RGE_Game_Info* player_game_info;         // 0x4
    RGE_Scenario_File_Info* scenario_info;   // 0x8
    RGE_Prog_Info* prog_info;                // 0xC
    void* prog_window;                       // 0x10
    int prog_ready;                          // 0x14
    int prog_active;                         // 0x18
    void* prog_palette;                      // 0x1C
    void* prog_mutex;                        // 0x20
    long window_style;                       // 0x24
    int random_game_seed;                    // 0x28
    int random_map_seed;                     // 0x2C
    int save_random_game_seed;               // 0x30
    int save_random_map_seed;                // 0x34
    int screen_saver_enabled;                // 0x38
    int low_power_enabled;                   // 0x3C
    int error_code;                          // 0x40
    int is_timer;                            // 0x44
    TDrawSystem* draw_system;                // 0x48
    TDrawArea* draw_area;                    // 0x4C
    uchar outline_type;                      // 0x50
    int custom_mouse;                        // 0x54
    short shape_num;                         // 0x58
    TShape** shapes;                         // 0x5C
    TSound_Driver* sound_system;             // 0x60
    TMusic_System* music_system;             // 0x64
    short sound_num;                         // 0x68
    TDigital** sounds;                       // 0x6C
    uchar save_music_type;                   // 0x70
    int save_music_track_from;               // 0x74
    int save_music_track_to;                 // 0x78
    int save_music_cur_track;                // 0x7C
    char save_music_file[260];               // 0x80
    int save_music_loop;                     // 0x184
    ulong save_music_pos;                    // 0x188
    TCommunications_Handler* comm_handler;   // 0x18C
    int comm_syncstop;                       // 0x190
    int comm_droppackets;                    // 0x194
    int comm_syncmsg;                        // 0x198
    int comm_stepmode;                       // 0x19C
    int comm_speed;                          // 0x1A0
    TDebuggingLog* debugLog;                 // 0x1A4
    int log_comm;                            // 0x1A8
    TRegistry* registry;                     // 0x1AC
    int prog_mode;                           // 0x1B0
    int game_mode;                           // 0x1B4
    int sub_game_mode;                       // 0x1B8
    int paused;                              // 0x1BC
    TMousePointer* mouse_pointer;            // 0x1C0
    int erase_mouse;                         // 0x1C4
    int mouse_blit_sync;                     // 0x1C8
    int is_mouse_on;                         // 0x1CC
    int windows_mouse;                       // 0x1D0
    void* mouse_cursor;                      // 0x1D4
    int input_enabled;                       // 0x1D8
    void* input_disabled_window;             // 0x1DC
    short font_num;                          // 0x1E0
    RGE_Font* fonts;                         // 0x1E4
    char work_dir[261];                      // 0x1E8
    char string_dll_name[261];               // 0x2ED
    RGE_Game_World* world;                   // 0x3F4
    int render_all;                          // 0x3F8
    short master_obj_id;                     // 0x3FC
    short terrain_id;                        // 0x3FE
    short elevation_height;                  // 0x400
    short brush_size;                        // 0x402
    char timing_text[256];                   // 0x404
    ulong frame_count;                       // 0x504
    ulong world_update_count;                // 0x508
    ulong view_update_count;                 // 0x50C
    ulong last_frame_count;                  // 0x510
    ulong last_world_update_count;           // 0x514
    ulong last_view_update_count;            // 0x518
    ulong fps;                               // 0x51C
    ulong world_update_fps;                  // 0x520
    ulong view_update_fps;                   // 0x524
    RGE_Timing_Info timings[30];             // 0x528
    int do_show_timings;                     // 0x8E8
    int do_show_comm;                        // 0x8EC
    int do_show_ai;                          // 0x8F0
    ulong last_view_time;                    // 0x8F4
    RGE_Game_Options rge_game_options;       // 0x8F8
    int campaignGameValue;                   // 0x9A0
    int savedGameValue;                      // 0x9A4
    int quick_build;                         // 0x9A8
    int save_check_for_cd;                   // 0x9AC
    int playerIDValue[9];                    // 0x9B0
    int display_selected_ids;                // 0x9D4
    long countdown_timer[9];                 // 0x9D8
    int auto_paused;                         // 0x9FC
    int save_paused;                         // 0xA00
    int non_user_pause;                      // 0xA04
    int rollover;                            // 0xA08
    float game_speed;                        // 0xA0C
    int single_player_difficulty;            // 0xA10
    uchar pathFindingValue;                  // 0xA14
    uchar resigned[9];                       // 0xA15
    TDrawArea* map_save_area;                // 0xA20

    RGE_Base_Game(RGE_Prog_Info* param_1, int param_2);
    virtual int setup();
    virtual void set_prog_mode(int param_1);
    virtual TPanel* get_view_panel();
    virtual TPanel* get_map_panel();
    virtual ~RGE_Base_Game();
    virtual void notification(int param_1, long param_2, long param_3, long param_4, long param_5);
    virtual int processCheatCode(int param_1, char* param_2);
    virtual int handle_message(tagMSG* param_1);
    virtual int action_update();
    virtual int action_mouse_move(long param_1, long param_2, int param_3, int param_4, int param_5, int param_6);
    virtual int action_key_down(ulong param_1, int param_2, int param_3, int param_4, int param_5);
    virtual int action_user_command(ulong param_1, ulong param_2);
    virtual int action_command(ulong param_1, ulong param_2);
    virtual int action_music_done();
    virtual int action_activate();
    virtual int action_deactivate();
