#pragma once
#include "../common.h"
#include "m_s_obj.h"
#include "obj_list.h"
#include "victory.h"
#include "visible.h"
#include "vis_unit.h"
#include "dpl_obj.h"
#include "mst_play.h"
#include "sprite.h"
#include "Sound.h"

class RGE_Tile_List       {
public:
    int list_size;                           // 0x0
    int num_active;                          // 0x4
    int new_count;                           // 0x8
    int collapse_list;                       // 0xC
    RGE_Tile_List_Node* list;                // 0x10

    RGE_Tile_List(int param_1);

    // --- Non-Virtual Members ---
    void add_node(int param_1, int param_2);
    void del_list();
    // --- Non-Virtual Destructor ---
    ~RGE_Tile_List() noexcept(false);
    void get_list_info(RGE_Tile_List_Node** param_1, int* param_2);
    int get_new_count();
};

static_assert(sizeof(RGE_Tile_List) == 0x14, "RGE_Tile_List Size Mismatch");
static_assert(offsetof(RGE_Tile_List, list) == 0x10, "RGE_Tile_List Offset Mismatch");

class RGE_Player : public RGE_Tile_List       {
public:
    int computerPlayerValue;                 // 0x4
    int pathingAttemptCapValue;              // 0x8
    int pathingDelayCapValue;                // 0xC
    int currentUpdatePathingAttemptsValue;   // 0x10
    long checksum;                           // 0x14
    long position_checksum;                  // 0x18
    long action_checksum;                    // 0x1C
    uchar checksum_created_this_update;      // 0x20
    short master_object_num;                 // 0x22
    RGE_Master_Static_Object** master_objects; // 0x24
    RGE_Object_List* objects;                // 0x28
    RGE_Object_List* sleeping_objects;       // 0x2C
    RGE_Object_List* doppleganger_objects;   // 0x30
    RGE_Victory_Conditions* victory_conditions; // 0x34
    RGE_Visible_Map* visible;                // 0x38
    RGE_Game_World* world;                   // 0x3C
    RGE_Doppleganger_Creator* doppleganger_creator; // 0x40
    char* name;                              // 0x44
    uchar type;                              // 0x48
    short id;                                // 0x4A
    short attribute_num;                     // 0x4C
    float* attributes;                       // 0x50
    uchar culture;                           // 0x54
    RGE_Tile_List tile_list;                 // 0x58
    RGE_Tile_List diam_tile_list;            // 0x6C
    uchar game_status;                       // 0x80
    uchar resigned;                          // 0x81
    uchar* relations;                        // 0x84
    int unitDiplomacy[9];                    // 0x88
    int mutualAlly[9];                       // 0xAC
    ulong mutualExploredMask;                // 0xD0
    ulong mutualVisibleMask;                 // 0xD4
    ulong nonMutualVisibleMask;              // 0xD8
    ulong RemoveVisibleBits[9];              // 0xDC
    int allied_LOS_Enable;                   // 0x100
    uchar allied_victory;                    // 0x104
    uchar master_player_id;                  // 0x105
    RGE_Color_Table* color_table;            // 0x108
    long tribe_effect;                       // 0x10C
    Visible_Resource_Manager* VR_List;       // 0x110
    float view_x;                            // 0x114
    float view_y;                            // 0x118
    short map_x;                             // 0x11C
    short map_y;                             // 0x11E
    short selected_start_col;                // 0x120
    short selected_start_row;                // 0x122
    short selected_end_col;                  // 0x124
    short selected_end_row;                  // 0x126
    short replacement_terrain;               // 0x128
    short replacement_overlay;               // 0x12A
    short replacement_overlay_shape;         // 0x12C
    RGE_Static_Object* selected_obj;         // 0x130
    RGE_Static_Object* sel_list[25];         // 0x134
    ulong sel_object_properties;             // 0x198
    short sel_count;                         // 0x19C
    uchar groups_used[127];                  // 0x19E

    RGE_Player(int param_1, RGE_Game_World* param_2, uchar param_3);
    RGE_Player(RGE_Game_World* param_1, RGE_Master_Player* param_2, uchar param_3, char* param_4, uchar param_5, uchar param_6);

    // --- VTABLE DUMP (Source: Ghidra) ---

    // [Slot 00] Offset 0x00 (Override)
    virtual  ~RGE_Player() noexcept(false); // Ghidra: `scalar_deleting_destructor'

    // [Slot 01] Offset 0x04 (Override)
    virtual void set_game_status(uchar param_1); // Ghidra: set_game_status

    // [Slot 02] Offset 0x08 (Override)
    virtual void do_resign(int param_1); // Ghidra: do_resign

    // [Slot 03] Offset 0x0C (Override)
    virtual void changeToHumanPlayer(); // Ghidra: changeToHumanPlayer

    // [Slot 04] Offset 0x10 (Override)
    virtual void changeToComputerPlayer(); // Ghidra: changeToComputerPlayer

    // [Slot 05] Offset 0x14 (Override)
    virtual char* aiStatus(int param_1); // Ghidra: aiStatus

