#pragma once
#include "../common.h"

enum ActionType : unsigned int {
    ActionSelect = 1,
    ActionDown = 2,
    ActionUp = 3,
    ActionRightSelect = 4,
    ActionRightDown = 5,
    ActionRightUp = 6,
};

enum ButtonType : unsigned int {
    Normal = 1,
    Radio = 2,
    State = 3,
};

enum DrawType : unsigned int {
    DrawClear = 1,
    DrawPicture = 2,
    DrawTextA = 3,
    DrawPictureAndText = 4,
    DrawFillAndText = 5,
    DrawBevelPicture = 6,
};

enum NotifyType : unsigned int {
    NotifyAction = 1,
    NotifyCommand = 2,
};

enum BevelType : unsigned int {
    BevelNone = 0,
    BevelFlat = 1,
    Bevel1 = 2,
    Bevel2 = 3,
    Bevel3 = 4,
};

class TButtonPanel : public TPanel       {
public:
    char _pad_0x4[0xF0];
    long id[9];                              // 0xF4
    long id2[9];                             // 0x118
    ButtonType buttonTypeValue;              // 0x13C
    DrawType drawTypeValue;                  // 0x140
    NotifyType notifyTypeValue;              // 0x144
    TDigital* sound;                         // 0x148
    TShape* pic[9];                          // 0x14C
    short pic_index[9];                      // 0x170
    int auto_pic_pos;                        // 0x184
    long pic_x;                              // 0x188
    long pic_y;                              // 0x18C
    int all_hot;                             // 0x190
    int draw_reverse;                        // 0x194
    char* text1[9];                          // 0x198
    char* text2[9];                          // 0x1BC
    long text_x;                             // 0x1E0
    long text_y;                             // 0x1E4
    void* font;                              // 0x1E8
    long font_wid;                           // 0x1EC
    long font_hgt;                           // 0x1F0
    short num_states;                        // 0x1F4
    short cur_state;                         // 0x1F6
    int is_down;                             // 0x1F8
    TButtonPanel** radio_buttons;            // 0x1FC
    short num_radio_buttons;                 // 0x200
    ulong button_down_time;                  // 0x204
    ulong text_color1[9];                    // 0x208
    ulong text_color2[9];                    // 0x22C
    ulong highlight_text_color1[9];          // 0x250
    ulong highlight_text_color2[9];          // 0x274
    long hotkey;                             // 0x298
    int hotkey_shift;                        // 0x29C
    int bevel_type;                          // 0x2A0
    uchar bevel_color1;                      // 0x2A4
    uchar bevel_color2;                      // 0x2A5
    uchar bevel_color3;                      // 0x2A6
    uchar bevel_color4;                      // 0x2A7
    uchar bevel_color5;                      // 0x2A8
    uchar bevel_color6;                      // 0x2A9
    long key_down;                           // 0x2AC
    int disabled;                            // 0x2B0
    int sound_number;                        // 0x2B4

    TButtonPanel();

    // --- VTABLE DUMP (Source: Ghidra) ---

    // [Slot 00] Offset 0x00 (Override)
    virtual  ~TButtonPanel() noexcept(false); // Ghidra: `scalar_deleting_destructor'

    // [Slot 01] Offset 0x04 WARNING: Function body missing in analysis
    // virtual void setup();

    // [Slot 02] Offset 0x08 WARNING: Function body missing in analysis
    // virtual void set_rect();

    // [Slot 03] Offset 0x0C (Override)
    virtual void set_rect(long param_1, long param_2, long param_3, long param_4); // Ghidra: set_rect

    // [Slot 04] Offset 0x10 WARNING: Function body missing in analysis
    // virtual void set_color();

    // [Slot 05] Offset 0x14 WARNING: Function body missing in analysis
    // virtual void set_active();

    // [Slot 06] Offset 0x18 WARNING: Function body missing in analysis
    // virtual void set_positioning();

    // [Slot 07] Offset 0x1C WARNING: Function body missing in analysis
