#pragma once
#include "../common.h"
#include "asp_list.h"
#include "utmarray.h"
#include "aiuaimod.h"
#include "Path.h"
#include "act_obj.h"
#include "infmap.h"

class RGE_Check_List {
public:

    RGE_Check_List();
    virtual ~RGE_Check_List();
    virtual void add_node(RGE_Static_Object* param_1, float param_2, float param_3, uchar param_4);
};

static_assert(sizeof(RGE_Check_List) == 0x4, "RGE_Check_List Size Mismatch");

class RGE_Static_Object {
public:
    long id;                                 // 0x4
    RGE_Master_Static_Object* master_obj;    // 0x8
    RGE_Player* owner;                       // 0xC
    RGE_Sprite* sprite;                      // 0x10
    RGE_Sprite* old_sprite;                  // 0x14
    RGE_Active_Sprite_List* sprite_list;     // 0x18
    RGE_Tile* tile;                          // 0x1C
    RGE_Static_Object* inside_obj;           // 0x20
    RGE_Object_List* objects;                // 0x24
    short screen_x_offset;                   // 0x28
    short screen_y_offset;                   // 0x2A
    short shadow_x_offset;                   // 0x2C
    short shadow_y_offset;                   // 0x2E
    float hp;                                // 0x30
    uchar curr_damage_percent;               // 0x34
    uchar facet;                             // 0x35
    uchar selected;                          // 0x36
    uchar selected_group;                    // 0x37
    float world_x;                           // 0x38
    float world_y;                           // 0x3C
    float world_z;                           // 0x40
    float attribute_amount_held;             // 0x44
    uchar object_state;                      // 0x48
    uchar sleep_flag;                        // 0x49
    uchar dopple_flag;                       // 0x4A
    uchar goto_sleep_flag;                   // 0x4B
    short attribute_type_held;               // 0x4C
    uchar type;                              // 0x4E
    uchar worker_num;                        // 0x4F
    RGE_Object_Node* player_object_node;     // 0x50
    ManagedArray_int pathingGroupMembers;   // 0x54
    ManagedArray_int groupMembers;          // 0x64
    UnitAIModule* unitAIValue;               // 0x74
    int groupCommanderValue;                 // 0x78
    int zoneMapIndex;                        // 0x7C
    float groupRangeValue;                   // 0x80
    uchar inObstructionMapValue;             // 0x84
    uchar lastInObstructionMapValue;         // 0x85
    uchar underAttackValue;                  // 0x86

    virtual uchar can_attack();
    virtual int canRepair();
    virtual int inAttackRange(RGE_Static_Object* param_1);
    virtual float calc_attack_modifier(RGE_Static_Object* param_1);
    virtual float rateOfFire();
    virtual float damageCapability();
    virtual float damageCapability(RGE_Static_Object* param_1);
    virtual float weaponRange();
    virtual float minimumWeaponRange();
    virtual int currentTargetID();
    virtual float currentTargetX();
    virtual float currentTargetY();
    virtual float currentTargetZ();
    virtual uchar keepGatheringWhenObjectIsOut(int param_1);
    virtual uchar produceWhenKilledBy(int param_1);
    virtual uchar useSameZoneDropsite();
    virtual void notify(int param_1, int param_2, int param_3, long param_4, long param_5, long param_6);
    virtual int attack(int param_1, int param_2);
    virtual int attack(float param_1, float param_2, float param_3, int param_4);
