// DO NOT EDIT THIS FILE. NEVER.
// GROUND TRUTH CONTEXT FILE
// Generated from PDB for the EXE we're trying to decompile. Use this for type definitions, member offsets, and padding, AS THEY APPEARED IN THE PDB.

// --- Forward Declarations ---
class AIModule;
class AIModuleID;
class AIModuleMessage;
class AIPlay;
class AIPlayBook;
class AIPlayGroup;
class AIPlayPhase;
class AIPlayPhaseCommand;
class AIPlayPhaseTrigger;
class AIPlayStatus;
class AIPlayStatus::GroupingStruct;
class AttackMemory;
class AttackState;
class Attribute_Cost;
class BITMAPINFO256;
class BaseItem;
class BaseObject;
class Blit_Queue_Entry;
class BuildAIModule;
class BuildItem;
class BuildRes_id_node;
class BuildRes_type_node;
class BuildingLot;
class CCDAudio;
class COMMPLAYEROPTIONS;
class CombatRuleSystem;
class ConstructionAIModule;
class ConstructionItem;
class DClipInfo_List;
class DClipInfo_Node;
class DIDEVCAPS;
class DIDEVICEINSTANCEA;
class DIDEVICEOBJECTDATA;
class DIDEVICEOBJECTINSTANCEA;
class DIPROPHEADER;
class DKeyString;
class DPCAPS;
class DPCHAT;
class DPCOMPOUNDADDRESSELEMENT;
class DPCREDENTIALS;
class DPLAPPINFO;
class DPLCONNECTION;
class DPNAME;
class DPSECURITYDESC;
class DPSESSIONDESC;
class DPSESSIONDESC2;
class DString;
class DiplomacyAIModule;
class DisplaySelectedObjRec;
class DrawAreaNode;
class DriveInformation;
class EmotionalAIModule;
class FlicHead;
class FrameHead;
class Friendliness;
class HOLDER;
class ICINFO;
class IDirectDraw;
class IDirectDraw2;

class TribeAchievementsScreen;
class TribeArtifactUnitAIModule;
class TribeBuildAIModule;
class TribeBuildingUnitAIModule;
class TribeCivilianUnitAIModule;
class TribeConfigDialog;
class TribeConstructionAIModule;
class TribeDiplomacyDialog;
class TribeElephantUnitAIModule;
class TribeEndScreen;
class TribeFishingShipUnitAIModule;
class TribeGameSettingsScreen;
class TribeHuntedAnimalUnitAIModule;
class TribeInformationAIModule;
class TribeJoinScreen;
class TribeLionUnitAIModule;
class TribeLoadSavedGameScreen;
class TribeMPCreateDialog;
class TribeMPSetupScreen;
class TribeMPStartupScreen;
class TribeMainDecisionAIModule;
class TribeMenuDialog;
class TribePreditorUnitAIModule;
class TribePriestUnitAIModule;
class TribeRangedUnitAIModule;
class TribeRangedUnitAIModule2;
class TribeResourceAIModule;
class TribeSPMenuScreen;
class TribeSaveGameScreen;
class TribeSelectScenarioScreen;
class TribeSelectTribeScreen;
class TribeSendMessageDialog;
class TribeSendQuickMessageDialog;
class TribeSoldierUnitAIModule;
class TribeStrategyAIModule;
class TribeTacticalAIModule;
class TribeTowerUnitAIModule;
class TribeTradeShipUnitAIModule;
class TribeTransportShipUnitAIModule;
class UnitAIModule;
class UnitData;
class VC_LOG;
class VISIBLE_RESOURCE_REC;
class VISIBLE_UNIT_PTR;
class VISIBLE_UNIT_REC;
class VSpanMiniList;
class VSpan_Node;
class VictoryConditionRuleSystem;
class Victory_StartInfo;
class Visible_Resource_Manager;
class Visible_Unit_Manager;
class WSAData;
class Waypoint;
class XYPoint;
class XYZ;
class XYZBYTEPoint;
class XYZPoint;
class Zone_Queue;
class _DDBLTBATCH;
class _DDBLTFX;
class _DDCAPS;
class _DDCOLORKEY;
class _DDOVERLAYFX;
class _DDPIXELFORMAT;
class _DDSCAPS;
class _DDSURFACEDESC;
class _DIDATAFORMAT;
class _DIOBJECTDATAFORMAT;
class _DSBCAPS;
class _DSBUFFERDESC;
class _DSCAPS;
class _FILETIME;
class _GUID;
class _MEMORYSTATUS;
class _MMCKINFO;
class _MMIOINFO;
class _OFSTRUCT;
class _OSVERSIONINFOA;
class _RGNDATA;
class _RGNDATAHEADER;
class _SYSTEMTIME;
class _WIN32_FIND_DATAA;
class __unnamed;
class _finddata_t;
class _iobuf;
class _tag_wavheader;
class ios;
class istream;
class ostream;
class pcmwaveformat_tag;
class rdlg_list_info;
class res_file_type_info;
class resfile_header;
class resfile_id_dir_node;
class resfile_type_dir_node;
class streambuf;
class tMIXERCONTROLDETAILS;
class tMIXERCONTROLDETAILS_UNSIGNED;
class tWAVEFORMATEX;
class tagBITMAP;
class tagBITMAPCOREHEADER;
class tagBITMAPFILEHEADER;
class tagBITMAPINFOHEADER;
class tagLOGFONTA;
class tagMCI_OPEN_PARMSA;
class tagMCI_PLAY_PARMS;
class tagMCI_SEEK_PARMS;
class tagMCI_SET_PARMS;
class tagMCI_STATUS_PARMS;
class tagMIXERCONTROLA;
class tagMIXERLINEA;
class tagMIXERLINEA::__unnamed;
class tagMIXERLINECONTROLSA;
class tagMSG;
class tagPALETTEENTRY;
class tagPOINT;
class tagRECT;
class tagRGBQUAD;
class tagSIZE;
class tagTEXTMETRICA;
class tagVS_FIXEDFILEINFO;
class tagWAVEINFOCA;
class tagWNDCLASSA;
class tm;
class waveformat_tag;

// Size: 0xF0 (240 bytes)
class AIModule {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    AIModuleID idValue; // +0x4 (Size: 0x48)
    int playerNumberValue; // +0x4C (Size: 0x4)
    char playerNameValue[64]; // +0x50 (Size: 0x40)
    int runningValue; // +0x90 (Size: 0x4)
    int pausedValue; // +0x94 (Size: 0x4)
    int logHistoryValue; // +0x98 (Size: 0x4)
    int logCommonHistoryValue; // +0x9C (Size: 0x4)
    _iobuf* historyLogFile; // +0xA0 (Size: 0x4)
    char historyLogFilename[64]; // +0xA4 (Size: 0x40)
    int intelligenceLevelValue; // +0xE4 (Size: 0x4)
    int priorityValue; // +0xE8 (Size: 0x4)
    int processFrameValue; // +0xEC (Size: 0x4)
};

// Size: 0x48 (72 bytes)
class AIModuleID {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    int id; // +0x4 (Size: 0x4)
    char name[64]; // +0x8 (Size: 0x40)
};

// Size: 0x138 (312 bytes)
class AIModuleMessage {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    int id; // +0x4 (Size: 0x4)
    char text[128]; // +0x8 (Size: 0x80)
    int priority; // +0x88 (Size: 0x4)
    AIModuleID sender; // +0x8C (Size: 0x48)
    AIModuleID recipient; // +0xD4 (Size: 0x48)
    long data1; // +0x11C (Size: 0x4)
    long data2; // +0x120 (Size: 0x4)
    long data3; // +0x124 (Size: 0x4)
    AIModuleMessage* callbackMessage; // +0x128 (Size: 0x4)
    int timeStamp; // +0x12C (Size: 0x4)
    AIModuleMessage* next; // +0x130 (Size: 0x4)
    AIModuleMessage* prev; // +0x134 (Size: 0x4)
};

// Size: 0x608 (1544 bytes)
class AIPlay {
public:
    char nameValue[65]; // +0x0 (Size: 0x41)
    unsigned char minimumNumberUnitsValue; // +0x41 (Size: 0x1)
    unsigned char maximumNumberUnitsValue; // +0x42 (Size: 0x1)
    unsigned char typeValue; // +0x43 (Size: 0x1)
    unsigned char targetTypeValue[5]; // +0x44 (Size: 0x5)
    unsigned char targetCharacteristicValue[5]; // +0x49 (Size: 0x5)
    unsigned char powerValue; // +0x4E (Size: 0x1)
    unsigned char overflowValue; // +0x4F (Size: 0x1)
    unsigned char intelligenceValue; // +0x50 (Size: 0x1)
    unsigned char deathPercentageValue; // +0x51 (Size: 0x1)
    unsigned char numberGroupsValue; // +0x52 (Size: 0x1)
    AIPlayGroup groups[5]; // +0x53 (Size: 0x3C)
    unsigned char _pad_0[0x1]; // 0x008f (Gap: 1)
    AIPlayPhase phases[10]; // +0x90 (Size: 0x578)
};

// Size: 0x50 (80 bytes)
class AIPlayBook {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    int numberPlaysValue; // +0x4 (Size: 0x4)
    char nameValue[65]; // +0x8 (Size: 0x41)
    unsigned char _pad_0[0x3]; // 0x0049 (Gap: 3)
    AIPlay* plays; // +0x4C (Size: 0x4)
};

// Size: 0xC (12 bytes)
class AIPlayGroup {
public:
    unsigned char minValue[6]; // +0x0 (Size: 0x6)
    unsigned char maxValue[6]; // +0x6 (Size: 0x6)
};

// Size: 0x8C (140 bytes)
class AIPlayPhase {
public:
    AIPlayPhaseCommand commands[5]; // +0x0 (Size: 0x50)
    AIPlayPhaseTrigger triggers[3]; // +0x50 (Size: 0x3C)
};

// Size: 0x10 (16 bytes)
class AIPlayPhaseCommand {
public:
    unsigned char groupValue; // +0x0 (Size: 0x1)
    unsigned char typeValue; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    int value1Value; // +0x4 (Size: 0x4)
    int value2Value; // +0x8 (Size: 0x4)
    int value3Value; // +0xC (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class AIPlayPhaseTrigger {
public:
    unsigned char typeValue; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    int value1Value; // +0x4 (Size: 0x4)
    int value2Value; // +0x8 (Size: 0x4)
    unsigned char phaseValue; // +0xC (Size: 0x1)
    unsigned char nextPhaseValue; // +0xD (Size: 0x1)
    unsigned char _pad_1[0x2]; // 0x000e (Gap: 2)
    int randomnessValue; // +0x10 (Size: 0x4)
};

// Size: 0x1C8 (456 bytes)
class AIPlayStatus {
public:
    AIPlayStatus::GroupingStruct groupings[50]; // +0x0 (Size: 0x190)
    int playNumberValue; // +0x190 (Size: 0x4)
    int targetValue; // +0x194 (Size: 0x4)
    XYZ originalPointValue; // +0x198 (Size: 0xC)
    int originalHitPointsValue[5]; // +0x1A4 (Size: 0x14)
    unsigned char currentPhaseValue; // +0x1B8 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x01b9 (Gap: 3)
    int savedAttackerValue; // +0x1BC (Size: 0x4)
    unsigned long lastPhaseChangeTimeValue; // +0x1C0 (Size: 0x4)
    unsigned char deviationValue; // +0x1C4 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x01c5 (Gap: 3)
};

// Size: 0x8 (8 bytes)
class AIPlayStatus::GroupingStruct {
public:
    int id; // +0x0 (Size: 0x4)
    unsigned char groupID; // +0x4 (Size: 0x1)
    unsigned char type; // +0x5 (Size: 0x1)
    unsigned char _pad_end[0x2]; // 0x0006 (Gap: 2)
};

// Size: 0x18 (24 bytes)
class AttackMemory {
public:
    int id; // +0x0 (Size: 0x4)
    unsigned char type; // +0x4 (Size: 0x1)
    unsigned char minX; // +0x5 (Size: 0x1)
    unsigned char minY; // +0x6 (Size: 0x1)
    unsigned char maxX; // +0x7 (Size: 0x1)
    unsigned char maxY; // +0x8 (Size: 0x1)
    unsigned char attackingOwner; // +0x9 (Size: 0x1)
    unsigned char targetOwner; // +0xA (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x000b (Gap: 1)
    short kills; // +0xC (Size: 0x2)
    unsigned char success; // +0xE (Size: 0x1)
    unsigned char _pad_1[0x1]; // 0x000f (Gap: 1)
    unsigned long timeStamp; // +0x10 (Size: 0x4)
    int play; // +0x14 (Size: 0x4)
};

// Size: 0x2C (44 bytes)
class AttackState {
public:
    int bestTargetID; // +0x0 (Size: 0x4)
    float bestTargetValue; // +0x4 (Size: 0x4)
    int bestTargetMemoryIndex; // +0x8 (Size: 0x4)
    int iterationIndex; // +0xC (Size: 0x4)
    int attackGroupID; // +0x10 (Size: 0x4)
    int playID; // +0x14 (Size: 0x4)
    unsigned char phase; // +0x18 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0019 (Gap: 3)
    int bestNonWallTargetID; // +0x1C (Size: 0x4)
    float bestNonWallTargetValue; // +0x20 (Size: 0x4)
    int bestNonWallTargetMemoryIndex; // +0x24 (Size: 0x4)
    int active; // +0x28 (Size: 0x4)
};

// Size: 0x6 (6 bytes)
class Attribute_Cost {
public:
    short type; // +0x0 (Size: 0x2)
    short amount; // +0x2 (Size: 0x2)
    unsigned char flag; // +0x4 (Size: 0x1)
    unsigned char _pad_end[0x1]; // 0x0005 (Gap: 1)
};

// Size: 0x428 (1064 bytes)
class BITMAPINFO256 {
public:
    tagBITMAPINFOHEADER bmiHeader; // +0x0 (Size: 0x28)
    tagRGBQUAD bmiColors[256]; // +0x28 (Size: 0x400)
};

// Size: 0x6C (108 bytes)
class BaseItem {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    int typeIDValue; // +0x4 (Size: 0x4)
    int gameIDValue; // +0x8 (Size: 0x4)
    int uniqueIDValue; // +0xC (Size: 0x4)
    char nameValue[64]; // +0x10 (Size: 0x40)
    float xValue; // +0x50 (Size: 0x4)
    float yValue; // +0x54 (Size: 0x4)
    float zValue; // +0x58 (Size: 0x4)
    float xSizeValue; // +0x5C (Size: 0x4)
    float ySizeValue; // +0x60 (Size: 0x4)
    float zSizeValue; // +0x64 (Size: 0x4)
    int skipValue; // +0x68 (Size: 0x4)
};

// Size: 0xA0 (160 bytes)
class BaseObject {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    BaseObject* next; // +0x4 (Size: 0x4)
    BaseObject* prev; // +0x8 (Size: 0x4)
    int numberGroupsValue; // +0xC (Size: 0x4)
    int* groupIDValue; // +0x10 (Size: 0x4)
    int categoryIDValue; // +0x14 (Size: 0x4)
    int typeIDValue; // +0x18 (Size: 0x4)
    int gameIDValue; // +0x1C (Size: 0x4)
    char nameValue[64]; // +0x20 (Size: 0x40)
    float xPositionValue; // +0x60 (Size: 0x4)
    float yPositionValue; // +0x64 (Size: 0x4)
    float zPositionValue; // +0x68 (Size: 0x4)
    float xSizeValue; // +0x6C (Size: 0x4)
    float ySizeValue; // +0x70 (Size: 0x4)
    float zSizeValue; // +0x74 (Size: 0x4)
    int hitPointValue; // +0x78 (Size: 0x4)
    int minHitPointValue; // +0x7C (Size: 0x4)
    int maxHitPointValue; // +0x80 (Size: 0x4)
    int busyValue; // +0x84 (Size: 0x4)
    int currentTaskValue; // +0x88 (Size: 0x4)
    int currentTargetValue; // +0x8C (Size: 0x4)
    int currentTargetTypeValue; // +0x90 (Size: 0x4)
    float currentTargetXPositionValue; // +0x94 (Size: 0x4)
    float currentTargetYPositionValue; // +0x98 (Size: 0x4)
    float currentTargetZPositionValue; // +0x9C (Size: 0x4)
};

// Size: 0x20 (32 bytes)
class Blit_Queue_Entry {
public:
    tagRECT src; // +0x0 (Size: 0x10)
    tagRECT dest; // +0x10 (Size: 0x10)
};

// Size: 0x5BC (1468 bytes)
class BuildAIModule : public AIModule {
public:
    BuildItem buildList; // +0xF0 (Size: 0xB0)
    int buildListLengthValue; // +0x1A0 (Size: 0x4)
    char buildListNameValue[257]; // +0x1A4 (Size: 0x101)
    char lastBuildItemRequestedValue[257]; // +0x2A5 (Size: 0x101)
    char currentBuildItemRequestedValue[257]; // +0x3A6 (Size: 0x101)
    char nextBuildItemRequestedValue[257]; // +0x4A7 (Size: 0x101)
    int numberItemsIntoBuildListValue; // +0x5A8 (Size: 0x4)
    ManagedArray<int> typesToIgnore; // +0x5AC (Size: 0x10)
};

// Size: 0xB0 (176 bytes)
class BuildItem : public BaseItem {
public:
    BuildItem* next; // +0x6C (Size: 0x4)
    BuildItem* prev; // +0x70 (Size: 0x4)
    int buildCategoryValue; // +0x74 (Size: 0x4)
    int numberValue; // +0x78 (Size: 0x4)
    int priorityValue; // +0x7C (Size: 0x4)
    int progressValue; // +0x80 (Size: 0x4)
    int builtValue; // +0x84 (Size: 0x4)
    int buildAttemptsValue; // +0x88 (Size: 0x4)
    int buildFromValue; // +0x8C (Size: 0x4)
    int terrainSetValue; // +0x90 (Size: 0x4)
    int terrainAdjacencyValue[2]; // +0x94 (Size: 0x8)
    int placeOnElevationValue; // +0x9C (Size: 0x4)
    int numberBuildsValue; // +0xA0 (Size: 0x4)
    int buildCapValue; // +0xA4 (Size: 0x4)
    int skipCyclesValue; // +0xA8 (Size: 0x4)
    unsigned char permanentSkipValue; // +0xAC (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x00ad (Gap: 3)
};

// Size: 0x118 (280 bytes)
class BuildRes_id_node {
public:
    unsigned long id; // +0x0 (Size: 0x4)
    int dataOffset; // +0x4 (Size: 0x4)
    unsigned char* resData; // +0x8 (Size: 0x4)
    int resSize; // +0xC (Size: 0x4)
    BuildRes_id_node* next; // +0x10 (Size: 0x4)
    char fName[260]; // +0x14 (Size: 0x104)
};

// Size: 0x14 (20 bytes)
class BuildRes_type_node {
public:
    unsigned long type; // +0x0 (Size: 0x4)
    int idOffset; // +0x4 (Size: 0x4)
    int nIds; // +0x8 (Size: 0x4)
    BuildRes_id_node* idList; // +0xC (Size: 0x4)
    BuildRes_type_node* next; // +0x10 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class BuildingLot {
public:
    int typeID; // +0x0 (Size: 0x4)
    unsigned char status; // +0x4 (Size: 0x1)
    unsigned char x; // +0x5 (Size: 0x1)
    unsigned char y; // +0x6 (Size: 0x1)
    unsigned char _pad_end[0x1]; // 0x0007 (Gap: 1)
};

// Size: 0x18 (24 bytes)
class CCDAudio {
public:
    void* m_Wnd; // +0x0 (Size: 0x4)
    int m_bOpened; // +0x4 (Size: 0x4)
    unsigned int m_nDeviceID; // +0x8 (Size: 0x4)
    tagMCI_PLAY_PARMS m_mciPlayParms; // +0xC (Size: 0xC)
};

// Size: 0x1D0 (464 bytes)
class COMMPLAYEROPTIONS {
public:
    unsigned char NeedsToBeSent; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    unsigned long LastSentTime; // +0x4 (Size: 0x4)
    COMMSTATES ProgramState; // +0x8 (Size: 0x4)
    unsigned long CurrentTurn; // +0xC (Size: 0x4)
    unsigned char TurnSpeedMsec; // +0x10 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0011 (Gap: 3)
    unsigned long dcoID[10]; // +0x14 (Size: 0x28)
    unsigned long AcknowledgeAfterMsec; // +0x3C (Size: 0x4)
    unsigned char CommandTurnIncrement; // +0x40 (Size: 0x1)
    unsigned char _pad_2[0x3]; // 0x0041 (Gap: 3)
    int PlayerReady[10]; // +0x44 (Size: 0x28)
    unsigned long User1[10]; // +0x6C (Size: 0x28)
    unsigned long User2[10]; // +0x94 (Size: 0x28)
    unsigned long User3[10]; // +0xBC (Size: 0x28)
    unsigned long User4[10]; // +0xE4 (Size: 0x28)
    unsigned long User5[10]; // +0x10C (Size: 0x28)
    unsigned long User6[10]; // +0x134 (Size: 0x28)
    unsigned long User7[10]; // +0x15C (Size: 0x28)
    PLAYERHUMANITY Humanity[10]; // +0x184 (Size: 0x28)
    unsigned char InvalidPlayer[10]; // +0x1AC (Size: 0xA)
    unsigned char _pad_3[0x2]; // 0x01b6 (Gap: 2)
    unsigned long Initialized; // +0x1B8 (Size: 0x4)
    unsigned long RandomSeed; // +0x1BC (Size: 0x4)
    unsigned short HighPlayerNumber; // +0x1C0 (Size: 0x2)
    unsigned short LowPlayerNumber; // +0x1C2 (Size: 0x2)
    unsigned int HostPlayerNumber; // +0x1C4 (Size: 0x4)
    int GameHasStarted; // +0x1C8 (Size: 0x4)
    unsigned long DataSizeToFollow; // +0x1CC (Size: 0x4)
};

// Size: 0x9C8 (2504 bytes)
class CombatRuleSystem {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    unsigned char ratingValue[2500]; // +0x4 (Size: 0x9C4)
};

// Size: 0x314 (788 bytes)
class ConstructionAIModule : public AIModule {
public:
    int numberConstructionLotsValue; // +0xF0 (Size: 0x4)
    ConstructionItem constructionLots; // +0xF4 (Size: 0x80)
    int numberRandomConstructionLotsValue; // +0x174 (Size: 0x4)
    ConstructionItem randomConstructionLots; // +0x178 (Size: 0x80)
    char constructionPlanNameValue[257]; // +0x1F8 (Size: 0x101)
    unsigned char _pad_0[0x3]; // 0x02f9 (Gap: 3)
    float xReferencePointValue; // +0x2FC (Size: 0x4)
    float yReferencePointValue; // +0x300 (Size: 0x4)
    float zReferencePointValue; // +0x304 (Size: 0x4)
    int mapXSizeValue; // +0x308 (Size: 0x4)
    int mapYSizeValue; // +0x30C (Size: 0x4)
    ConstructionAIModule::PlacementResult lastPlacementReturnCodeValue; // +0x310 (Size: 0x4)
};

// Size: 0x80 (128 bytes)
class ConstructionItem : public BaseItem {
public:
    ConstructionItem* next; // +0x6C (Size: 0x4)
    ConstructionItem* prev; // +0x70 (Size: 0x4)
    int inProgressValue; // +0x74 (Size: 0x4)
    int builtValue; // +0x78 (Size: 0x4)
    int buildAttemptsValue; // +0x7C (Size: 0x4)
};

// Size: 0x70 (112 bytes)
class DClipInfo_List {
public:
    DClipInfo_Node** Zone_Ptrs; // +0x0 (Size: 0x4)
    int* Zone_Size_Ptrs; // +0x4 (Size: 0x4)
    int Used_Zones; // +0x8 (Size: 0x4)
    int Max_Zones; // +0xC (Size: 0x4)
    DClipInfo_Node* Free_Head; // +0x10 (Size: 0x4)
    int Free_Pool_Zone; // +0x14 (Size: 0x4)
    int Free_Pool_Index; // +0x18 (Size: 0x4)
    int Total_Blocks; // +0x1C (Size: 0x4)
    int Free_Blocks; // +0x20 (Size: 0x4)
    int Default_Grow_Size; // +0x24 (Size: 0x4)
    int Element_Size; // +0x28 (Size: 0x4)
    int Alloc_Count; // +0x2C (Size: 0x4)
    int Dealloc_Count; // +0x30 (Size: 0x4)
    int NewZone_Count; // +0x34 (Size: 0x4)
    int Reset_Count; // +0x38 (Size: 0x4)
    int SD_XMin; // +0x3C (Size: 0x4)
    int SD_XMax; // +0x40 (Size: 0x4)
    int SD_YMin; // +0x44 (Size: 0x4)
    int SD_YMax; // +0x48 (Size: 0x4)
    int Max_Draw_Levels; // +0x4C (Size: 0x4)
    int Accept_Min_Level; // +0x50 (Size: 0x4)
    int Accept_Max_Level; // +0x54 (Size: 0x4)
    DClipInfo_Node** Draw_Clip_Nodes; // +0x58 (Size: 0x4)
    DClipInfo_Node** Draw_Level_Head; // +0x5C (Size: 0x4)
    DClipInfo_Node** Draw_Level_Tail; // +0x60 (Size: 0x4)
    int YLine_Offset; // +0x64 (Size: 0x4)
    int YLine_Size; // +0x68 (Size: 0x4)
    short* Select_Box; // +0x6C (Size: 0x4)
};

// Size: 0x40 (64 bytes)
class DClipInfo_Node {
public:
    DClipInfo_Node* Next; // +0x0 (Size: 0x4)
    DClipInfo_Node* NextOnLevel; // +0x4 (Size: 0x4)
    int Object_ID; // +0x8 (Size: 0x4)
    Shape_Info* Shape; // +0xC (Size: 0x4)
    int Draw_Level; // +0x10 (Size: 0x4)
    int Draw_X; // +0x14 (Size: 0x4)
    int Draw_Y; // +0x18 (Size: 0x4)
    int Draw_Flag; // +0x1C (Size: 0x4)
    unsigned char* Shape_Base; // +0x20 (Size: 0x4)
    unsigned char* Color_Table; // +0x24 (Size: 0x4)
    int Xform_Mask; // +0x28 (Size: 0x4)
    int Node_Type; // +0x2C (Size: 0x4)
    short x1; // +0x30 (Size: 0x2)
    short y1; // +0x32 (Size: 0x2)
    short x2; // +0x34 (Size: 0x2)
    short y2; // +0x36 (Size: 0x2)
    short x3; // +0x38 (Size: 0x2)
    short y3; // +0x3A (Size: 0x2)
    short x4; // +0x3C (Size: 0x2)
    short y4; // +0x3E (Size: 0x2)
};

// Size: 0x2C (44 bytes)
class DIDEVCAPS {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned long dwDevType; // +0x8 (Size: 0x4)
    unsigned long dwAxes; // +0xC (Size: 0x4)
    unsigned long dwButtons; // +0x10 (Size: 0x4)
    unsigned long dwPOVs; // +0x14 (Size: 0x4)
    unsigned long dwFFSamplePeriod; // +0x18 (Size: 0x4)
    unsigned long dwFFMinTimeResolution; // +0x1C (Size: 0x4)
    unsigned long dwFirmwareRevision; // +0x20 (Size: 0x4)
    unsigned long dwHardwareRevision; // +0x24 (Size: 0x4)
    unsigned long dwFFDriverVersion; // +0x28 (Size: 0x4)
};

// Size: 0x244 (580 bytes)
class DIDEVICEINSTANCEA {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    _GUID guidInstance; // +0x4 (Size: 0x10)
    _GUID guidProduct; // +0x14 (Size: 0x10)
    unsigned long dwDevType; // +0x24 (Size: 0x4)
    char tszInstanceName[260]; // +0x28 (Size: 0x104)
    char tszProductName[260]; // +0x12C (Size: 0x104)
    _GUID guidFFDriver; // +0x230 (Size: 0x10)
    unsigned short wUsagePage; // +0x240 (Size: 0x2)
    unsigned short wUsage; // +0x242 (Size: 0x2)
};

// Size: 0x10 (16 bytes)
class DIDEVICEOBJECTDATA {
public:
    unsigned long dwOfs; // +0x0 (Size: 0x4)
    unsigned long dwData; // +0x4 (Size: 0x4)
    unsigned long dwTimeStamp; // +0x8 (Size: 0x4)
    unsigned long dwSequence; // +0xC (Size: 0x4)
};

// Size: 0x13C (316 bytes)
class DIDEVICEOBJECTINSTANCEA {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    _GUID guidType; // +0x4 (Size: 0x10)
    unsigned long dwOfs; // +0x14 (Size: 0x4)
    unsigned long dwType; // +0x18 (Size: 0x4)
    unsigned long dwFlags; // +0x1C (Size: 0x4)
    char tszName[260]; // +0x20 (Size: 0x104)
    unsigned long dwFFMaxForce; // +0x124 (Size: 0x4)
    unsigned long dwFFForceResolution; // +0x128 (Size: 0x4)
    unsigned short wCollectionNumber; // +0x12C (Size: 0x2)
    unsigned short wDesignatorIndex; // +0x12E (Size: 0x2)
    unsigned short wUsagePage; // +0x130 (Size: 0x2)
    unsigned short wUsage; // +0x132 (Size: 0x2)
    unsigned long dwDimension; // +0x134 (Size: 0x4)
    unsigned short wExponent; // +0x138 (Size: 0x2)
    unsigned short wReserved; // +0x13A (Size: 0x2)
};

// Size: 0x10 (16 bytes)
class DIPROPHEADER {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwHeaderSize; // +0x4 (Size: 0x4)
    unsigned long dwObj; // +0x8 (Size: 0x4)
    unsigned long dwHow; // +0xC (Size: 0x4)
};

// Size: 0x28 (40 bytes)
class DKeyString {
public:
    DString keyValue; // +0x0 (Size: 0x14)
    DString valueValue; // +0x14 (Size: 0x14)
};

// Size: 0x28 (40 bytes)
class DPCAPS {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned long dwMaxBufferSize; // +0x8 (Size: 0x4)
    unsigned long dwMaxQueueSize; // +0xC (Size: 0x4)
    unsigned long dwMaxPlayers; // +0x10 (Size: 0x4)
    unsigned long dwHundredBaud; // +0x14 (Size: 0x4)
    unsigned long dwLatency; // +0x18 (Size: 0x4)
    unsigned long dwMaxLocalPlayers; // +0x1C (Size: 0x4)
    unsigned long dwHeaderLength; // +0x20 (Size: 0x4)
    unsigned long dwTimeout; // +0x24 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class DPCHAT {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned short* lpszMessage; // +0x8 (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class DPCOMPOUNDADDRESSELEMENT {
public:
    _GUID guidDataType; // +0x0 (Size: 0x10)
    unsigned long dwDataSize; // +0x10 (Size: 0x4)
    void* lpData; // +0x14 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class DPCREDENTIALS {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned short* lpszUsername; // +0x8 (Size: 0x4)
    unsigned short* lpszPassword; // +0xC (Size: 0x4)
    unsigned short* lpszDomain; // +0x10 (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class DPLAPPINFO {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    _GUID guidApplication; // +0x4 (Size: 0x10)
    char* lpszAppNameA; // +0x14 (Size: 0x4)
};

// Size: 0x28 (40 bytes)
class DPLCONNECTION {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    DPSESSIONDESC2* lpSessionDesc; // +0x8 (Size: 0x4)
    DPNAME* lpPlayerName; // +0xC (Size: 0x4)
    _GUID guidSP; // +0x10 (Size: 0x10)
    void* lpAddress; // +0x20 (Size: 0x4)
    unsigned long dwAddressSize; // +0x24 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class DPNAME {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned short* lpszShortName; // +0x8 (Size: 0x4)
    unsigned short* lpszLongName; // +0xC (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class DPSECURITYDESC {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned short* lpszSSPIProvider; // +0x8 (Size: 0x4)
    unsigned short* lpszCAPIProvider; // +0xC (Size: 0x4)
    unsigned long dwCAPIProviderType; // +0x10 (Size: 0x4)
    unsigned long dwEncryptionAlgorithm; // +0x14 (Size: 0x4)
};

// Size: 0x7C (124 bytes)
class DPSESSIONDESC {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    _GUID guidSession; // +0x4 (Size: 0x10)
    unsigned long dwSession; // +0x14 (Size: 0x4)
    unsigned long dwMaxPlayers; // +0x18 (Size: 0x4)
    unsigned long dwCurrentPlayers; // +0x1C (Size: 0x4)
    unsigned long dwFlags; // +0x20 (Size: 0x4)
    char szSessionName[32]; // +0x24 (Size: 0x20)
    char szUserField[16]; // +0x44 (Size: 0x10)
    unsigned long dwReserved1; // +0x54 (Size: 0x4)
    char szPassword[16]; // +0x58 (Size: 0x10)
    unsigned long dwReserved2; // +0x68 (Size: 0x4)
    unsigned long dwUser1; // +0x6C (Size: 0x4)
    unsigned long dwUser2; // +0x70 (Size: 0x4)
    unsigned long dwUser3; // +0x74 (Size: 0x4)
    unsigned long dwUser4; // +0x78 (Size: 0x4)
};

// Size: 0x50 (80 bytes)
class DPSESSIONDESC2 {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    _GUID guidInstance; // +0x8 (Size: 0x10)
    _GUID guidApplication; // +0x18 (Size: 0x10)
    unsigned long dwMaxPlayers; // +0x28 (Size: 0x4)
    unsigned long dwCurrentPlayers; // +0x2C (Size: 0x4)
    unsigned short* lpszSessionName; // +0x30 (Size: 0x4)
    unsigned short* lpszPassword; // +0x34 (Size: 0x4)
    unsigned long dwReserved1; // +0x38 (Size: 0x4)
    unsigned long dwReserved2; // +0x3C (Size: 0x4)
    unsigned long dwUser1; // +0x40 (Size: 0x4)
    unsigned long dwUser2; // +0x44 (Size: 0x4)
    unsigned long dwUser3; // +0x48 (Size: 0x4)
    unsigned long dwUser4; // +0x4C (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class DString {
public:
    char* stringValue; // +0x0 (Size: 0x4)
    int lengthValue; // +0x4 (Size: 0x4)
    int numWordsValue; // +0x8 (Size: 0x4)
    int indexValue; // +0xC (Size: 0x4)
    int currentWordValue; // +0x10 (Size: 0x4)
};

// Size: 0x150 (336 bytes)
class DiplomacyAIModule : public AIModule {
public:
    MainDecisionAIModule* md; // +0xF0 (Size: 0x4)
    int dislikeTable[10]; // +0xF4 (Size: 0x28)
    int likeTable[10]; // +0x11C (Size: 0x28)
    unsigned char changeableTable[10]; // +0x144 (Size: 0xA)
    unsigned char _pad_end[0x2]; // 0x014e (Gap: 2)
};

// Size: 0x14 (20 bytes)
class DisplaySelectedObjRec {
public:
    int active; // +0x0 (Size: 0x4)
    int id; // +0x4 (Size: 0x4)
    unsigned long start_time; // +0x8 (Size: 0x4)
    unsigned long duration; // +0xC (Size: 0x4)
    int select_type; // +0x10 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class DrawAreaNode {
public:
    TDrawArea* DrawArea; // +0x0 (Size: 0x4)
    DrawAreaNode* PrevNode; // +0x4 (Size: 0x4)
    DrawAreaNode* NextNode; // +0x8 (Size: 0x4)
};

// Size: 0x274 (628 bytes)
class DriveInformation {
public:
    int initialDriveValue; // +0x0 (Size: 0x4)
    char initialDirectoryValue[256]; // +0x4 (Size: 0x100)
    int currentDriveValue; // +0x104 (Size: 0x4)
    char currentDirectoryValue[256]; // +0x108 (Size: 0x100)
    int driveValues[27]; // +0x208 (Size: 0x6C)
};

// Size: 0x1C0 (448 bytes)
class EmotionalAIModule : public AIModule {
public:
    MainDecisionAIModule* md; // +0xF0 (Size: 0x4)
    int stateValue[6]; // +0xF4 (Size: 0x18)
    char stateNameValue[6][30]; // +0x10C (Size: 0xB4)
};

// Size: 0x84 (132 bytes)
class FlicHead {
public:
    long size; // +0x0 (Size: 0x4)
    unsigned short type; // +0x4 (Size: 0x2)
    short frames; // +0x6 (Size: 0x2)
    short width; // +0x8 (Size: 0x2)
    short height; // +0xA (Size: 0x2)
    short depth; // +0xC (Size: 0x2)
    short flags; // +0xE (Size: 0x2)
    long speed; // +0x10 (Size: 0x4)
    short reserved1; // +0x14 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x0016 (Gap: 2)
    long created; // +0x18 (Size: 0x4)
    long creator; // +0x1C (Size: 0x4)
    long updated; // +0x20 (Size: 0x4)
    long updater; // +0x24 (Size: 0x4)
    short aspect_dx; // +0x28 (Size: 0x2)
    short aspect_dy; // +0x2A (Size: 0x2)
    char reserved2[38]; // +0x2C (Size: 0x26)
    unsigned char _pad_1[0x2]; // 0x0052 (Gap: 2)
    char* oframe1; // +0x54 (Size: 0x4)
    char* oframe2; // +0x58 (Size: 0x4)
    char reserved3[40]; // +0x5C (Size: 0x28)
};

// Size: 0x10 (16 bytes)
class FrameHead {
public:
    long size; // +0x0 (Size: 0x4)
    short type; // +0x4 (Size: 0x2)
    short chunks; // +0x6 (Size: 0x2)
    char reserved[8]; // +0x8 (Size: 0x8)
};

// Size: 0x40 (64 bytes)
class Friendliness {
public:
    int Attitude[16]; // +0x0 (Size: 0x40)
};

// Size: 0x18 (24 bytes)
class HOLDER {
public:
    char* HoldMsg; // +0x0 (Size: 0x4)
    unsigned int Serial; // +0x4 (Size: 0x4)
    unsigned int Length; // +0x8 (Size: 0x4)
    unsigned long dcoFromID; // +0xC (Size: 0x4)
    unsigned long dcoReceiveID; // +0x10 (Size: 0x4)
    unsigned int fromPlayer; // +0x14 (Size: 0x4)
};

// Size: 0x238 (568 bytes)
class ICINFO {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long fccType; // +0x4 (Size: 0x4)
    unsigned long fccHandler; // +0x8 (Size: 0x4)
    unsigned long dwFlags; // +0xC (Size: 0x4)
    unsigned long dwVersion; // +0x10 (Size: 0x4)
    unsigned long dwVersionICM; // +0x14 (Size: 0x4)
    unsigned short szName[16]; // +0x18 (Size: 0x20)
    unsigned short szDescription[128]; // +0x38 (Size: 0x100)
    unsigned short szDriver[128]; // +0x138 (Size: 0x100)
};

// Size: 0x4 (4 bytes)
class IDirectDraw : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectDraw2 : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectDrawClipper : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectDrawPalette : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectDrawSurface : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectDrawSurface3 : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectInputA : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectInputDeviceA : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectPlay : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectPlay2 : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectPlay3 : public IDirectPlay2 {
public:
};

// Size: 0x4 (4 bytes)
class IDirectPlayLobby : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectPlayLobby2 : public IDirectPlayLobby {
public:
};

// Size: 0x4 (4 bytes)
class IDirectSound : public IUnknown {
public:
};

// Size: 0x4 (4 bytes)
class IDirectSoundBuffer : public IUnknown {
public:
};

// Size: 0xA0 (160 bytes)
class IPAD {
public:
    char DottedIPAddress[32]; // +0x0 (Size: 0x20)
    char Alias[128]; // +0x20 (Size: 0x80)
};

// Size: 0x4 (4 bytes)
class IUnknown {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
};

// Size: 0x28 (40 bytes)
class InfluenceMap {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    int xSizeValue; // +0x4 (Size: 0x4)
    int ySizeValue; // +0x8 (Size: 0x4)
    int xReferencePointValue; // +0xC (Size: 0x4)
    int yReferencePointValue; // +0x10 (Size: 0x4)
    unsigned char* valueValue; // +0x14 (Size: 0x4)
    unsigned char** rowValue; // +0x18 (Size: 0x4)
    int coverageCountValue; // +0x1C (Size: 0x4)
    int connectionCountValue; // +0x20 (Size: 0x4)
    unsigned char unchangeableLimitValue; // +0x24 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x0025 (Gap: 3)
};

// Size: 0xF0 (240 bytes)
class InformationAIModule : public AIModule {
public:
};

// Size: 0x28 (40 bytes)
class Item_Avail {
public:
    char* name; // +0x0 (Size: 0x4)
    short id; // +0x4 (Size: 0x2)
    short pict; // +0x6 (Size: 0x2)
    short inventory_item_1; // +0x8 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x000a (Gap: 2)
    float inventory_cost_1; // +0xC (Size: 0x4)
    short inventory_item_2; // +0x10 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x0012 (Gap: 2)
    float inventory_cost_2; // +0x14 (Size: 0x4)
    short inventory_item_3; // +0x18 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x001a (Gap: 2)
    float inventory_cost_3; // +0x1C (Size: 0x4)
    long help_string_id; // +0x20 (Size: 0x4)
    long help_page_id; // +0x24 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class LINEINFO {
public:
    int AllTrans; // +0x0 (Size: 0x4)
    int MidSolid; // +0x4 (Size: 0x4)
    long StartX; // +0x8 (Size: 0x4)
    long EndX; // +0xC (Size: 0x4)
};

// Size: 0xC (12 bytes)
class LOSTBL {
public:
    int y_delta; // +0x0 (Size: 0x4)
    int x_left; // +0x4 (Size: 0x4)
    int x_right; // +0x8 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class MSGFORMAT_ACKNOWLEDGE_GUARANTEED {
public:
    unsigned char Command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    unsigned int Serialno; // +0x4 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class MSGFORMAT_ALL_DONE {
public:
    unsigned char Command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    unsigned long ExecuteOnTurn; // +0x4 (Size: 0x4)
    unsigned char HighLatencyCenti; // +0x8 (Size: 0x1)
    unsigned char FrameRateMsec; // +0x9 (Size: 0x1)
    unsigned char _pad_end[0x2]; // 0x000a (Gap: 2)
};

// Size: 0x114 (276 bytes)
class MSGFORMAT_CHAT {
public:
    unsigned char FromGamerID; // +0x0 (Size: 0x1)
    unsigned char DestPlayers[10]; // +0x1 (Size: 0xA)
    unsigned char _pad_0[0x1]; // 0x000b (Gap: 1)
    unsigned int TextSize; // +0xC (Size: 0x4)
    unsigned char Pregame; // +0x10 (Size: 0x1)
    char ChatMsg[256]; // +0x11 (Size: 0x100)
    unsigned char _pad_end[0x3]; // 0x0111 (Gap: 3)
};

// Size: 0x24 (36 bytes)
class MSGFORMAT_CHECKSUM {
public:
    unsigned long WorldTime; // +0x0 (Size: 0x4)
    unsigned long WorldTurn; // +0x4 (Size: 0x4)
    unsigned int Random; // +0x8 (Size: 0x4)
    long cs1; // +0xC (Size: 0x4)
    long cs2; // +0x10 (Size: 0x4)
    long cs3; // +0x14 (Size: 0x4)
    long cs4; // +0x18 (Size: 0x4)
    long cs5; // +0x1C (Size: 0x4)
    unsigned long PingInitiated; // +0x20 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class MSGFORMAT_HEADER_GUARANTEED {
public:
    unsigned char Command; // +0x0 (Size: 0x1)
    unsigned char Sequence; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    unsigned long ExecuteOnTurn; // +0x4 (Size: 0x4)
    unsigned int Serialno; // +0x8 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class MSGFORMAT_KILL_PLAYER {
public:
    unsigned int PlayerNo; // +0x0 (Size: 0x4)
    unsigned long dcoID; // +0x4 (Size: 0x4)
    unsigned long CurrentTurn; // +0x8 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class MSGFORMAT_LATENCY {
public:
    unsigned char Command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    unsigned long Initiated; // +0x4 (Size: 0x4)
    unsigned long CurrentTurn; // +0x8 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class MSGFORMAT_MISSING_PLAYER {
public:
    unsigned char Command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    unsigned long PlayerID; // +0x4 (Size: 0x4)
};

// Size: 0x4 (4 bytes)
class MSGFORMAT_ONTURN {
public:
    unsigned long ExecuteOnTurn; // +0x0 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class MSGFORMAT_RESEND {
public:
    unsigned char Command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    unsigned int Serialno; // +0x4 (Size: 0x4)
};

// Size: 0x28 (40 bytes)
class MSGFORMAT_SETREADYOPTIONS {
public:
    unsigned char Command; // +0x0 (Size: 0x1)
    unsigned char Ready; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    unsigned long User1; // +0x4 (Size: 0x4)
    unsigned long User2; // +0x8 (Size: 0x4)
    unsigned long User3; // +0xC (Size: 0x4)
    unsigned long User4; // +0x10 (Size: 0x4)
    unsigned long User5; // +0x14 (Size: 0x4)
    unsigned long User6; // +0x18 (Size: 0x4)
    unsigned long User7; // +0x1C (Size: 0x4)
    unsigned long CommunicationsVersionCode; // +0x20 (Size: 0x4)
    unsigned char RGEGuaranteed; // +0x24 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x0025 (Gap: 3)
};

// Size: 0x4 (4 bytes)
class MSGFORMAT_SPEEDCHANGE {
public:
    unsigned short BufferFrames; // +0x0 (Size: 0x2)
    unsigned short FrameSizeMsec; // +0x2 (Size: 0x2)
};

// Size: 0x104 (260 bytes)
class MainDecisionAIModule : public AIModule {
public:
    RGE_Player* player; // +0xF0 (Size: 0x4)
    ManagedArray<int> objects; // +0xF4 (Size: 0x10)
};

// Size: 0x10 (16 bytes)
class ManagedArray<int> {
public:
    int* value; // +0x0 (Size: 0x4)
    int numberValue; // +0x4 (Size: 0x4)
    int desiredNumberValue; // +0x8 (Size: 0x4)
    int maximumSizeValue; // +0xC (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class Map_Stack {
public:
    long x; // +0x0 (Size: 0x4)
    long y; // +0x4 (Size: 0x4)
    float cost; // +0x8 (Size: 0x4)
    float tot_cost; // +0xC (Size: 0x4)
    Map_Stack* next; // +0x10 (Size: 0x4)
    Map_Stack* prev; // +0x14 (Size: 0x4)
};

// Size: 0x2C (44 bytes)
class MouseClickInfo {
public:
    int object_group; // +0x0 (Size: 0x4)
    int self_action; // +0x4 (Size: 0x4)
    int self_text_id; // +0x8 (Size: 0x4)
    int gaia_action; // +0xC (Size: 0x4)
    int gaia_text_id; // +0x10 (Size: 0x4)
    int ally_action; // +0x14 (Size: 0x4)
    int ally_text_id; // +0x18 (Size: 0x4)
    int neutral_action; // +0x1C (Size: 0x4)
    int neutral_text_id; // +0x20 (Size: 0x4)
    int enemy_action; // +0x24 (Size: 0x4)
    int enemy_text_id; // +0x28 (Size: 0x4)
};

// Size: 0x1C (28 bytes)
class MsgQueue {
public:
    unsigned long Code; // +0x0 (Size: 0x4)
    unsigned long ExecTurn; // +0x4 (Size: 0x4)
    unsigned char SeqNo; // +0x8 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0009 (Gap: 3)
    char* msgptr; // +0xC (Size: 0x4)
    unsigned int From; // +0x10 (Size: 0x4)
    unsigned int Size; // +0x14 (Size: 0x4)
    int ControlCommand; // +0x18 (Size: 0x4)
};

// Size: 0x80 (128 bytes)
class NAME {
public:
    char Text[128]; // +0x0 (Size: 0x80)
};

// Size: 0x18 (24 bytes)
class NotifyEvent {
public:
    int caller; // +0x0 (Size: 0x4)
    int recipient; // +0x4 (Size: 0x4)
    int mType; // +0x8 (Size: 0x4)
    long p1; // +0xC (Size: 0x4)
    long p2; // +0x10 (Size: 0x4)
    long p3; // +0x14 (Size: 0x4)
};

// Size: 0x24 (36 bytes)
class ObjectMemory {
public:
    int id; // +0x0 (Size: 0x4)
    short type; // +0x4 (Size: 0x2)
    short group; // +0x6 (Size: 0x2)
    unsigned char x; // +0x8 (Size: 0x1)
    unsigned char y; // +0x9 (Size: 0x1)
    unsigned char z; // +0xA (Size: 0x1)
    unsigned char owner; // +0xB (Size: 0x1)
    short hitPoints; // +0xC (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x000e (Gap: 2)
    int attackAttempts; // +0x10 (Size: 0x4)
    unsigned char kills; // +0x14 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0015 (Gap: 3)
    float damageCapability; // +0x18 (Size: 0x4)
    float rateOfFire; // +0x1C (Size: 0x4)
    float range; // +0x20 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class OldUnitData {
public:
    int id; // +0x0 (Size: 0x4)
    int data1; // +0x4 (Size: 0x4)
    int data2; // +0x8 (Size: 0x4)
    int data3; // +0xC (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class OldUnitData2 {
public:
    int id; // +0x0 (Size: 0x4)
    int data1; // +0x4 (Size: 0x4)
    int data2; // +0x8 (Size: 0x4)
    int data3; // +0xC (Size: 0x4)
    int target; // +0x10 (Size: 0x4)
};

// Size: 0x24 (36 bytes)
class OrderEvent {
public:
    int issuer; // +0x0 (Size: 0x4)
    int orderType; // +0x4 (Size: 0x4)
    int priority; // +0x8 (Size: 0x4)
    int target; // +0xC (Size: 0x4)
    int targetOwner; // +0x10 (Size: 0x4)
    float targetX; // +0x14 (Size: 0x4)
    float targetY; // +0x18 (Size: 0x4)
    float targetZ; // +0x1C (Size: 0x4)
    float range; // +0x20 (Size: 0x4)
};

// Size: 0x30 (48 bytes)
class Ov_Sprite_Draw_Rec {
public:
    Ov_Sprite_Draw_Rec* next; // +0x0 (Size: 0x4)
    Ov_Sprite_Draw_Rec* prev; // +0x4 (Size: 0x4)
    TShape* theShape; // +0x8 (Size: 0x4)
    int thefacet; // +0xC (Size: 0x4)
    int world_x; // +0x10 (Size: 0x4)
    int world_y; // +0x14 (Size: 0x4)
    int flags; // +0x18 (Size: 0x4)
    int drawLevel; // +0x1C (Size: 0x4)
    int displayfunction; // +0x20 (Size: 0x4)
    unsigned long LastDrawTime; // +0x24 (Size: 0x4)
    unsigned long DrawTimeInterval; // +0x28 (Size: 0x4)
    unsigned char* colortable; // +0x2C (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class PAL_TABLE {
public:
    int index; // +0x0 (Size: 0x4)
    unsigned char red; // +0x4 (Size: 0x1)
    unsigned char green; // +0x5 (Size: 0x1)
    unsigned char blue; // +0x6 (Size: 0x1)
    unsigned char reserved; // +0x7 (Size: 0x1)
};

// Size: 0x14 (20 bytes)
class PLAYER_SCORE {
public:
    int comm_id; // +0x0 (Size: 0x4)
    int player_id; // +0x4 (Size: 0x4)
    int team_id; // +0x8 (Size: 0x4)
    long player_score; // +0xC (Size: 0x4)
    long team_score; // +0x10 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class PanelNode {
public:
    TPanel* panel; // +0x0 (Size: 0x4)
    PanelNode* prev_node; // +0x4 (Size: 0x4)
    PanelNode* next_node; // +0x8 (Size: 0x4)
};

// Size: 0x34 (52 bytes)
class Path {
public:
    unsigned long timeStampValue; // +0x0 (Size: 0x4)
    Waypoint startValue; // +0x4 (Size: 0x10)
    Waypoint goalValue; // +0x14 (Size: 0x10)
    Waypoint* pathValue; // +0x24 (Size: 0x4)
    int maxSizeValue; // +0x28 (Size: 0x4)
    int currentSizeValue; // +0x2C (Size: 0x4)
    int currentWaypointValue; // +0x30 (Size: 0x4)
};

// Size: 0x11DCF8 (1170680 bytes)
class PathingSystem {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    int xSizeValue; // +0x4 (Size: 0x4)
    int ySizeValue; // +0x8 (Size: 0x4)
    unsigned char facetValue[255][255]; // +0xC (Size: 0xFE01)
    unsigned char _pad_0[0x3]; // 0xfe0d (Gap: 3)
    int MGP_costValue[255][255]; // +0xFE10 (Size: 0x3F804)
    PathingSystem::MGP_FloatHeap MGP_openPaths[65026]; // +0x4F614 (Size: 0x7F010)
    unsigned char obstructionValue[1020][255]; // +0xCE624 (Size: 0x3F804)
    unsigned char miscValue[255][255]; // +0x10DE28 (Size: 0xFE01)
    unsigned char _pad_1[0x3]; // 0x11dc29 (Gap: 3)
    int numberOpenPathsValue; // +0x11DC2C (Size: 0x4)
    PathingSystem::MGP_FloatHeap MGP_bestTraversedPath; // +0x11DC30 (Size: 0x8)
    int numberTraversedPathsValue; // +0x11DC38 (Size: 0x4)
    RGE_Map* mapValue; // +0x11DC3C (Size: 0x4)
    RGE_Game_World* worldValue; // +0x11DC40 (Size: 0x4)
    RGE_Moving_Object* currentObject; // +0x11DC44 (Size: 0x4)
    int currentObjectInObMap; // +0x11DC48 (Size: 0x4)
    int currentTargetID; // +0x11DC4C (Size: 0x4)
    float* currentTerrainTable; // +0x11DC50 (Size: 0x4)
    float currentXOffset; // +0x11DC54 (Size: 0x4)
    float currentYOffset; // +0x11DC58 (Size: 0x4)
    int currentTerrainException1; // +0x11DC5C (Size: 0x4)
    int currentTerrainException2; // +0x11DC60 (Size: 0x4)
    ManagedArray<int> initialCollidingObjects; // +0x11DC64 (Size: 0x10)
    int startOfPath; // +0x11DC74 (Size: 0x4)
    int checkTerrainOnFirstPass; // +0x11DC78 (Size: 0x4)
    XYPoint initialTile; // +0x11DC7C (Size: 0x8)
    XYPoint minTarget; // +0x11DC84 (Size: 0x8)
    XYPoint maxTarget; // +0x11DC8C (Size: 0x8)
    XYPoint minInitialPosition; // +0x11DC94 (Size: 0x8)
    XYPoint maxInitialPosition; // +0x11DC9C (Size: 0x8)
    float averageNumWaypoints; // +0x11DCA4 (Size: 0x4)
    float averagePathLength; // +0x11DCA8 (Size: 0x4)
    float averagePathIterations; // +0x11DCAC (Size: 0x4)
    int numAttempts; // +0x11DCB0 (Size: 0x4)
    int numFails; // +0x11DCB4 (Size: 0x4)
    int numSuccesses; // +0x11DCB8 (Size: 0x4)
    int numInitialPathsValue; // +0x11DCBC (Size: 0x4)
    int numContinuePathsValue; // +0x11DCC0 (Size: 0x4)
    int numCanPathsValue; // +0x11DCC4 (Size: 0x4)
    int MGP_closestTargetDistance; // +0x11DCC8 (Size: 0x4)
    float averageClosestTargetDistance; // +0x11DCCC (Size: 0x4)
    float averageSuccessTime; // +0x11DCD0 (Size: 0x4)
    float averageFailTime; // +0x11DCD4 (Size: 0x4)
    unsigned char CurrentFacetMask; // +0x11DCD8 (Size: 0x1)
    unsigned char _pad_2[0x3]; // 0x11dcd9 (Gap: 3)
    int currentUnobstructibleGroupID; // +0x11DCDC (Size: 0x4)
    int currentUnobstructiblePlayerID; // +0x11DCE0 (Size: 0x4)
    ManagedArray<int> currentUnobstructibles; // +0x11DCE4 (Size: 0x10)
    int aiPS; // +0x11DCF4 (Size: 0x4)
};

// Size: 0x2 (2 bytes)
class PathingSystem::BYTEPoint {
public:
    unsigned char x; // +0x0 (Size: 0x1)
    unsigned char y; // +0x1 (Size: 0x1)
};

// Size: 0x8 (8 bytes)
class PathingSystem::FloatHeap {
public:
    unsigned char x; // +0x0 (Size: 0x1)
    unsigned char y; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    float total; // +0x4 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class PathingSystem::MGP_FloatHeap {
public:
    unsigned char x; // +0x0 (Size: 0x1)
    unsigned char y; // +0x1 (Size: 0x1)
    unsigned short next; // +0x2 (Size: 0x2)
    int total; // +0x4 (Size: 0x4)
};

// Size: 0x130 (304 bytes)
class PlacementState {
public:
    int buildingTypeID; // +0x0 (Size: 0x4)
    float buildingSize; // +0x4 (Size: 0x4)
    char buildingName[256]; // +0x8 (Size: 0x100)
    int builderID; // +0x108 (Size: 0x4)
    int minimumDistance; // +0x10C (Size: 0x4)
    int maximumDistance; // +0x110 (Size: 0x4)
    int active; // +0x114 (Size: 0x4)
    XYPoint bestPoint; // +0x118 (Size: 0x8)
    int bestPointValue; // +0x120 (Size: 0x4)
    int iterationX; // +0x124 (Size: 0x4)
    int randomInfluence; // +0x128 (Size: 0x4)
    BuildItem* buildItem; // +0x12C (Size: 0x4)
};

// Size: 0x100 (256 bytes)
class PlayerName {
public:
    char Name[256]; // +0x0 (Size: 0x100)
};

// Size: 0x10 (16 bytes)
class Player_Start_Info {
public:
    int Gold; // +0x0 (Size: 0x4)
    int Wood; // +0x4 (Size: 0x4)
    int Food; // +0x8 (Size: 0x4)
    int Stone; // +0xC (Size: 0x4)
};

// Size: 0x1058 (4184 bytes)
class PointMaker {
public:
    PrimaryPt Prime; // +0x0 (Size: 0x8)
    PtToPt Point[500]; // +0x8 (Size: 0xFA0)
    char* Mask_2x2; // +0xFA8 (Size: 0x4)
    char* Mask_3x3; // +0xFAC (Size: 0x4)
    char* Mask_4x4; // +0xFB0 (Size: 0x4)
    char* Mask_5x5; // +0xFB4 (Size: 0x4)
    int x; // +0xFB8 (Size: 0x4)
    int y; // +0xFBC (Size: 0x4)
    int NumSplitsPerBranch; // +0xFC0 (Size: 0x4)
    int NumberOfSatellites; // +0xFC4 (Size: 0x4)
    int ChanceOfNextNode; // +0xFC8 (Size: 0x4)
    int MaxNumberOfBranches; // +0xFCC (Size: 0x4)
    int MaxBranchFlag; // +0xFD0 (Size: 0x4)
    int Width; // +0xFD4 (Size: 0x4)
    int Height; // +0xFD8 (Size: 0x4)
    int MinimumNumTiles; // +0xFDC (Size: 0x4)
    int NumNodes; // +0xFE0 (Size: 0x4)
    int NumTilesActuallyChosen; // +0xFE4 (Size: 0x4)
    int CurrentPoint; // +0xFE8 (Size: 0x4)
    int ProbabilityTiles; // +0xFEC (Size: 0x4)
    int TargetProbabilityCount; // +0xFF0 (Size: 0x4)
    int ProbabilityAdd; // +0xFF4 (Size: 0x4)
    int BranchRadius; // +0xFF8 (Size: 0x4)
    int SatelliteRadius; // +0xFFC (Size: 0x4)
    int PrimaryRadius; // +0x1000 (Size: 0x4)
    int SizeArrays; // +0x1004 (Size: 0x4)
    int SatelliteDistance; // +0x1008 (Size: 0x4)
    int BranchDistance; // +0x100C (Size: 0x4)
    int DirX; // +0x1010 (Size: 0x4)
    int DirY; // +0x1014 (Size: 0x4)
    int MaxNumberOfBranchLevels; // +0x1018 (Size: 0x4)
    int CurrentNumberOfBranchLevels; // +0x101C (Size: 0x4)
    char* ExternalArray; // +0x1020 (Size: 0x4)
    char* ProbArray; // +0x1024 (Size: 0x4)
    char* PlacementArray; // +0x1028 (Size: 0x4)
    char* WritableExternalArray; // +0x102C (Size: 0x4)
    int DoNotDrawOnFlag; // +0x1030 (Size: 0x4)
    int DrawOnOnlyFlag; // +0x1034 (Size: 0x4)
    int DrawOnlyInExternalArrayFlag; // +0x1038 (Size: 0x4)
    int DrawToOneArrayFlag; // +0x103C (Size: 0x4)
    int BorderDepthPercentage; // +0x1040 (Size: 0x4)
    int LeftLimit; // +0x1044 (Size: 0x4)
    int RightLimit; // +0x1048 (Size: 0x4)
    int TopLimit; // +0x104C (Size: 0x4)
    int BottomLimit; // +0x1050 (Size: 0x4)
    char SpecialLandType; // +0x1054 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x1055 (Gap: 3)
};

// Size: 0x8 (8 bytes)
class PrimaryPt {
public:
    int x; // +0x0 (Size: 0x4)
    int y; // +0x4 (Size: 0x4)
};

// Size: 0x4 (4 bytes)
class Production_Queue_Record {
public:
    short master_id; // +0x0 (Size: 0x2)
    short unit_count; // +0x2 (Size: 0x2)
};

// Size: 0x8 (8 bytes)
class PtToPt {
public:
    int x; // +0x0 (Size: 0x4)
    int y; // +0x4 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class QuadrantLog {
public:
    int numberExploredTiles; // +0x0 (Size: 0x4)
    int numberAttacksOnUs; // +0x4 (Size: 0x4)
    int numberAttacksByUs; // +0x8 (Size: 0x4)
};

// Size: 0x38 (56 bytes)
class RESENDER {
public:
    unsigned long TimeSent; // +0x0 (Size: 0x4)
    unsigned int Serial; // +0x4 (Size: 0x4)
    char* ResendMsg; // +0x8 (Size: 0x4)
    unsigned int Length; // +0xC (Size: 0x4)
    unsigned int DestMap[10]; // +0x10 (Size: 0x28)
};

// Size: 0x40 (64 bytes)
class RGE_Action {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    short action_type; // +0x4 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x0006 (Gap: 2)
    RGE_Action_Object* obj; // +0x8 (Size: 0x4)
    unsigned char state; // +0xC (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x000d (Gap: 3)
    RGE_Static_Object* target_obj; // +0x10 (Size: 0x4)
    RGE_Static_Object* target_obj2; // +0x14 (Size: 0x4)
    int targetID; // +0x18 (Size: 0x4)
    int target2ID; // +0x1C (Size: 0x4)
    float target_x; // +0x20 (Size: 0x4)
    float target_y; // +0x24 (Size: 0x4)
    float target_z; // +0x28 (Size: 0x4)
    float timer; // +0x2C (Size: 0x4)
    RGE_Task* task; // +0x30 (Size: 0x4)
    RGE_Action_List* sub_actions; // +0x34 (Size: 0x4)
    RGE_Sprite* sprite; // +0x38 (Size: 0x4)
    unsigned char subActionValue; // +0x3C (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x003d (Gap: 3)
};

// Size: 0x5C (92 bytes)
class RGE_Action_Attack : public RGE_Action {
public:
    RGE_Sprite* move_sprite; // +0x40 (Size: 0x4)
    RGE_Sprite* fight_sprite; // +0x44 (Size: 0x4)
    RGE_Sprite* wait_sprite; // +0x48 (Size: 0x4)
    float range; // +0x4C (Size: 0x4)
    float min_range; // +0x50 (Size: 0x4)
    short missile_id; // +0x54 (Size: 0x2)
    short fire_missile_at_frame; // +0x56 (Size: 0x2)
    unsigned char need_to_attack; // +0x58 (Size: 0x1)
    unsigned char was_same_owner; // +0x59 (Size: 0x1)
    unsigned char indirect_fire_flag; // +0x5A (Size: 0x1)
    unsigned char _pad_end[0x1]; // 0x005b (Gap: 1)
};

// Size: 0x40 (64 bytes)
class RGE_Action_Bird : public RGE_Action {
public:
};

// Size: 0x40 (64 bytes)
class RGE_Action_Enter : public RGE_Action {
public:
};

// Size: 0x40 (64 bytes)
class RGE_Action_Explore : public RGE_Action {
public:
};

// Size: 0x44 (68 bytes)
class RGE_Action_Gather : public RGE_Action {
public:
    int targetType; // +0x40 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Action_List {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Action_Object* obj; // +0x4 (Size: 0x4)
    RGE_Action_Node* list; // +0x8 (Size: 0x4)
};

// Size: 0x40 (64 bytes)
class RGE_Action_Make : public RGE_Action {
public:
};

// Size: 0x54 (84 bytes)
class RGE_Action_Missile : public RGE_Action {
public:
    float velocity_x; // +0x40 (Size: 0x4)
    float velocity_y; // +0x44 (Size: 0x4)
    float velocity_z; // +0x48 (Size: 0x4)
    float ballistic_velocity; // +0x4C (Size: 0x4)
    float ballistic_acceleration; // +0x50 (Size: 0x4)
};

// Size: 0x44 (68 bytes)
class RGE_Action_Move_To : public RGE_Action {
public:
    float range; // +0x40 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class RGE_Action_Node {
public:
    RGE_Action* action; // +0x0 (Size: 0x4)
    RGE_Action_Node* next; // +0x4 (Size: 0x4)
};

// Size: 0x194 (404 bytes)
class RGE_Action_Object : public RGE_Moving_Object {
public:
    unsigned char waiting; // +0x180 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0181 (Gap: 3)
    RGE_Action_List* actions; // +0x184 (Size: 0x4)
    unsigned char command_flag; // +0x188 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0189 (Gap: 3)
    int lastActionValue; // +0x18C (Size: 0x4)
    int lastActionStateValue; // +0x190 (Size: 0x4)
};

// Size: 0x40 (64 bytes)
class RGE_Action_Transport : public RGE_Action {
public:
};

// Size: 0x28 (40 bytes)
class RGE_Active_Animated_Sprite : public RGE_Active_Sprite {
public:
    short frame; // +0x14 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x0016 (Gap: 2)
    float animate_interval; // +0x18 (Size: 0x4)
    float animate_last; // +0x1C (Size: 0x4)
    short last_frame; // +0x20 (Size: 0x2)
    unsigned char frame_changed; // +0x22 (Size: 0x1)
    unsigned char frame_looped; // +0x23 (Size: 0x1)
    unsigned char animate_flag; // +0x24 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x0025 (Gap: 3)
};

// Size: 0x14 (20 bytes)
class RGE_Active_Sprite {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Sprite* sprite; // +0x4 (Size: 0x4)
    unsigned char type; // +0x8 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0009 (Gap: 3)
    long offset_x; // +0xC (Size: 0x4)
    long offset_y; // +0x10 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Active_Sprite_List {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Active_Sprite_Node* list; // +0x4 (Size: 0x4)
    RGE_Static_Object* owner; // +0x8 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Active_Sprite_Node {
public:
    RGE_Active_Sprite* node; // +0x0 (Size: 0x4)
    unsigned char order; // +0x4 (Size: 0x1)
    unsigned char count; // +0x5 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0006 (Gap: 2)
    RGE_Active_Sprite_Node* next; // +0x8 (Size: 0x4)
};

// Size: 0x8C (140 bytes)
class RGE_Animated_Object : public RGE_Static_Object {
public:
    float speed; // +0x88 (Size: 0x4)
};

// Size: 0x4 (4 bytes)
class RGE_Armor_Weapon_Info {
public:
    short type; // +0x0 (Size: 0x2)
    short value; // +0x2 (Size: 0x2)
};

// Size: 0xA24 (2596 bytes)
class RGE_Base_Game {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Game_Info* player_game_info; // +0x4 (Size: 0x4)
    RGE_Scenario_File_Info* scenario_info; // +0x8 (Size: 0x4)
    RGE_Prog_Info* prog_info; // +0xC (Size: 0x4)
    void* prog_window; // +0x10 (Size: 0x4)
    int prog_ready; // +0x14 (Size: 0x4)
    int prog_active; // +0x18 (Size: 0x4)
    void* prog_palette; // +0x1C (Size: 0x4)
    void* prog_mutex; // +0x20 (Size: 0x4)
    long window_style; // +0x24 (Size: 0x4)
    int random_game_seed; // +0x28 (Size: 0x4)
    int random_map_seed; // +0x2C (Size: 0x4)
    int save_random_game_seed; // +0x30 (Size: 0x4)
    int save_random_map_seed; // +0x34 (Size: 0x4)
    int screen_saver_enabled; // +0x38 (Size: 0x4)
    int low_power_enabled; // +0x3C (Size: 0x4)
    int error_code; // +0x40 (Size: 0x4)
    int is_timer; // +0x44 (Size: 0x4)
    TDrawSystem* draw_system; // +0x48 (Size: 0x4)
    TDrawArea* draw_area; // +0x4C (Size: 0x4)
    unsigned char outline_type; // +0x50 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0051 (Gap: 3)
    int custom_mouse; // +0x54 (Size: 0x4)
    short shape_num; // +0x58 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x005a (Gap: 2)
    TShape** shapes; // +0x5C (Size: 0x4)
    TSound_Driver* sound_system; // +0x60 (Size: 0x4)
    TMusic_System* music_system; // +0x64 (Size: 0x4)
    short sound_num; // +0x68 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x006a (Gap: 2)
    TDigital** sounds; // +0x6C (Size: 0x4)
    unsigned char save_music_type; // +0x70 (Size: 0x1)
    unsigned char _pad_3[0x3]; // 0x0071 (Gap: 3)
    int save_music_track_from; // +0x74 (Size: 0x4)
    int save_music_track_to; // +0x78 (Size: 0x4)
    int save_music_cur_track; // +0x7C (Size: 0x4)
    char save_music_file[260]; // +0x80 (Size: 0x104)
    int save_music_loop; // +0x184 (Size: 0x4)
    unsigned long save_music_pos; // +0x188 (Size: 0x4)
    TCommunications_Handler* comm_handler; // +0x18C (Size: 0x4)
    int comm_syncstop; // +0x190 (Size: 0x4)
    int comm_droppackets; // +0x194 (Size: 0x4)
    int comm_syncmsg; // +0x198 (Size: 0x4)
    int comm_stepmode; // +0x19C (Size: 0x4)
    int comm_speed; // +0x1A0 (Size: 0x4)
    TDebuggingLog* debugLog; // +0x1A4 (Size: 0x4)
    int log_comm; // +0x1A8 (Size: 0x4)
    TRegistry* registry; // +0x1AC (Size: 0x4)
    int prog_mode; // +0x1B0 (Size: 0x4)
    int game_mode; // +0x1B4 (Size: 0x4)
    int sub_game_mode; // +0x1B8 (Size: 0x4)
    int paused; // +0x1BC (Size: 0x4)
    TMousePointer* mouse_pointer; // +0x1C0 (Size: 0x4)
    int erase_mouse; // +0x1C4 (Size: 0x4)
    int mouse_blit_sync; // +0x1C8 (Size: 0x4)
    int is_mouse_on; // +0x1CC (Size: 0x4)
    int windows_mouse; // +0x1D0 (Size: 0x4)
    void* mouse_cursor; // +0x1D4 (Size: 0x4)
    int input_enabled; // +0x1D8 (Size: 0x4)
    void* input_disabled_window; // +0x1DC (Size: 0x4)
    short font_num; // +0x1E0 (Size: 0x2)
    unsigned char _pad_4[0x2]; // 0x01e2 (Gap: 2)
    RGE_Font* fonts; // +0x1E4 (Size: 0x4)
    char work_dir[261]; // +0x1E8 (Size: 0x105)
    char string_dll_name[261]; // +0x2ED (Size: 0x105)
    unsigned char _pad_5[0x2]; // 0x03f2 (Gap: 2)
    RGE_Game_World* world; // +0x3F4 (Size: 0x4)
    int render_all; // +0x3F8 (Size: 0x4)
    short master_obj_id; // +0x3FC (Size: 0x2)
    short terrain_id; // +0x3FE (Size: 0x2)
    short elevation_height; // +0x400 (Size: 0x2)
    short brush_size; // +0x402 (Size: 0x2)
    char timing_text[256]; // +0x404 (Size: 0x100)
    unsigned long frame_count; // +0x504 (Size: 0x4)
    unsigned long world_update_count; // +0x508 (Size: 0x4)
    unsigned long view_update_count; // +0x50C (Size: 0x4)
    unsigned long last_frame_count; // +0x510 (Size: 0x4)
    unsigned long last_world_update_count; // +0x514 (Size: 0x4)
    unsigned long last_view_update_count; // +0x518 (Size: 0x4)
    unsigned long fps; // +0x51C (Size: 0x4)
    unsigned long world_update_fps; // +0x520 (Size: 0x4)
    unsigned long view_update_fps; // +0x524 (Size: 0x4)
    RGE_Timing_Info timings[30]; // +0x528 (Size: 0x3C0)
    int do_show_timings; // +0x8E8 (Size: 0x4)
    int do_show_comm; // +0x8EC (Size: 0x4)
    int do_show_ai; // +0x8F0 (Size: 0x4)
    unsigned long last_view_time; // +0x8F4 (Size: 0x4)
    RGE_Base_Game::RGE_Game_Options rge_game_options; // +0x8F8 (Size: 0xA8)
    int campaignGameValue; // +0x9A0 (Size: 0x4)
    int savedGameValue; // +0x9A4 (Size: 0x4)
    int quick_build; // +0x9A8 (Size: 0x4)
    int save_check_for_cd; // +0x9AC (Size: 0x4)
    int playerIDValue[9]; // +0x9B0 (Size: 0x24)
    int display_selected_ids; // +0x9D4 (Size: 0x4)
    long countdown_timer[9]; // +0x9D8 (Size: 0x24)
    int auto_paused; // +0x9FC (Size: 0x4)
    int save_paused; // +0xA00 (Size: 0x4)
    int non_user_pause; // +0xA04 (Size: 0x4)
    int rollover; // +0xA08 (Size: 0x4)
    float game_speed; // +0xA0C (Size: 0x4)
    int single_player_difficulty; // +0xA10 (Size: 0x4)
    unsigned char pathFindingValue; // +0xA14 (Size: 0x1)
    unsigned char resigned[9]; // +0xA15 (Size: 0x9)
    unsigned char _pad_6[0x2]; // 0x0a1e (Gap: 2)
    TDrawArea* map_save_area; // +0xA20 (Size: 0x4)
};

// Size: 0xA8 (168 bytes)
class RGE_Base_Game::RGE_Game_Options {
public:
    float versionValue; // +0x0 (Size: 0x4)
    unsigned char scenarioGameValue; // +0x4 (Size: 0x1)
    char scenarioNameValue[128]; // +0x5 (Size: 0x80)
    unsigned char singlePlayerGameValue; // +0x85 (Size: 0x1)
    unsigned char multiplayerGameValue; // +0x86 (Size: 0x1)
    unsigned char mapXSizeValue; // +0x87 (Size: 0x1)
    unsigned char mapYSizeValue; // +0x88 (Size: 0x1)
    unsigned char mapZSizeValue; // +0x89 (Size: 0x1)
    unsigned char allowCheatCodesValue; // +0x8A (Size: 0x1)
    unsigned char mpPathFindingValue; // +0x8B (Size: 0x1)
    unsigned char cheatNotificationValue; // +0x8C (Size: 0x1)
    unsigned char fullVisibilityValue; // +0x8D (Size: 0x1)
    unsigned char fogOfWarValue; // +0x8E (Size: 0x1)
    unsigned char coloredChatValue; // +0x8F (Size: 0x1)
    unsigned char numberPlayersValue; // +0x90 (Size: 0x1)
    unsigned char gameDeveloperModeValue; // +0x91 (Size: 0x1)
    unsigned char playerCDAndVersionValue[9]; // +0x92 (Size: 0x9)
    unsigned char difficultyValue; // +0x9B (Size: 0x1)
    unsigned char playerTeamValue[9]; // +0x9C (Size: 0x9)
    unsigned char _pad_end[0x3]; // 0x00a5 (Gap: 3)
};

// Size: 0x5A0 (1440 bytes)
class RGE_Border_Set {
public:
    unsigned char loaded; // +0x0 (Size: 0x1)
    unsigned char random; // +0x1 (Size: 0x1)
    char name[13]; // +0x2 (Size: 0xD)
    char pict_name[13]; // +0xF (Size: 0xD)
    long resource_id; // +0x1C (Size: 0x4)
    TShape* shape; // +0x20 (Size: 0x4)
    RGE_Sound* sound; // +0x24 (Size: 0x4)
    unsigned char map_hi_color; // +0x28 (Size: 0x1)
    unsigned char map_med_color; // +0x29 (Size: 0x1)
    unsigned char map_low_color; // +0x2A (Size: 0x1)
    unsigned char is_animated; // +0x2B (Size: 0x1)
    short animation_frames; // +0x2C (Size: 0x2)
    short pause_frames; // +0x2E (Size: 0x2)
    float interval; // +0x30 (Size: 0x4)
    float pause_between_loops; // +0x34 (Size: 0x4)
    short frame; // +0x38 (Size: 0x2)
    short draw_frame; // +0x3A (Size: 0x2)
    float animate_last; // +0x3C (Size: 0x4)
    unsigned char frame_changed; // +0x40 (Size: 0x1)
    unsigned char drawn; // +0x41 (Size: 0x1)
    RGE_TOB_Picts borders[19][12]; // +0x42 (Size: 0x558)
    unsigned char draw_tile; // +0x59A (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x059b (Gap: 1)
    short underlay_terrain; // +0x59C (Size: 0x2)
    short border_style; // +0x59E (Size: 0x2)
};

// Size: 0x20C (524 bytes)
class RGE_Campaign {
public:
    RGE_Campaign_Header campaign_header; // +0x0 (Size: 0x108)
    RGE_Scenario_Offset* scenario_offsets; // +0x108 (Size: 0x4)
    char filename[255]; // +0x10C (Size: 0xFF)
    unsigned char _pad_end[0x1]; // 0x020b (Gap: 1)
};

// Size: 0x108 (264 bytes)
class RGE_Campaign_Header {
public:
    long version; // +0x0 (Size: 0x4)
    char name[255]; // +0x4 (Size: 0xFF)
    unsigned char _pad_0[0x1]; // 0x0103 (Gap: 1)
    long scenario_num; // +0x104 (Size: 0x4)
};

// Size: 0x114 (276 bytes)
class RGE_Campaign_Info {
public:
    char campaign_name[255]; // +0x0 (Size: 0xFF)
    unsigned char _pad_0[0x1]; // 0x00ff (Gap: 1)
    long current_scenario; // +0x100 (Size: 0x4)
    long scenario_num; // +0x104 (Size: 0x4)
    RGE_Scenario_Info* scenario_info; // +0x108 (Size: 0x4)
    long last_scenario; // +0x10C (Size: 0x4)
    RGE_Campaign* campaign; // +0x110 (Size: 0x4)
};

// Size: 0x4 (4 bytes)
class RGE_Check_List {
public:
    RGE_Check_Node* list; // +0x0 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class RGE_Check_Node {
public:
    RGE_Static_Object* node; // +0x0 (Size: 0x4)
    float dx; // +0x4 (Size: 0x4)
    float dy; // +0x8 (Size: 0x4)
    unsigned char flag; // +0xC (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x000d (Gap: 3)
    RGE_Check_Node* next; // +0x10 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Cliffs_Hot_Spots {
public:
    long x; // +0x0 (Size: 0x4)
    long y; // +0x4 (Size: 0x4)
    long radius; // +0x8 (Size: 0x4)
};

// Size: 0x4C0 (1216 bytes)
class RGE_Cliffs_Info {
public:
    long number_of_cliffs; // +0x0 (Size: 0x4)
    long number_of_cliffs_variance; // +0x4 (Size: 0x4)
    long average_cliff_size; // +0x8 (Size: 0x4)
    long cliff_size_variance; // +0xC (Size: 0x4)
    long cliff_terrain_spacing; // +0x10 (Size: 0x4)
    long cliff_to_cliff_spacing; // +0x14 (Size: 0x4)
    RGE_Cliffs_Hot_Spots hot_spots[99]; // +0x18 (Size: 0x4A4)
    long hot_spot_num; // +0x4BC (Size: 0x4)
};

// Size: 0x128 (296 bytes)
class RGE_Color_Table {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    char color_table_name[30]; // +0x4 (Size: 0x1E)
    short resource_id; // +0x22 (Size: 0x2)
    unsigned char type; // +0x24 (Size: 0x1)
    unsigned char map_color; // +0x25 (Size: 0x1)
    short id; // +0x26 (Size: 0x2)
    unsigned char table[256]; // +0x28 (Size: 0x100)
};

// Size: 0x1C4 (452 bytes)
class RGE_Combat_Object : public RGE_Action_Object {
public:
    VISIBLE_UNIT_REC* VUR_Ptrs[9]; // +0x194 (Size: 0x24)
    unsigned long Unified_Map_Value; // +0x1B8 (Size: 0x4)
    float attack_timer; // +0x1BC (Size: 0x4)
    unsigned char capture_flag; // +0x1C0 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x01c1 (Gap: 3)
};

// Size: 0x8 (8 bytes)
class RGE_Comm_Error {
public:
    void* HostHWND; // +0x0 (Size: 0x4)
    long LastReportedError; // +0x4 (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class RGE_Command {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Game_World* world; // +0x4 (Size: 0x4)
    unsigned char* last_order; // +0x8 (Size: 0x4)
    long last_order_size; // +0xC (Size: 0x4)
    long last_order_time; // +0x10 (Size: 0x4)
    TCommunications_Handler* com_hand; // +0x14 (Size: 0x4)
};

// Size: 0x28 (40 bytes)
class RGE_Command_AI_Order {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char issuer; // +0x2 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0003 (Gap: 1)
    int recipient; // +0x4 (Size: 0x4)
    short orderType; // +0x8 (Size: 0x2)
    unsigned char orderPriority; // +0xA (Size: 0x1)
    unsigned char _pad_1[0x1]; // 0x000b (Gap: 1)
    int target; // +0xC (Size: 0x4)
    unsigned char targetOwner; // +0x10 (Size: 0x1)
    unsigned char _pad_2[0x3]; // 0x0011 (Gap: 3)
    float targetX; // +0x14 (Size: 0x4)
    float targetY; // +0x18 (Size: 0x4)
    float targetZ; // +0x1C (Size: 0x4)
    float range; // +0x20 (Size: 0x4)
    unsigned char immediate; // +0x24 (Size: 0x1)
    unsigned char inFront; // +0x25 (Size: 0x1)
    unsigned char _pad_end[0x2]; // 0x0026 (Gap: 2)
};

// Size: 0x8 (8 bytes)
class RGE_Command_Add_Attribute {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char attr_id; // +0x2 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0003 (Gap: 1)
    float attr_amount; // +0x4 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class RGE_Command_Add_To_Group {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    int groupCommander; // +0x4 (Size: 0x4)
    float groupRange; // +0x8 (Size: 0x4)
    int newUnit; // +0xC (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class RGE_Command_Add_Waypoint {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    int recipient; // +0x4 (Size: 0x4)
    unsigned char numberWaypoints; // +0x8 (Size: 0x1)
    XYZBYTEPoint waypoint[5]; // +0x9 (Size: 0xF)
};

// Size: 0x14 (20 bytes)
class RGE_Command_Create {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0001 (Gap: 1)
    short obj_catagory; // +0x2 (Size: 0x2)
    unsigned char player_id; // +0x4 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0005 (Gap: 3)
    float location_x; // +0x8 (Size: 0x4)
    float location_y; // +0xC (Size: 0x4)
    float location_z; // +0x10 (Size: 0x4)
};

// Size: 0x74 (116 bytes)
class RGE_Command_Create_Group {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    int groupCommander; // +0x4 (Size: 0x4)
    float groupRange; // +0x8 (Size: 0x4)
    int unitsToGroup[25]; // +0xC (Size: 0x64)
    unsigned char numberUnitsToGroup; // +0x70 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x0071 (Gap: 3)
};

// Size: 0x8 (8 bytes)
class RGE_Command_Destroy_Group {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    int groupCommander; // +0x4 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Command_Formation {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    int unitNum; // +0x4 (Size: 0x4)
    int formationID; // +0x8 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class RGE_Command_Give_Attribute {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char to_player_id; // +0x2 (Size: 0x1)
    unsigned char attr_id; // +0x3 (Size: 0x1)
    float attr_amount; // +0x4 (Size: 0x4)
};

// Size: 0x24 (36 bytes)
class RGE_Command_Group_AI_Order {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char issuer; // +0x2 (Size: 0x1)
    unsigned char recipient_count; // +0x3 (Size: 0x1)
    short orderType; // +0x4 (Size: 0x2)
    unsigned char orderPriority; // +0x6 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0007 (Gap: 1)
    int target; // +0x8 (Size: 0x4)
    unsigned char targetOwner; // +0xC (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x000d (Gap: 3)
    float targetX; // +0x10 (Size: 0x4)
    float targetY; // +0x14 (Size: 0x4)
    float targetZ; // +0x18 (Size: 0x4)
    float range; // +0x1C (Size: 0x4)
    unsigned char immediate; // +0x20 (Size: 0x1)
    unsigned char inFront; // +0x21 (Size: 0x1)
    unsigned char _pad_end[0x2]; // 0x0022 (Gap: 2)
};

// Size: 0x4 (4 bytes)
class RGE_Command_Group_Waypoint {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char unit_num; // +0x1 (Size: 0x1)
    unsigned char x; // +0x2 (Size: 0x1)
    unsigned char y; // +0x3 (Size: 0x1)
};

// Size: 0x14 (20 bytes)
class RGE_Command_Order {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    RGE_Obj_Info target; // +0x4 (Size: 0x4)
    unsigned char unit_num; // +0x8 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0009 (Gap: 3)
    float location_x; // +0xC (Size: 0x4)
    float location_y; // +0x10 (Size: 0x4)
};

// Size: 0x2 (2 bytes)
class RGE_Command_Pause {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char unit_num; // +0x1 (Size: 0x1)
};

// Size: 0xC (12 bytes)
class RGE_Command_Remove_From_Group {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    int groupCommander; // +0x4 (Size: 0x4)
    int unit; // +0x8 (Size: 0x4)
};

// Size: 0x4 (4 bytes)
class RGE_Command_Resign {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char comm_player_id; // +0x2 (Size: 0x1)
    unsigned char dropped; // +0x3 (Size: 0x1)
};

// Size: 0x2 (2 bytes)
class RGE_Command_Stop {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char unit_num; // +0x1 (Size: 0x1)
};

// Size: 0x224 (548 bytes)
class RGE_Communications_Addresses {
public:
    TCommunications_Handler* comm; // +0x0 (Size: 0x4)
    WSAData wsaData; // +0x4 (Size: 0x190)
    char hostname[128]; // +0x194 (Size: 0x80)
    int Status; // +0x214 (Size: 0x4)
    unsigned int AddressesAvailable; // +0x218 (Size: 0x4)
    unsigned int AliasesAvailable; // +0x21C (Size: 0x4)
    IPAD* pIPAD; // +0x220 (Size: 0x4)
};

// Size: 0x118 (280 bytes)
class RGE_Communications_Queue {
public:
    unsigned int QueueDepth; // +0x0 (Size: 0x4)
    unsigned int HighQueueDepth; // +0x4 (Size: 0x4)
    unsigned int MaxQSize; // +0x8 (Size: 0x4)
    char TBuff[255]; // +0xC (Size: 0xFF)
    unsigned char _pad_0[0x1]; // 0x010b (Gap: 1)
    unsigned long LastCurrentTurn; // +0x10C (Size: 0x4)
    unsigned char Sequence; // +0x110 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0111 (Gap: 3)
    MsgQueue* Queue; // +0x114 (Size: 0x4)
};

// Size: 0x240 (576 bytes)
class RGE_Communications_Speed {
public:
    char TBuff[255]; // +0x0 (Size: 0xFF)
    unsigned char _pad_0[0x1]; // 0x00ff (Gap: 1)
    RGE_TimeSinceLastCall* TurnTSLC; // +0x100 (Size: 0x4)
    RGE_TimeSinceLastCall* FrameTSLC; // +0x104 (Size: 0x4)
    TCommunications_Handler* Comm; // +0x108 (Size: 0x4)
    unsigned char _pad_1[0x4]; // 0x010c (Gap: 4)
    double AccumDiff; // +0x110 (Size: 0x8)
    int SpeedControlEnabled; // +0x118 (Size: 0x4)
    unsigned int CurrentBufferFrames; // +0x11C (Size: 0x4)
    unsigned int FutureBufferFrames; // +0x120 (Size: 0x4)
    unsigned int TotalBufferFramesRemaining; // +0x124 (Size: 0x4)
    unsigned int TargetTurnLengthMsec; // +0x128 (Size: 0x4)
    unsigned int CurrentBufferGranularity; // +0x12C (Size: 0x4)
    unsigned int FutureBufferGranularity; // +0x130 (Size: 0x4)
    unsigned int OverheadFactor; // +0x134 (Size: 0x4)
    unsigned long TimeSinceLastBuffer; // +0x138 (Size: 0x4)
    unsigned long FutureSpeedChangeTurn; // +0x13C (Size: 0x4)
    unsigned long NextLatencyChangeTurn; // +0x140 (Size: 0x4)
    unsigned int ActualLatency[10]; // +0x144 (Size: 0x28)
    unsigned int AverageTSLC[10]; // +0x16C (Size: 0x28)
    unsigned char PlayerOptimalFrames[10]; // +0x194 (Size: 0xA)
    unsigned char PlayerOptimalGranularity[10]; // +0x19E (Size: 0xA)
    unsigned short RequestFasterOrSlower[10]; // +0x1A8 (Size: 0x14)
    unsigned long PlayerAvgFramesMsec[10]; // +0x1BC (Size: 0x28)
    unsigned long PlayerHighLatencyMsec[10]; // +0x1E4 (Size: 0x28)
    unsigned long HighestLatencyMsec; // +0x20C (Size: 0x4)
    unsigned int SkipFrames; // +0x210 (Size: 0x4)
    unsigned int OptimalBufferFrames; // +0x214 (Size: 0x4)
    unsigned int OptimalBufferGranularity; // +0x218 (Size: 0x4)
    unsigned int DiffOffset; // +0x21C (Size: 0x4)
    unsigned int AllAcknowledgedBuffersRemaining; // +0x220 (Size: 0x4)
    unsigned int LastAdjusted; // +0x224 (Size: 0x4)
    unsigned long RealTimePassed; // +0x228 (Size: 0x4)
    unsigned long BufferTimePassed; // +0x22C (Size: 0x4)
    unsigned int DroppedFrames; // +0x230 (Size: 0x4)
    unsigned int DroppedFramesTurn; // +0x234 (Size: 0x4)
    unsigned long AdjustmentCount; // +0x238 (Size: 0x4)
    int LastFrameHadTime; // +0x23C (Size: 0x4)
};

// Size: 0x7EC (2028 bytes)
class RGE_Communications_Synchronize {
public:
    TCommunications_Handler* Comm; // +0x0 (Size: 0x4)
    unsigned long CheckTime; // +0x4 (Size: 0x4)
    unsigned long CheckTurn; // +0x8 (Size: 0x4)
    int StopOnSyncFail; // +0xC (Size: 0x4)
    int DialogOnSyncFail; // +0x10 (Size: 0x4)
    int SendChatMsgs; // +0x14 (Size: 0x4)
    int NewData; // +0x18 (Size: 0x4)
    int LastResult; // +0x1C (Size: 0x4)
    unsigned int Offset; // +0x20 (Size: 0x4)
    int DoChecksums; // +0x24 (Size: 0x4)
    unsigned long LastWorldRandom; // +0x28 (Size: 0x4)
    unsigned long GameWorldChecksum; // +0x2C (Size: 0x4)
    RGE_Communications_Synchronize::CHECKSUMARRAY Check[55]; // +0x30 (Size: 0x7BC)
};

// Size: 0x24 (36 bytes)
class RGE_Communications_Synchronize::CHECKSUMARRAY {
public:
    unsigned int PlayerNo; // +0x0 (Size: 0x4)
    unsigned long WTime; // +0x4 (Size: 0x4)
    unsigned long WTurn; // +0x8 (Size: 0x4)
    long cs1; // +0xC (Size: 0x4)
    long cs2; // +0x10 (Size: 0x4)
    long cs3; // +0x14 (Size: 0x4)
    long cs4; // +0x18 (Size: 0x4)
    long cs5; // +0x1C (Size: 0x4)
    unsigned int Random; // +0x20 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class RGE_Damage_Sprite_Info {
public:
    RGE_Sprite* sprite; // +0x0 (Size: 0x4)
    unsigned char damage_percent; // +0x4 (Size: 0x1)
    unsigned char flag; // +0x5 (Size: 0x1)
    unsigned char _pad_end[0x2]; // 0x0006 (Gap: 2)
};

// Size: 0x4BC (1212 bytes)
class RGE_Dialog_List : public TListDialog {
public:
    int list_type; // +0x4AC (Size: 0x4)
    short list_size; // +0x4B0 (Size: 0x2)
    short list_line; // +0x4B2 (Size: 0x2)
    rdlg_list_info* list_info; // +0x4B4 (Size: 0x4)
    char** list_text; // +0x4B8 (Size: 0x4)
};

// Size: 0x16C (364 bytes)
class RGE_Diamond_Map : public TPanel {
public:
    RGE_Game_World* world; // +0xF4 (Size: 0x4)
    RGE_Player* player; // +0xF8 (Size: 0x4)
    RGE_Map* map; // +0xFC (Size: 0x4)
    int all_visible; // +0x100 (Size: 0x4)
    int render_all; // +0x104 (Size: 0x4)
    long mouse_last_x; // +0x108 (Size: 0x4)
    long mouse_last_y; // +0x10C (Size: 0x4)
    int repos_mouse; // +0x110 (Size: 0x4)
    tagRECT view_rect; // +0x114 (Size: 0x10)
    RGE_Player* last_player; // +0x124 (Size: 0x4)
    RGE_Map_Image_Line* map_image_lines; // +0x128 (Size: 0x4)
    RGE_Map_Tile_Row* map_tile_rows; // +0x12C (Size: 0x4)
    short map_wid; // +0x130 (Size: 0x2)
    short map_hgt; // +0x132 (Size: 0x2)
    short map_image_start_y; // +0x134 (Size: 0x2)
    short map_image_wid; // +0x136 (Size: 0x2)
    short map_image_hgt; // +0x138 (Size: 0x2)
    short map_tile_row_cnt; // +0x13A (Size: 0x2)
    float map_row_step; // +0x13C (Size: 0x4)
    float map_col_ratio; // +0x140 (Size: 0x4)
    float map_row_ratio; // +0x144 (Size: 0x4)
    short map_tile_draw_hgt; // +0x148 (Size: 0x2)
    short map_tile_draw_wid; // +0x14A (Size: 0x2)
    short view_col; // +0x14C (Size: 0x2)
    short view_row; // +0x14E (Size: 0x2)
    RGE_View* main_view; // +0x150 (Size: 0x4)
    int scrolling; // +0x154 (Size: 0x4)
    unsigned char fog_color; // +0x158 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0159 (Gap: 3)
    int draw_objects_mode; // +0x15C (Size: 0x4)
    unsigned long cur_player_bit; // +0x160 (Size: 0x4)
    int own_save_area; // +0x164 (Size: 0x4)
    TDrawArea* save_area; // +0x168 (Size: 0x4)
};

// Size: 0x16C (364 bytes)
class RGE_Diamond_Map_View : public RGE_Diamond_Map {
public:
};

// Size: 0x1C (28 bytes)
class RGE_Doppleganger_Creator {
public:
    RGE_Player* owner; // +0x0 (Size: 0x4)
    int allocated_size; // +0x4 (Size: 0x4)
    int active_size; // +0x8 (Size: 0x4)
    RGE_Static_Object** Objects; // +0xC (Size: 0x4)
    unsigned long** Map_Addresses; // +0x10 (Size: 0x4)
    unsigned long* Last_Map_Value; // +0x14 (Size: 0x4)
    int* Object_ids; // +0x18 (Size: 0x4)
};

// Size: 0xB0 (176 bytes)
class RGE_Doppleganger_Object : public RGE_Animated_Object {
public:
    RGE_Static_Object* doppled_object; // +0x8C (Size: 0x4)
    RGE_Color_Table* draw_color; // +0x90 (Size: 0x4)
    RGE_Master_Static_Object* doppled_master_obj; // +0x94 (Size: 0x4)
    int doppled_player; // +0x98 (Size: 0x4)
    unsigned long* MapAddress; // +0x9C (Size: 0x4)
    unsigned long LastMapValue; // +0xA0 (Size: 0x4)
    unsigned long CantSeeBits; // +0xA4 (Size: 0x4)
    unsigned char map_draw_level; // +0xA8 (Size: 0x1)
    unsigned char map_color; // +0xA9 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x00aa (Gap: 2)
    int doppledObjectID; // +0xAC (Size: 0x4)
};

// Size: 0x2C (44 bytes)
class RGE_Effect {
public:
    short id; // +0x0 (Size: 0x2)
    char name[31]; // +0x2 (Size: 0x1F)
    unsigned char _pad_0[0x1]; // 0x0021 (Gap: 1)
    short string_table_id; // +0x22 (Size: 0x2)
    short effect_list_num; // +0x24 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x0026 (Gap: 2)
    RGE_Effect_Command* effect_list; // +0x28 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Effect_Command {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0001 (Gap: 1)
    short change_num1; // +0x2 (Size: 0x2)
    short change_num2; // +0x4 (Size: 0x2)
    short change_num3; // +0x6 (Size: 0x2)
    float change_amount; // +0x8 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Effects {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Effect* effects; // +0x4 (Size: 0x4)
    long effect_num; // +0x8 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class RGE_Elevation_Data {
public:
    long elevation_num; // +0x0 (Size: 0x4)
    RGE_Elevation_Data_Entry* elevation; // +0x4 (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class RGE_Elevation_Data_Entry {
public:
    long elevation_percent; // +0x0 (Size: 0x4)
    long elevation; // +0x4 (Size: 0x4)
    long clumps; // +0x8 (Size: 0x4)
    long spacing; // +0xC (Size: 0x4)
    long base_terrain_type; // +0x10 (Size: 0x4)
    long base_elevation_type; // +0x14 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class RGE_Elevation_Hot_Spots {
public:
    long x; // +0x0 (Size: 0x4)
    long y; // +0x4 (Size: 0x4)
    long radius; // +0x8 (Size: 0x4)
    long fade; // +0xC (Size: 0x4)
};

// Size: 0xF80 (3968 bytes)
class RGE_Elevation_Info {
public:
    RGE_Elevation_Info_Line elevation[99]; // +0x0 (Size: 0x948)
    long elevation_num; // +0x948 (Size: 0x4)
    RGE_Elevation_Hot_Spots hot_spots[99]; // +0x94C (Size: 0x630)
    long hot_spot_num; // +0xF7C (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class RGE_Elevation_Info_Line {
public:
    long elevation_size; // +0x0 (Size: 0x4)
    long elevation; // +0x4 (Size: 0x4)
    long clumps; // +0x8 (Size: 0x4)
    long spacing; // +0xC (Size: 0x4)
    long base_elevation; // +0x10 (Size: 0x4)
    long base_terrain_type; // +0x14 (Size: 0x4)
};

// Size: 0xBC (188 bytes)
class RGE_Flic_Player {
public:
    unsigned char* flic_buffer; // +0x0 (Size: 0x4)
    int flic_handle; // +0x4 (Size: 0x4)
    FlicHead flichead; // +0x8 (Size: 0x84)
    TDrawArea* drawarea; // +0x8C (Size: 0x4)
    long drawarea_width; // +0x90 (Size: 0x4)
    long flic_width; // +0x94 (Size: 0x4)
    unsigned char* window_buffer; // +0x98 (Size: 0x4)
    unsigned char* save_buffer; // +0x9C (Size: 0x4)
    char* chunk; // +0xA0 (Size: 0x4)
    long x1; // +0xA4 (Size: 0x4)
    long y1; // +0xA8 (Size: 0x4)
    long x2; // +0xAC (Size: 0x4)
    long y2; // +0xB0 (Size: 0x4)
    long flic_size_x; // +0xB4 (Size: 0x4)
    long flic_size_y; // +0xB8 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Font {
public:
    void* font; // +0x0 (Size: 0x4)
    long font_wid; // +0x4 (Size: 0x4)
    long font_hgt; // +0x8 (Size: 0x4)
};

// Size: 0x118 (280 bytes)
class RGE_Game_Info {
public:
    long current_person; // +0x0 (Size: 0x4)
    long people_num; // +0x4 (Size: 0x4)
    RGE_Person_Info** people_info; // +0x8 (Size: 0x4)
    long campaign_num; // +0xC (Size: 0x4)
    RGE_Campaign** campaigns; // +0x10 (Size: 0x4)
    char save_filename[260]; // +0x14 (Size: 0x104)
};

// Size: 0x104 (260 bytes)
class RGE_Game_World {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    unsigned long world_time; // +0x4 (Size: 0x4)
    unsigned long old_world_time; // +0x8 (Size: 0x4)
    unsigned long world_time_delta; // +0xC (Size: 0x4)
    float timer; // +0x10 (Size: 0x4)
    unsigned long old_time; // +0x14 (Size: 0x4)
    float game_speed; // +0x18 (Size: 0x4)
    unsigned char temp_pause; // +0x1C (Size: 0x1)
    unsigned char game_state; // +0x1D (Size: 0x1)
    unsigned char game_end_condition; // +0x1E (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x001f (Gap: 1)
    long sound_update_index; // +0x20 (Size: 0x4)
    long sprite_update_index; // +0x24 (Size: 0x4)
    RGE_Map* map; // +0x28 (Size: 0x4)
    short sound_num; // +0x2C (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x002e (Gap: 2)
    RGE_Sound** sounds; // +0x30 (Size: 0x4)
    short sprite_num; // +0x34 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x0036 (Gap: 2)
    RGE_Sprite** sprites; // +0x38 (Size: 0x4)
    short player_num; // +0x3C (Size: 0x2)
    unsigned char _pad_3[0x2]; // 0x003e (Gap: 2)
    RGE_Player** players; // +0x40 (Size: 0x4)
    short master_player_num; // +0x44 (Size: 0x2)
    unsigned char _pad_4[0x2]; // 0x0046 (Gap: 2)
    RGE_Master_Player** master_players; // +0x48 (Size: 0x4)
    RGE_Effects* effects; // +0x4C (Size: 0x4)
    short terrain_num; // +0x50 (Size: 0x2)
    short terrain_size; // +0x52 (Size: 0x2)
    float** terrains; // +0x54 (Size: 0x4)
    RGE_Command* commands; // +0x58 (Size: 0x4)
    RGE_Scenario* scenario; // +0x5C (Size: 0x4)
    short color_table_num; // +0x60 (Size: 0x2)
    unsigned char _pad_5[0x2]; // 0x0062 (Gap: 2)
    RGE_Color_Table** color_tables; // +0x64 (Size: 0x4)
    long next_object_id; // +0x68 (Size: 0x4)
    long next_reusable_object_id; // +0x6C (Size: 0x4)
    long scenario_object_id; // +0x70 (Size: 0x4)
    unsigned char scenario_object_flag; // +0x74 (Size: 0x1)
    unsigned char _pad_6[0x3]; // 0x0075 (Gap: 3)
    unsigned int random_seed; // +0x78 (Size: 0x4)
    short curr_player; // +0x7C (Size: 0x2)
    unsigned char _pad_7[0x2]; // 0x007e (Gap: 2)
    TSound_Driver* sound_driver; // +0x80 (Size: 0x4)
    float world_time_delta_seconds; // +0x84 (Size: 0x4)
    RGE_Static_Object** objectsValue; // +0x88 (Size: 0x4)
    int numberObjectsValue; // +0x8C (Size: 0x4)
    int maxNumberObjectsValue; // +0x90 (Size: 0x4)
    RGE_Static_Object** negativeObjectsValue; // +0x94 (Size: 0x4)
    int numberNegativeObjectsValue; // +0x98 (Size: 0x4)
    int maxNumberNegativeObjectsValue; // +0x9C (Size: 0x4)
    AIPlayBook* playbook; // +0xA0 (Size: 0x4)
    long campaign; // +0xA4 (Size: 0x4)
    long campaign_player; // +0xA8 (Size: 0x4)
    long campaign_scenario; // +0xAC (Size: 0x4)
    int player_turn; // +0xB0 (Size: 0x4)
    unsigned long player_time_delta[9]; // +0xB4 (Size: 0x24)
    RGE_Object_List* reusable_static_objects; // +0xD8 (Size: 0x4)
    RGE_Object_List* reusable_animated_objects; // +0xDC (Size: 0x4)
    RGE_Object_List* reusable_moving_objects; // +0xE0 (Size: 0x4)
    RGE_Object_List* reusable_action_objects; // +0xE4 (Size: 0x4)
    RGE_Object_List* reusable_combat_objects; // +0xE8 (Size: 0x4)
    RGE_Object_List* reusable_missile_objects; // +0xEC (Size: 0x4)
    RGE_Object_List* reusable_doppleganger_objects; // +0xF0 (Size: 0x4)
    unsigned long maximumComputerPlayerUpdateTime; // +0xF4 (Size: 0x4)
    unsigned long availableComputerPlayerUpdateTime; // +0xF8 (Size: 0x4)
    int currentUpdateComputerPlayer; // +0xFC (Size: 0x4)
    int difficultyLevelValue; // +0x100 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class RGE_Info_Line {
public:
    float clump_num; // +0x0 (Size: 0x4)
    short percent_of_tiles_covered; // +0x4 (Size: 0x2)
    short percent_updown; // +0x6 (Size: 0x2)
    short min_elevation; // +0x8 (Size: 0x2)
    short max_elevation; // +0xA (Size: 0x2)
    short terrain_type; // +0xC (Size: 0x2)
    short terrain_base; // +0xE (Size: 0x2)
    char obj_id; // +0x10 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x0011 (Gap: 3)
};

// Size: 0x2C (44 bytes)
class RGE_Land_Data {
public:
    long map_edge_buffer[4]; // +0x0 (Size: 0x10)
    long map_edge_fade; // +0x10 (Size: 0x4)
    long land_placement_edge; // +0x14 (Size: 0x4)
    long base_terrain; // +0x18 (Size: 0x4)
    long grown_land_percent; // +0x1C (Size: 0x4)
    long id; // +0x20 (Size: 0x4)
    long land_num; // +0x24 (Size: 0x4)
    RGE_Land_Data_Entry* land; // +0x28 (Size: 0x4)
};

// Size: 0x2C (44 bytes)
class RGE_Land_Data_Entry {
public:
    long land_id; // +0x0 (Size: 0x4)
    unsigned char terrain_type; // +0x4 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0005 (Gap: 3)
    long land_avoidance_tiles; // +0x8 (Size: 0x4)
    long base_square_radius; // +0xC (Size: 0x4)
    unsigned char zone; // +0x10 (Size: 0x1)
    unsigned char placement_type; // +0x11 (Size: 0x1)
    unsigned char _pad_1[0x2]; // 0x0012 (Gap: 2)
    long x; // +0x14 (Size: 0x4)
    long y; // +0x18 (Size: 0x4)
    unsigned char amount_of_land_used_percent; // +0x1C (Size: 0x1)
    unsigned char by_player_flag; // +0x1D (Size: 0x1)
    unsigned char _pad_2[0x2]; // 0x001e (Gap: 2)
    long radius; // +0x20 (Size: 0x4)
    long fade; // +0x24 (Size: 0x4)
    long clumpiness_factor; // +0x28 (Size: 0x4)
};

// Size: 0x1438 (5176 bytes)
class RGE_Land_Info {
public:
    RGE_Land_Info_Line land[99]; // +0x0 (Size: 0x141C)
    long land_num; // +0x141C (Size: 0x4)
    unsigned char base_terrain; // +0x1420 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x1421 (Gap: 3)
    long wall_1_avoidance_line; // +0x1424 (Size: 0x4)
    long wall_2_avoidance_line; // +0x1428 (Size: 0x4)
    long wall_3_avoidance_line; // +0x142C (Size: 0x4)
    long wall_4_avoidance_line; // +0x1430 (Size: 0x4)
    unsigned char wall_fade; // +0x1434 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x1435 (Gap: 3)
};

// Size: 0x34 (52 bytes)
class RGE_Land_Info_Line {
public:
    long land_size; // +0x0 (Size: 0x4)
    long terrain_type; // +0x4 (Size: 0x4)
    long x; // +0x8 (Size: 0x4)
    long y; // +0xC (Size: 0x4)
    long base_size; // +0x10 (Size: 0x4)
    long area; // +0x14 (Size: 0x4)
    unsigned char zone; // +0x18 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0019 (Gap: 3)
    long clumpiness_factor; // +0x1C (Size: 0x4)
    long wall_1_avoidance_line; // +0x20 (Size: 0x4)
    long wall_2_avoidance_line; // +0x24 (Size: 0x4)
    long wall_3_avoidance_line; // +0x28 (Size: 0x4)
    long wall_4_avoidance_line; // +0x2C (Size: 0x4)
    unsigned char wall_fade; // +0x30 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x0031 (Gap: 3)
};

// Size: 0x10 (16 bytes)
class RGE_Land_Point_Info_Line {
public:
    long x; // +0x0 (Size: 0x4)
    long y; // +0x4 (Size: 0x4)
    long id; // +0x8 (Size: 0x4)
    long player_id; // +0xC (Size: 0x4)
};

// Size: 0x1C (28 bytes)
class RGE_Lobby {
public:
    void* HostHWND; // +0x0 (Size: 0x4)
    IDirectPlayLobby* glpDPL; // +0x4 (Size: 0x4)
    IDirectPlayLobby2* glpDPL2; // +0x8 (Size: 0x4)
    IDirectPlay2* glpDP; // +0xC (Size: 0x4)
    DPLCONNECTION* glpdplConnection; // +0x10 (Size: 0x4)
    unsigned char lobby_game; // +0x14 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0015 (Gap: 3)
    RGE_Comm_Error* Err; // +0x18 (Size: 0x4)
};

// Size: 0x380 (896 bytes)
class RGE_Main_View : public RGE_View {
public:
    TPanel* map_view; // +0x360 (Size: 0x4)
    unsigned long last_mouse_scroll_time; // +0x364 (Size: 0x4)
    int mouse_scrolling; // +0x368 (Size: 0x4)
    long mouse_last_x; // +0x36C (Size: 0x4)
    long mouse_last_y; // +0x370 (Size: 0x4)
    unsigned long last_key_scroll_time; // +0x374 (Size: 0x4)
    int key_scrolling; // +0x378 (Size: 0x4)
    RGE_Player* save_player; // +0x37C (Size: 0x4)
};

// Size: 0x8DD0 (36304 bytes)
class RGE_Map {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Tile* map; // +0x4 (Size: 0x4)
    long map_width; // +0x8 (Size: 0x4)
    long map_height; // +0xC (Size: 0x4)
    long world_width; // +0x10 (Size: 0x4)
    long world_height; // +0x14 (Size: 0x4)
    RGE_Tile_Size tilesizes[19]; // +0x18 (Size: 0x72)
    unsigned char _pad_0[0x2]; // 0x008a (Gap: 2)
    RGE_Tile_Set terrain_types[32]; // +0x8C (Size: 0x3300)
    RGE_Border_Set border_types[16]; // +0x338C (Size: 0x5A00)
    RGE_Tile** map_row_offset; // +0x8D8C (Size: 0x4)
    short num_terrain; // +0x8D90 (Size: 0x2)
    short num_borders; // +0x8D92 (Size: 0x2)
    short max_terrain; // +0x8D94 (Size: 0x2)
    short tile_width; // +0x8D96 (Size: 0x2)
    short tile_height; // +0x8D98 (Size: 0x2)
    short tile_half_height; // +0x8D9A (Size: 0x2)
    short tile_half_width; // +0x8D9C (Size: 0x2)
    short elev_height; // +0x8D9E (Size: 0x2)
    short cur_row; // +0x8DA0 (Size: 0x2)
    short cur_col; // +0x8DA2 (Size: 0x2)
    short block_beg_row; // +0x8DA4 (Size: 0x2)
    short block_end_row; // +0x8DA6 (Size: 0x2)
    short block_beg_col; // +0x8DA8 (Size: 0x2)
    short block_end_col; // +0x8DAA (Size: 0x2)
    unsigned char any_frame_change; // +0x8DAC (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x8dad (Gap: 3)
    unsigned char* search_map; // +0x8DB0 (Size: 0x4)
    unsigned char** search_map_rows; // +0x8DB4 (Size: 0x4)
    unsigned char map_visible_flag; // +0x8DB8 (Size: 0x1)
    unsigned char fog_flag; // +0x8DB9 (Size: 0x1)
    unsigned char _pad_2[0x2]; // 0x8dba (Gap: 2)
    RGE_RMM_Database_Controller* random_map; // +0x8DBC (Size: 0x4)
    RGE_Game_World* game_world; // +0x8DC0 (Size: 0x4)
    RGE_Zone_Map_List* map_zones; // +0x8DC4 (Size: 0x4)
    RGE_Unified_Visible_Map* unified_vis_map; // +0x8DC8 (Size: 0x4)
    Visible_Unit_Manager* unit_manager; // +0x8DCC (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class RGE_Map_Data {
public:
    long map_num; // +0x0 (Size: 0x4)
    RGE_Map_Data_Entry* maps; // +0x4 (Size: 0x4)
};

// Size: 0x48 (72 bytes)
class RGE_Map_Data_Entry {
public:
    long map_id; // +0x0 (Size: 0x4)
    RGE_Land_Data land_info; // +0x4 (Size: 0x2C)
    RGE_Terrain_Data terrain_info; // +0x30 (Size: 0x8)
    RGE_Object_Data object_info; // +0x38 (Size: 0x8)
    RGE_Elevation_Data elevation_info; // +0x40 (Size: 0x8)
};

// Size: 0x520 (1312 bytes)
class RGE_Map_Gen_Info {
public:
    short base_terrain; // +0x0 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    RGE_Info_Line land; // +0x4 (Size: 0x14)
    RGE_Info_Line elevation[20]; // +0x18 (Size: 0x190)
    short elevation_num; // +0x1A8 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x01aa (Gap: 2)
    RGE_Info_Line terrain[20]; // +0x1AC (Size: 0x190)
    short terrain_num; // +0x33C (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x033e (Gap: 2)
    RGE_Info_Line objects[20]; // +0x340 (Size: 0x190)
    short objects_num; // +0x4D0 (Size: 0x2)
    short player_num; // +0x4D2 (Size: 0x2)
    short player_x[9]; // +0x4D4 (Size: 0x12)
    short player_y[9]; // +0x4E6 (Size: 0x12)
    short player_connect[9]; // +0x4F8 (Size: 0x12)
    short player_base_land[9]; // +0x50A (Size: 0x12)
    short space_between_islands_or_edge; // +0x51C (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x051e (Gap: 2)
};

// Size: 0x6 (6 bytes)
class RGE_Map_Image_Line {
public:
    short tile_row; // +0x0 (Size: 0x2)
    short start_x; // +0x2 (Size: 0x2)
    short line_len; // +0x4 (Size: 0x2)
};

// Size: 0x24 (36 bytes)
class RGE_Map_Tile_Row {
public:
    short image_line; // +0x0 (Size: 0x2)
    unsigned char draw; // +0x2 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0003 (Gap: 1)
    short row_len; // +0x4 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x0006 (Gap: 2)
    float col_step; // +0x8 (Size: 0x4)
    float col_extra; // +0xC (Size: 0x4)
    short map_col; // +0x10 (Size: 0x2)
    short map_row; // +0x12 (Size: 0x2)
    short draw_wid; // +0x14 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x0016 (Gap: 2)
    float draw_step; // +0x18 (Size: 0x4)
    short num_tiles; // +0x1C (Size: 0x2)
    unsigned char _pad_3[0x2]; // 0x001e (Gap: 2)
    float ratio; // +0x20 (Size: 0x4)
};

// Size: 0xFC (252 bytes)
class RGE_Master_Action_Object : public RGE_Master_Moving_Object {
public:
    RGE_Task_List* tasks; // +0xD8 (Size: 0x4)
    short default_task; // +0xDC (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x00de (Gap: 2)
    float search_radius; // +0xE0 (Size: 0x4)
    float work_rate; // +0xE4 (Size: 0x4)
    short drop_site; // +0xE8 (Size: 0x2)
    short backup_drop_site; // +0xEA (Size: 0x2)
    unsigned char task_by_group; // +0xEC (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x00ed (Gap: 3)
    RGE_Sound* command_sound; // +0xF0 (Size: 0x4)
    RGE_Sound* move_sound; // +0xF4 (Size: 0x4)
    unsigned char run_pattern; // +0xF8 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x00f9 (Gap: 3)
};

// Size: 0xBC (188 bytes)
class RGE_Master_Animated_Object : public RGE_Master_Static_Object {
public:
    float speed; // +0xB8 (Size: 0x4)
};

// Size: 0x148 (328 bytes)
class RGE_Master_Combat_Object : public RGE_Master_Action_Object {
public:
    RGE_Sprite* fight_sprite; // +0xFC (Size: 0x4)
    unsigned char base_armor; // +0x100 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0101 (Gap: 1)
    short armor_num; // +0x102 (Size: 0x2)
    RGE_Armor_Weapon_Info* armor; // +0x104 (Size: 0x4)
    short weapon_num; // +0x108 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x010a (Gap: 2)
    RGE_Armor_Weapon_Info* weapon; // +0x10C (Size: 0x4)
    short defense_terrain_bonus; // +0x110 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x0112 (Gap: 2)
    float weapon_range; // +0x114 (Size: 0x4)
    float area_effect_range; // +0x118 (Size: 0x4)
    unsigned char area_effect_level; // +0x11C (Size: 0x1)
    unsigned char _pad_3[0x3]; // 0x011d (Gap: 3)
    float speed_of_attack; // +0x120 (Size: 0x4)
    short missile_id; // +0x124 (Size: 0x2)
    short base_hit_chance; // +0x126 (Size: 0x2)
    unsigned char break_off_combat; // +0x128 (Size: 0x1)
    unsigned char _pad_4[0x1]; // 0x0129 (Gap: 1)
    short fire_missile_at_frame; // +0x12A (Size: 0x2)
    float weapon_offset_x; // +0x12C (Size: 0x4)
    float weapon_offset_y; // +0x130 (Size: 0x4)
    float weapon_offset_z; // +0x134 (Size: 0x4)
    float minimum_weapon_range; // +0x138 (Size: 0x4)
    short orig_armor; // +0x13C (Size: 0x2)
    short orig_weapon; // +0x13E (Size: 0x2)
    float orig_weapon_range; // +0x140 (Size: 0x4)
    float orig_speed_of_attack; // +0x144 (Size: 0x4)
};

// Size: 0xBC (188 bytes)
class RGE_Master_Doppleganger_Object : public RGE_Master_Animated_Object {
public:
};

// Size: 0x154 (340 bytes)
class RGE_Master_Missile_Object : public RGE_Master_Combat_Object {
public:
    unsigned char missile_type; // +0x148 (Size: 0x1)
    unsigned char targetting_type; // +0x149 (Size: 0x1)
    unsigned char missile_hit_info; // +0x14A (Size: 0x1)
    unsigned char missile_die_info; // +0x14B (Size: 0x1)
    unsigned char area_effect_specials; // +0x14C (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x014d (Gap: 3)
    float ballistics_ratio; // +0x150 (Size: 0x4)
};

// Size: 0xD8 (216 bytes)
class RGE_Master_Moving_Object : public RGE_Master_Animated_Object {
public:
    RGE_Sprite* move_sprite; // +0xBC (Size: 0x4)
    RGE_Sprite* run_sprite; // +0xC0 (Size: 0x4)
    float turn_speed; // +0xC4 (Size: 0x4)
    unsigned char size_class; // +0xC8 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x00c9 (Gap: 1)
    short obj_trail_id; // +0xCA (Size: 0x2)
    unsigned char obj_trail_options; // +0xCC (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x00cd (Gap: 3)
    float obj_trail_spacing; // +0xD0 (Size: 0x4)
    unsigned char move_algorithem; // +0xD4 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x00d5 (Gap: 3)
};

// Size: 0x2C (44 bytes)
class RGE_Master_Player {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    char name[20]; // +0x4 (Size: 0x14)
    short master_object_num; // +0x18 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x001a (Gap: 2)
    RGE_Master_Static_Object** master_objects; // +0x1C (Size: 0x4)
    short attribute_num; // +0x20 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x0022 (Gap: 2)
    float* attributes; // +0x24 (Size: 0x4)
    unsigned char culture; // +0x28 (Size: 0x1)
    unsigned char type; // +0x29 (Size: 0x1)
    short tribe_effect; // +0x2A (Size: 0x2)
};

// Size: 0xB8 (184 bytes)
class RGE_Master_Static_Object {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    unsigned char master_type; // +0x4 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0005 (Gap: 3)
    char* name; // +0x8 (Size: 0x4)
    short string_id; // +0xC (Size: 0x2)
    short string_id2; // +0xE (Size: 0x2)
    short id; // +0x10 (Size: 0x2)
    short copy_id; // +0x12 (Size: 0x2)
    short object_group; // +0x14 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x0016 (Gap: 2)
    RGE_Sprite* sprite; // +0x18 (Size: 0x4)
    RGE_Sprite* death_sprite; // +0x1C (Size: 0x4)
    RGE_Sprite* undead_sprite; // +0x20 (Size: 0x4)
    unsigned char undead_flag; // +0x24 (Size: 0x1)
    unsigned char _pad_2[0x1]; // 0x0025 (Gap: 1)
    short hp; // +0x26 (Size: 0x2)
    float los; // +0x28 (Size: 0x4)
    unsigned char obj_max; // +0x2C (Size: 0x1)
    unsigned char _pad_3[0x3]; // 0x002d (Gap: 3)
    float radius_x; // +0x30 (Size: 0x4)
    float radius_y; // +0x34 (Size: 0x4)
    float radius_z; // +0x38 (Size: 0x4)
    RGE_Sound* selected_sound; // +0x3C (Size: 0x4)
    RGE_Sound* created_sound; // +0x40 (Size: 0x4)
    RGE_Sound* death_sound; // +0x44 (Size: 0x4)
    short death_spawn_obj_id; // +0x48 (Size: 0x2)
    unsigned char sort_number; // +0x4A (Size: 0x1)
    unsigned char can_be_built_on; // +0x4B (Size: 0x1)
    short button_pict; // +0x4C (Size: 0x2)
    unsigned char hide_in_scenario_editor; // +0x4E (Size: 0x1)
    unsigned char _pad_4[0x1]; // 0x004f (Gap: 1)
    short portrait_pict; // +0x50 (Size: 0x2)
    unsigned char available; // +0x52 (Size: 0x1)
    unsigned char _pad_5[0x1]; // 0x0053 (Gap: 1)
    short tile_req1; // +0x54 (Size: 0x2)
    short tile_req2; // +0x56 (Size: 0x2)
    short center_tile_req1; // +0x58 (Size: 0x2)
    short center_tile_req2; // +0x5A (Size: 0x2)
    float construction_radius_x; // +0x5C (Size: 0x4)
    float construction_radius_y; // +0x60 (Size: 0x4)
    unsigned char elevation_flag; // +0x64 (Size: 0x1)
    unsigned char fog_flag; // +0x65 (Size: 0x1)
    short terrain; // +0x66 (Size: 0x2)
    unsigned char movement_type; // +0x68 (Size: 0x1)
    unsigned char _pad_6[0x1]; // 0x0069 (Gap: 1)
    short attribute_type_held[3]; // +0x6A (Size: 0x6)
    float attribute_amount_held[3]; // +0x70 (Size: 0xC)
    short attribute_max_amount; // +0x7C (Size: 0x2)
    unsigned char _pad_7[0x2]; // 0x007e (Gap: 2)
    float attribute_rot; // +0x80 (Size: 0x4)
    float multiple_attribute_mod; // +0x84 (Size: 0x4)
    unsigned char attribute_flag[3]; // +0x88 (Size: 0x3)
    unsigned char area_effect_object_level; // +0x8B (Size: 0x1)
    unsigned char combat_level; // +0x8C (Size: 0x1)
    unsigned char select_level; // +0x8D (Size: 0x1)
    unsigned char map_draw_level; // +0x8E (Size: 0x1)
    unsigned char unit_level; // +0x8F (Size: 0x1)
    unsigned char map_color; // +0x90 (Size: 0x1)
    unsigned char attack_reaction; // +0x91 (Size: 0x1)
    unsigned char convert_terrain_flag; // +0x92 (Size: 0x1)
    unsigned char damage_sprite_num; // +0x93 (Size: 0x1)
    RGE_Damage_Sprite_Info* damage_sprites; // +0x94 (Size: 0x4)
    long help_string_id; // +0x98 (Size: 0x4)
    long help_page_id; // +0x9C (Size: 0x4)
    long hotkey_id; // +0xA0 (Size: 0x4)
    unsigned char recyclable; // +0xA4 (Size: 0x1)
    unsigned char track_as_resource; // +0xA5 (Size: 0x1)
    unsigned char create_doppleganger_on_death; // +0xA6 (Size: 0x1)
    unsigned char resource_group; // +0xA7 (Size: 0x1)
    unsigned char draw_flag; // +0xA8 (Size: 0x1)
    unsigned char draw_color; // +0xA9 (Size: 0x1)
    unsigned char _pad_8[0x2]; // 0x00aa (Gap: 2)
    float outline_radius_x; // +0xAC (Size: 0x4)
    float outline_radius_y; // +0xB0 (Size: 0x4)
    float outline_radius_z; // +0xB4 (Size: 0x4)
};

// Size: 0x1C8 (456 bytes)
class RGE_Missile_Object : public RGE_Combat_Object {
public:
    float max_range; // +0x1C4 (Size: 0x4)
};

// Size: 0x180 (384 bytes)
class RGE_Moving_Object : public RGE_Animated_Object {
public:
    float trail_remainder; // +0x8C (Size: 0x4)
    float velocity_x; // +0x90 (Size: 0x4)
    float velocity_y; // +0x94 (Size: 0x4)
    float velocity_z; // +0x98 (Size: 0x4)
    float angle; // +0x9C (Size: 0x4)
    float turn_towards_time; // +0xA0 (Size: 0x4)
    Path pathValue; // +0xA4 (Size: 0x34)
    Path exceptionPathValue; // +0xD8 (Size: 0x34)
    Waypoint startValue; // +0x10C (Size: 0x10)
    Waypoint goalValue; // +0x11C (Size: 0x10)
    float turnTimer; // +0x12C (Size: 0x4)
    float collisionAvoidanceDistance; // +0x130 (Size: 0x4)
    float actionRange; // +0x134 (Size: 0x4)
    int targetIDValue; // +0x138 (Size: 0x4)
    float targetRadiusX; // +0x13C (Size: 0x4)
    float targetRadiusY; // +0x140 (Size: 0x4)
    int continueCounter; // +0x144 (Size: 0x4)
    int rangeStatusValue; // +0x148 (Size: 0x4)
    int currentTerrainException1; // +0x14C (Size: 0x4)
    int currentTerrainException2; // +0x150 (Size: 0x4)
    unsigned char storePathInExceptionPath; // +0x154 (Size: 0x1)
    unsigned char waitingToMoveValue; // +0x155 (Size: 0x1)
    unsigned char numberWaitDelays; // +0x156 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0157 (Gap: 1)
    XYPoint minInitialPointValue; // +0x158 (Size: 0x8)
    XYPoint maxInitialPointValue; // +0x160 (Size: 0x8)
    XYZBYTEPoint* userDefinedWaypoints; // +0x168 (Size: 0x4)
    int numberUserDefinedWaypointsValue; // +0x16C (Size: 0x4)
    int maxUserDefinedWaypointsValue; // +0x170 (Size: 0x4)
    unsigned char finalUserDefinedWaypoint; // +0x174 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0175 (Gap: 3)
    float closestDistanceToWaypoint; // +0x178 (Size: 0x4)
    unsigned char lastFacet; // +0x17C (Size: 0x1)
    unsigned char lastFacet2; // +0x17D (Size: 0x1)
    unsigned char _pad_end[0x2]; // 0x017e (Gap: 2)
};

// Size: 0x4 (4 bytes)
class RGE_Obj_Info {
public:
    long id; // +0x0 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class RGE_Object_Data {
public:
    long object_num; // +0x0 (Size: 0x4)
    RGE_Object_Data_Entry* objects; // +0x4 (Size: 0x4)
};

// Size: 0x2C (44 bytes)
class RGE_Object_Data_Entry {
public:
    long obj_id; // +0x0 (Size: 0x4)
    long terrain; // +0x4 (Size: 0x4)
    unsigned char group_flag; // +0x8 (Size: 0x1)
    unsigned char scale_flag; // +0x9 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x000a (Gap: 2)
    long object_number_per_group; // +0xC (Size: 0x4)
    long object_number_varience; // +0x10 (Size: 0x4)
    long number_of_groups; // +0x14 (Size: 0x4)
    long group_area; // +0x18 (Size: 0x4)
    long player_id; // +0x1C (Size: 0x4)
    long land_id; // +0x20 (Size: 0x4)
    long land_inner_radius; // +0x24 (Size: 0x4)
    long land_outer_radius; // +0x28 (Size: 0x4)
};

// Size: 0x18C8 (6344 bytes)
class RGE_Object_Info {
public:
    RGE_Object_Info_Line objects[99]; // +0x0 (Size: 0x1290)
    long object_num; // +0x1290 (Size: 0x4)
    RGE_Land_Point_Info_Line lands[99]; // +0x1294 (Size: 0x630)
    long land_num; // +0x18C4 (Size: 0x4)
};

// Size: 0x30 (48 bytes)
class RGE_Object_Info_Line {
public:
    long obj_id; // +0x0 (Size: 0x4)
    long terrain; // +0x4 (Size: 0x4)
    unsigned char group_flag; // +0x8 (Size: 0x1)
    unsigned char scale_flag; // +0x9 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x000a (Gap: 2)
    long object_number_per_group; // +0xC (Size: 0x4)
    long object_number_varience; // +0x10 (Size: 0x4)
    long number_of_groups; // +0x14 (Size: 0x4)
    long group_area; // +0x18 (Size: 0x4)
    long player_id; // +0x1C (Size: 0x4)
    long land_id; // +0x20 (Size: 0x4)
    long land_inner_radius; // +0x24 (Size: 0x4)
    long land_outer_radius; // +0x28 (Size: 0x4)
    long object_exclusion_zone; // +0x2C (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Object_List {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Object_Node* list; // +0x4 (Size: 0x4)
    short number_of_objects; // +0x8 (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x000a (Gap: 2)
};

// Size: 0x10 (16 bytes)
class RGE_Object_Node {
public:
    RGE_Static_Object* node; // +0x0 (Size: 0x4)
    RGE_Object_Node* next; // +0x4 (Size: 0x4)
    RGE_Object_Node* prev; // +0x8 (Size: 0x4)
    unsigned char centered; // +0xC (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x000d (Gap: 3)
};

// Size: 0x108 (264 bytes)
class RGE_Panel_Time : public TPanel {
public:
    void* font; // +0xF4 (Size: 0x4)
    long game_time; // +0xF8 (Size: 0x4)
    long last_game_time; // +0xFC (Size: 0x4)
    long old_time; // +0x100 (Size: 0x4)
    long real_time; // +0x104 (Size: 0x4)
};

// Size: 0x120 (288 bytes)
class RGE_Panel_Tool_Box : public TPanel {
public:
    TScreenPanel* screen_panel; // +0xF4 (Size: 0x4)
    RGE_View* view; // +0xF8 (Size: 0x4)
    RGE_Diamond_Map* map; // +0xFC (Size: 0x4)
    TButtonPanel* game_mode_button; // +0x100 (Size: 0x4)
    TButtonPanel* object_mode_button; // +0x104 (Size: 0x4)
    TButtonPanel* delete_mode_button; // +0x108 (Size: 0x4)
    TButtonPanel* move_mode_button; // +0x10C (Size: 0x4)
    TButtonPanel* terrain_mode_button; // +0x110 (Size: 0x4)
    TButtonPanel* elevation_mode_button; // +0x114 (Size: 0x4)
    TButtonPanel* command_button; // +0x118 (Size: 0x4)
    TPanel* dialog; // +0x11C (Size: 0x4)
};

// Size: 0x114 (276 bytes)
class RGE_Person_Info {
public:
    char name[255]; // +0x0 (Size: 0xFF)
    unsigned char _pad_0[0x1]; // 0x00ff (Gap: 1)
    long current_campaign; // +0x100 (Size: 0x4)
    long campaign_info_num; // +0x104 (Size: 0x4)
    RGE_Campaign_Info** campaign_info; // +0x108 (Size: 0x4)
    long campaign_num; // +0x10C (Size: 0x4)
    RGE_Campaign** campaigns; // +0x110 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class RGE_Pick_Info {
public:
    float x; // +0x0 (Size: 0x4)
    float y; // +0x4 (Size: 0x4)
    short scr_x; // +0x8 (Size: 0x2)
    short scr_y; // +0xA (Size: 0x2)
    RGE_Static_Object* object; // +0xC (Size: 0x4)
    RGE_Tile* tile; // +0x10 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Pick_Obj_Info {
public:
    int object_id; // +0x0 (Size: 0x4)
    short confidence; // +0x4 (Size: 0x2)
    short draw_level; // +0x6 (Size: 0x2)
    short draw_x; // +0x8 (Size: 0x2)
    short draw_y; // +0xA (Size: 0x2)
};

// Size: 0x10 (16 bytes)
class RGE_Picture_List {
public:
    short picture_num; // +0x0 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    RGE_Sprite* sprite; // +0x4 (Size: 0x4)
    short offset_x; // +0x8 (Size: 0x2)
    short offset_y; // +0xA (Size: 0x2)
    short facet; // +0xC (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x000e (Gap: 2)
};

// Size: 0x220 (544 bytes)
class RGE_Player {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    int computerPlayerValue; // +0x4 (Size: 0x4)
    int pathingAttemptCapValue; // +0x8 (Size: 0x4)
    int pathingDelayCapValue; // +0xC (Size: 0x4)
    int currentUpdatePathingAttemptsValue; // +0x10 (Size: 0x4)
    long checksum; // +0x14 (Size: 0x4)
    long position_checksum; // +0x18 (Size: 0x4)
    long action_checksum; // +0x1C (Size: 0x4)
    unsigned char checksum_created_this_update; // +0x20 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0021 (Gap: 1)
    short master_object_num; // +0x22 (Size: 0x2)
    RGE_Master_Static_Object** master_objects; // +0x24 (Size: 0x4)
    RGE_Object_List* objects; // +0x28 (Size: 0x4)
    RGE_Object_List* sleeping_objects; // +0x2C (Size: 0x4)
    RGE_Object_List* doppleganger_objects; // +0x30 (Size: 0x4)
    RGE_Victory_Conditions* victory_conditions; // +0x34 (Size: 0x4)
    RGE_Visible_Map* visible; // +0x38 (Size: 0x4)
    RGE_Game_World* world; // +0x3C (Size: 0x4)
    RGE_Doppleganger_Creator* doppleganger_creator; // +0x40 (Size: 0x4)
    char* name; // +0x44 (Size: 0x4)
    unsigned char type; // +0x48 (Size: 0x1)
    unsigned char _pad_1[0x1]; // 0x0049 (Gap: 1)
    short id; // +0x4A (Size: 0x2)
    short attribute_num; // +0x4C (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x004e (Gap: 2)
    float* attributes; // +0x50 (Size: 0x4)
    unsigned char culture; // +0x54 (Size: 0x1)
    unsigned char _pad_3[0x3]; // 0x0055 (Gap: 3)
    RGE_Tile_List tile_list; // +0x58 (Size: 0x14)
    RGE_Tile_List diam_tile_list; // +0x6C (Size: 0x14)
    unsigned char game_status; // +0x80 (Size: 0x1)
    unsigned char resigned; // +0x81 (Size: 0x1)
    unsigned char _pad_4[0x2]; // 0x0082 (Gap: 2)
    unsigned char* relations; // +0x84 (Size: 0x4)
    int unitDiplomacy[9]; // +0x88 (Size: 0x24)
    int mutualAlly[9]; // +0xAC (Size: 0x24)
    unsigned long mutualExploredMask; // +0xD0 (Size: 0x4)
    unsigned long mutualVisibleMask; // +0xD4 (Size: 0x4)
    unsigned long nonMutualVisibleMask; // +0xD8 (Size: 0x4)
    unsigned long RemoveVisibleBits[9]; // +0xDC (Size: 0x24)
    int allied_LOS_Enable; // +0x100 (Size: 0x4)
    unsigned char allied_victory; // +0x104 (Size: 0x1)
    unsigned char master_player_id; // +0x105 (Size: 0x1)
    unsigned char _pad_5[0x2]; // 0x0106 (Gap: 2)
    RGE_Color_Table* color_table; // +0x108 (Size: 0x4)
    long tribe_effect; // +0x10C (Size: 0x4)
    Visible_Resource_Manager* VR_List; // +0x110 (Size: 0x4)
    float view_x; // +0x114 (Size: 0x4)
    float view_y; // +0x118 (Size: 0x4)
    short map_x; // +0x11C (Size: 0x2)
    short map_y; // +0x11E (Size: 0x2)
    short selected_start_col; // +0x120 (Size: 0x2)
    short selected_start_row; // +0x122 (Size: 0x2)
    short selected_end_col; // +0x124 (Size: 0x2)
    short selected_end_row; // +0x126 (Size: 0x2)
    short replacement_terrain; // +0x128 (Size: 0x2)
    short replacement_overlay; // +0x12A (Size: 0x2)
    short replacement_overlay_shape; // +0x12C (Size: 0x2)
    unsigned char _pad_6[0x2]; // 0x012e (Gap: 2)
    RGE_Static_Object* selected_obj; // +0x130 (Size: 0x4)
    RGE_Static_Object* sel_list[25]; // +0x134 (Size: 0x64)
    unsigned long sel_object_properties; // +0x198 (Size: 0x4)
    short sel_count; // +0x19C (Size: 0x2)
    unsigned char groups_used[127]; // +0x19E (Size: 0x7F)
    unsigned char _pad_end[0x3]; // 0x021d (Gap: 3)
};

// Size: 0x2AC (684 bytes)
class RGE_Player_Info {
public:
    char name[9][65]; // +0x0 (Size: 0x249)
    char type[9]; // +0x249 (Size: 0x9)
    char tribe[9]; // +0x252 (Size: 0x9)
    unsigned char _pad_0[0x1]; // 0x025b (Gap: 1)
    short color[9]; // +0x25C (Size: 0x12)
    unsigned char _pad_1[0x2]; // 0x026e (Gap: 2)
    long player_id_hash[9]; // +0x270 (Size: 0x24)
    short player_num; // +0x294 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x0296 (Gap: 2)
    char* scenario; // +0x298 (Size: 0x4)
    RGE_Map_Gen_Info* map_info; // +0x29C (Size: 0x4)
    short map_type; // +0x2A0 (Size: 0x2)
    short map_width; // +0x2A2 (Size: 0x2)
    short map_height; // +0x2A4 (Size: 0x2)
    short ai_info; // +0x2A6 (Size: 0x2)
    unsigned char campaign; // +0x2A8 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x02a9 (Gap: 3)
};

// Size: 0x1238 (4664 bytes)
class RGE_Prog_Info {
public:
    char prog_name[101]; // +0x0 (Size: 0x65)
    char prog_version[21]; // +0x65 (Size: 0x15)
    char prog_title[121]; // +0x7A (Size: 0x79)
    char world_db_file[261]; // +0xF3 (Size: 0x105)
    char game_data_file[261]; // +0x1F8 (Size: 0x105)
    char vol_name[261]; // +0x2FD (Size: 0x105)
    unsigned char _pad_0[0x2]; // 0x0402 (Gap: 2)
    unsigned long vol_ser_num; // +0x404 (Size: 0x4)
    int verify_cd; // +0x408 (Size: 0x4)
    int max_players_per_cd; // +0x40C (Size: 0x4)
    void* instance; // +0x410 (Size: 0x4)
    void* prev_instance; // +0x414 (Size: 0x4)
    char registry_key[256]; // +0x418 (Size: 0x100)
    char cmd_line[256]; // +0x518 (Size: 0x100)
    int show_wnd_flag; // +0x618 (Size: 0x4)
    char icon_name[41]; // +0x61C (Size: 0x29)
    char menu_name[41]; // +0x645 (Size: 0x29)
    char pal_file[261]; // +0x66E (Size: 0x105)
    char cursor_file[261]; // +0x773 (Size: 0x105)
    int max_players; // +0x878 (Size: 0x4)
    int check_expiration; // +0x87C (Size: 0x4)
    short expire_month; // +0x880 (Size: 0x2)
    short expire_day; // +0x882 (Size: 0x2)
    short expire_year; // +0x884 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x0886 (Gap: 2)
    unsigned long update_interval; // +0x888 (Size: 0x4)
    int check_multi_copies; // +0x88C (Size: 0x4)
    int skip_startup; // +0x890 (Size: 0x4)
    int full_screen; // +0x894 (Size: 0x4)
    int fixed_window_size; // +0x898 (Size: 0x4)
    int use_dir_draw; // +0x89C (Size: 0x4)
    int use_sys_mem; // +0x8A0 (Size: 0x4)
    int use_music; // +0x8A4 (Size: 0x4)
    int use_sound; // +0x8A8 (Size: 0x4)
    int use_cd_audio; // +0x8AC (Size: 0x4)
    int use_ima; // +0x8B0 (Size: 0x4)
    int use_midi; // +0x8B4 (Size: 0x4)
    int use_wave_music; // +0x8B8 (Size: 0x4)
    int fast_view; // +0x8BC (Size: 0x4)
    int auto_scroll; // +0x8C0 (Size: 0x4)
    long mouse_scroll_edge; // +0x8C4 (Size: 0x4)
    unsigned long mouse_scroll_interval; // +0x8C8 (Size: 0x4)
    float mouse_scroll_max_dist; // +0x8CC (Size: 0x4)
    unsigned long key_scroll_interval; // +0x8D0 (Size: 0x4)
    float key_scroll_max_dist; // +0x8D4 (Size: 0x4)
    float key_scroll_object_move; // +0x8D8 (Size: 0x4)
    short interface_style; // +0x8DC (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x08de (Gap: 2)
    long main_wid; // +0x8E0 (Size: 0x4)
    long main_hgt; // +0x8E4 (Size: 0x4)
    _GUID game_guid; // +0x8E8 (Size: 0x10)
    _GUID zone_guid; // +0x8F8 (Size: 0x10)
    char data_dir[261]; // +0x908 (Size: 0x105)
    char graphics_dir[261]; // +0xA0D (Size: 0x105)
    char save_dir[261]; // +0xB12 (Size: 0x105)
    char scenario_dir[261]; // +0xC17 (Size: 0x105)
    char campaign_dir[261]; // +0xD1C (Size: 0x105)
    char sounds_dir[261]; // +0xE21 (Size: 0x105)
    char resource_dir[261]; // +0xF26 (Size: 0x105)
    char ai_dir[261]; // +0x102B (Size: 0x105)
    char avi_dir[261]; // +0x1130 (Size: 0x105)
    unsigned char _pad_end[0x3]; // 0x1235 (Gap: 3)
};

// Size: 0x508 (1288 bytes)
class RGE_RMM_Cliffs_Generator : public RGE_Random_Map_Module {
public:
    RGE_Cliffs_Info info; // +0x30 (Size: 0x4C0)
    Map_Stack valid_cliff_sites; // +0x4F0 (Size: 0x18)
};

// Size: 0x30 (48 bytes)
class RGE_RMM_Controller : public RGE_Random_Map_Module {
public:
};

// Size: 0x4F5C (20316 bytes)
class RGE_RMM_Database_Controller : public RGE_Random_Map_Module {
public:
    RGE_Game_World* world; // +0x30 (Size: 0x4)
    long map_type; // +0x34 (Size: 0x4)
    long number_of_players; // +0x38 (Size: 0x4)
    RGE_Land_Info land_info; // +0x3C (Size: 0x1438)
    RGE_Terrain_Info terrain_info; // +0x1474 (Size: 0x1298)
    RGE_Object_Info object_info; // +0x270C (Size: 0x18C8)
    RGE_Elevation_Info elevation_info; // +0x3FD4 (Size: 0xF80)
    RGE_Map_Data map_info; // +0x4F54 (Size: 0x8)
};

// Size: 0xFB0 (4016 bytes)
class RGE_RMM_Elevation_Generator : public RGE_Random_Map_Module {
public:
    RGE_Elevation_Info info; // +0x30 (Size: 0xF80)
};

// Size: 0x1468 (5224 bytes)
class RGE_RMM_Land_Generator : public RGE_Random_Map_Module {
public:
    RGE_Land_Info info; // +0x30 (Size: 0x1438)
};

// Size: 0x1920 (6432 bytes)
class RGE_RMM_Object_Generator : public RGE_Random_Map_Module {
public:
    RGE_Game_World* world; // +0x30 (Size: 0x4)
    RGE_Object_Info info; // +0x34 (Size: 0x18C8)
    unsigned char terrain_table[32]; // +0x18FC (Size: 0x20)
    unsigned char add_terrain; // +0x191C (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x191d (Gap: 3)
};

// Size: 0x34C (844 bytes)
class RGE_RMM_Shallows_Generator : public RGE_Random_Map_Module {
public:
    RGE_Shallows_Info info; // +0x30 (Size: 0x31C)
};

// Size: 0x12CC (4812 bytes)
class RGE_RMM_Terrain_Generator : public RGE_Random_Map_Module {
public:
    RGE_Terrain_Info info; // +0x30 (Size: 0x1298)
    RGE_Zone_Map* map_zone; // +0x12C8 (Size: 0x4)
};

// Size: 0x30 (48 bytes)
class RGE_Random_Map_Module {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Random_Map_Module* parent; // +0x4 (Size: 0x4)
    RGE_Random_Map_Module_List* list; // +0x8 (Size: 0x4)
    RGE_Map* map; // +0xC (Size: 0x4)
    RGE_Tile** map_row_offset; // +0x10 (Size: 0x4)
    long map_width; // +0x14 (Size: 0x4)
    long map_height; // +0x18 (Size: 0x4)
    float schedule; // +0x1C (Size: 0x4)
    unsigned char* search_map; // +0x20 (Size: 0x4)
    unsigned char** search_map_rows; // +0x24 (Size: 0x4)
    Map_Stack* stack_array; // +0x28 (Size: 0x4)
    Map_Stack** stack_offsets; // +0x2C (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class RGE_Random_Map_Module_List {
public:
    RGE_Random_Map_Module* module; // +0x0 (Size: 0x4)
    RGE_Random_Map_Module_List* next; // +0x4 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class RGE_SPick_Info {
public:
    int object_id; // +0x0 (Size: 0x4)
    short confidence; // +0x4 (Size: 0x2)
    short draw_level; // +0x6 (Size: 0x2)
    short draw_x; // +0x8 (Size: 0x2)
    short draw_y; // +0xA (Size: 0x2)
    RGE_SPick_Info* next; // +0xC (Size: 0x4)
    RGE_SPick_Info* prev; // +0x10 (Size: 0x4)
};

// Size: 0x1990 (6544 bytes)
class RGE_Scenario {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Timeline* time_line; // +0x4 (Size: 0x4)
    RGE_Game_World* world; // +0x8 (Size: 0x4)
    unsigned char victory_conquest; // +0xC (Size: 0x1)
    PlayerName player_name[16]; // +0xD (Size: 0x1000)
    unsigned char _pad_0[0x3]; // 0x100d (Gap: 3)
    char* scenario_name; // +0x1010 (Size: 0x4)
    char* description; // +0x1014 (Size: 0x4)
    char* hints; // +0x1018 (Size: 0x4)
    char* win_message; // +0x101C (Size: 0x4)
    char* loss_message; // +0x1020 (Size: 0x4)
    char* historicle_notes; // +0x1024 (Size: 0x4)
    char TempText1[224]; // +0x1028 (Size: 0xE0)
    char TempText2[224]; // +0x1108 (Size: 0xE0)
    char TempText3[224]; // +0x11E8 (Size: 0xE0)
    char* BuildList[16]; // +0x12C8 (Size: 0x40)
    char* CityPlan[16]; // +0x1308 (Size: 0x40)
    char* AiRules[16]; // +0x1348 (Size: 0x40)
    unsigned char* BuildListFile[16]; // +0x1388 (Size: 0x40)
    unsigned char* CityPlanFile[16]; // +0x13C8 (Size: 0x40)
    unsigned char* AiRulesFile[16]; // +0x1408 (Size: 0x40)
    int BuildListFileSize[16]; // +0x1448 (Size: 0x40)
    int CityPlanFileSize[16]; // +0x1488 (Size: 0x40)
    int AiRulesFileSize[16]; // +0x14C8 (Size: 0x40)
    char Cine_PreGame[224]; // +0x1508 (Size: 0xE0)
    char Cine_Victory[224]; // +0x15E8 (Size: 0xE0)
    char Cine_Loss[224]; // +0x16C8 (Size: 0xE0)
    char Mission_Bmp[224]; // +0x17A8 (Size: 0xE0)
    float Version; // +0x1888 (Size: 0x4)
    int PlayerPosture[16]; // +0x188C (Size: 0x40)
    int PlType[16]; // +0x18CC (Size: 0x40)
    int PlCivilization[16]; // +0x190C (Size: 0x40)
    int PlActive[16]; // +0x194C (Size: 0x40)
    TPicture* mission_picture; // +0x198C (Size: 0x4)
};

// Size: 0x10C (268 bytes)
class RGE_Scenario_File_Entry {
public:
    long time; // +0x0 (Size: 0x4)
    RGE_Scenario_Header* scenario_header; // +0x4 (Size: 0x4)
    char name[260]; // +0x8 (Size: 0x104)
};

// Size: 0x10C (268 bytes)
class RGE_Scenario_File_Info {
public:
    char filename[260]; // +0x0 (Size: 0x104)
    long scenario_num; // +0x104 (Size: 0x4)
    RGE_Scenario_File_Entry* scenarios; // +0x108 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class RGE_Scenario_Header {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    int error_code; // +0x4 (Size: 0x4)
    long version; // +0x8 (Size: 0x4)
    unsigned long checksum; // +0xC (Size: 0x4)
    char* description; // +0x10 (Size: 0x4)
};

// Size: 0x1 (1 bytes)
class RGE_Scenario_Info {
public:
    unsigned char scenario_status; // +0x0 (Size: 0x1)
};

// Size: 0x208 (520 bytes)
class RGE_Scenario_Offset {
public:
    long size; // +0x0 (Size: 0x4)
    long offset; // +0x4 (Size: 0x4)
    char name[255]; // +0x8 (Size: 0xFF)
    char file_name[255]; // +0x107 (Size: 0xFF)
    unsigned char _pad_end[0x2]; // 0x0206 (Gap: 2)
};

// Size: 0x31C (796 bytes)
class RGE_Shallows_Info {
public:
    RGE_Shallows_Info_Line shallows[99]; // +0x0 (Size: 0x318)
    long shallows_num; // +0x318 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class RGE_Shallows_Info_Line {
public:
    long x; // +0x0 (Size: 0x4)
    long y; // +0x4 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class RGE_Sound {
public:
    short play_at_update_count; // +0x0 (Size: 0x2)
    short sound_num; // +0x2 (Size: 0x2)
    RGE_Sound_Info* sounds; // +0x4 (Size: 0x4)
    unsigned long cache_time; // +0x8 (Size: 0x4)
    short id; // +0xC (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x000e (Gap: 2)
};

// Size: 0x24 (36 bytes)
class RGE_Sound_Info {
public:
    char name[13]; // +0x0 (Size: 0xD)
    unsigned char _pad_0[0x3]; // 0x000d (Gap: 3)
    long resource_id; // +0x10 (Size: 0x4)
    short percent; // +0x14 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x0016 (Gap: 2)
    TDigital* digital_sound; // +0x18 (Size: 0x4)
    unsigned char loaded; // +0x1C (Size: 0x1)
    unsigned char _pad_2[0x3]; // 0x001d (Gap: 3)
    unsigned long time; // +0x20 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class RGE_Sound_List {
public:
    RGE_Sound* sound[3]; // +0x0 (Size: 0xC)
    short frame[3]; // +0xC (Size: 0x6)
    unsigned char _pad_end[0x2]; // 0x0012 (Gap: 2)
};

// Size: 0x78 (120 bytes)
class RGE_Sprite {
public:
    char pict_name[13]; // +0x0 (Size: 0xD)
    unsigned char _pad_0[0x3]; // 0x000d (Gap: 3)
    long resource_id; // +0x10 (Size: 0x4)
    unsigned char loaded; // +0x14 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0015 (Gap: 3)
    RGE_Color_Table** color_tables; // +0x18 (Size: 0x4)
    TShape* shape; // +0x1C (Size: 0x4)
    long last_time; // +0x20 (Size: 0x4)
    long delta_time; // +0x24 (Size: 0x4)
    unsigned char color_flag; // +0x28 (Size: 0x1)
    unsigned char draw_level; // +0x29 (Size: 0x1)
    short color_table; // +0x2A (Size: 0x2)
    unsigned char transparent_picking_flag; // +0x2C (Size: 0x1)
    unsigned char _pad_2[0x1]; // 0x002d (Gap: 1)
    short box_x1; // +0x2E (Size: 0x2)
    short box_y1; // +0x30 (Size: 0x2)
    short box_x2; // +0x32 (Size: 0x2)
    short box_y2; // +0x34 (Size: 0x2)
    short draw_list_num; // +0x36 (Size: 0x2)
    RGE_Picture_List* draw_list; // +0x38 (Size: 0x4)
    RGE_Sound* main_sound; // +0x3C (Size: 0x4)
    unsigned char micro_man_sound; // +0x40 (Size: 0x1)
    unsigned char _pad_3[0x3]; // 0x0041 (Gap: 3)
    RGE_Sound_List* sound_list; // +0x44 (Size: 0x4)
    char name[21]; // +0x48 (Size: 0x15)
    unsigned char _pad_4[0x1]; // 0x005d (Gap: 1)
    short frame_num; // +0x5E (Size: 0x2)
    short facet_num; // +0x60 (Size: 0x2)
    unsigned char _pad_5[0x2]; // 0x0062 (Gap: 2)
    float base_speed; // +0x64 (Size: 0x4)
    float duration; // +0x68 (Size: 0x4)
    float pause_between_loops; // +0x6C (Size: 0x4)
    unsigned char flag; // +0x70 (Size: 0x1)
    unsigned char _pad_6[0x1]; // 0x0071 (Gap: 1)
    short id; // +0x72 (Size: 0x2)
    unsigned char mirror_flag; // +0x74 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x0075 (Gap: 3)
};

// Size: 0x88 (136 bytes)
class RGE_Static_Object {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    long id; // +0x4 (Size: 0x4)
    RGE_Master_Static_Object* master_obj; // +0x8 (Size: 0x4)
    RGE_Player* owner; // +0xC (Size: 0x4)
    RGE_Sprite* sprite; // +0x10 (Size: 0x4)
    RGE_Sprite* old_sprite; // +0x14 (Size: 0x4)
    RGE_Active_Sprite_List* sprite_list; // +0x18 (Size: 0x4)
    RGE_Tile* tile; // +0x1C (Size: 0x4)
    RGE_Static_Object* inside_obj; // +0x20 (Size: 0x4)
    RGE_Object_List* objects; // +0x24 (Size: 0x4)
    short screen_x_offset; // +0x28 (Size: 0x2)
    short screen_y_offset; // +0x2A (Size: 0x2)
    short shadow_x_offset; // +0x2C (Size: 0x2)
    short shadow_y_offset; // +0x2E (Size: 0x2)
    float hp; // +0x30 (Size: 0x4)
    unsigned char curr_damage_percent; // +0x34 (Size: 0x1)
    unsigned char facet; // +0x35 (Size: 0x1)
    unsigned char selected; // +0x36 (Size: 0x1)
    unsigned char selected_group; // +0x37 (Size: 0x1)
    float world_x; // +0x38 (Size: 0x4)
    float world_y; // +0x3C (Size: 0x4)
    float world_z; // +0x40 (Size: 0x4)
    float attribute_amount_held; // +0x44 (Size: 0x4)
    unsigned char object_state; // +0x48 (Size: 0x1)
    unsigned char sleep_flag; // +0x49 (Size: 0x1)
    unsigned char dopple_flag; // +0x4A (Size: 0x1)
    unsigned char goto_sleep_flag; // +0x4B (Size: 0x1)
    short attribute_type_held; // +0x4C (Size: 0x2)
    unsigned char type; // +0x4E (Size: 0x1)
    unsigned char worker_num; // +0x4F (Size: 0x1)
    RGE_Object_Node* player_object_node; // +0x50 (Size: 0x4)
    ManagedArray<int> pathingGroupMembers; // +0x54 (Size: 0x10)
    ManagedArray<int> groupMembers; // +0x64 (Size: 0x10)
    UnitAIModule* unitAIValue; // +0x74 (Size: 0x4)
    int groupCommanderValue; // +0x78 (Size: 0x4)
    int zoneMapIndex; // +0x7C (Size: 0x4)
    float groupRangeValue; // +0x80 (Size: 0x4)
    unsigned char inObstructionMapValue; // +0x84 (Size: 0x1)
    unsigned char lastInObstructionMapValue; // +0x85 (Size: 0x1)
    unsigned char underAttackValue; // +0x86 (Size: 0x1)
    unsigned char _pad_end[0x1]; // 0x0087 (Gap: 1)
};

// Size: 0x6 (6 bytes)
class RGE_TOB_Picts {
public:
    short count; // +0x0 (Size: 0x2)
    short animations; // +0x2 (Size: 0x2)
    short shape_index; // +0x4 (Size: 0x2)
};

// Size: 0x4C (76 bytes)
class RGE_Task {
public:
    short task_type; // +0x0 (Size: 0x2)
    short id; // +0x2 (Size: 0x2)
    unsigned char is_default; // +0x4 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0005 (Gap: 1)
    short action_type; // +0x6 (Size: 0x2)
    short object_group; // +0x8 (Size: 0x2)
    short object_id; // +0xA (Size: 0x2)
    unsigned char combat_level; // +0xC (Size: 0x1)
    unsigned char combat_level_flag; // +0xD (Size: 0x1)
    short terrain_id; // +0xE (Size: 0x2)
    unsigned char owner_type; // +0x10 (Size: 0x1)
    unsigned char holding_attr; // +0x11 (Size: 0x1)
    unsigned char state_building; // +0x12 (Size: 0x1)
    unsigned char _pad_1[0x1]; // 0x0013 (Gap: 1)
    short attribute_type; // +0x14 (Size: 0x2)
    short attribute_type2; // +0x16 (Size: 0x2)
    short attribute_type3; // +0x18 (Size: 0x2)
    short attribute_type4; // +0x1A (Size: 0x2)
    float work_val1; // +0x1C (Size: 0x4)
    float work_val2; // +0x20 (Size: 0x4)
    float work_range; // +0x24 (Size: 0x4)
    unsigned char search_flag; // +0x28 (Size: 0x1)
    unsigned char _pad_2[0x3]; // 0x0029 (Gap: 3)
    float search_wait_time; // +0x2C (Size: 0x4)
    short work_flag; // +0x30 (Size: 0x2)
    short work_flag2; // +0x32 (Size: 0x2)
    RGE_Sprite* move_sprite; // +0x34 (Size: 0x4)
    RGE_Sprite* work_sprite; // +0x38 (Size: 0x4)
    RGE_Sprite* work_sprite2; // +0x3C (Size: 0x4)
    RGE_Sprite* carry_sprite; // +0x40 (Size: 0x4)
    RGE_Sound* work_sound; // +0x44 (Size: 0x4)
    RGE_Sound* work_sound2; // +0x48 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Task_List {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Task** list; // +0x4 (Size: 0x4)
    short list_num; // +0x8 (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x000a (Gap: 2)
};

// Size: 0x8 (8 bytes)
class RGE_Terrain_Data {
public:
    long terrain_num; // +0x0 (Size: 0x4)
    RGE_Terrain_Data_Entry* terrain; // +0x4 (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class RGE_Terrain_Data_Entry {
public:
    long terrain_percent; // +0x0 (Size: 0x4)
    long terrain_type; // +0x4 (Size: 0x4)
    long clumps; // +0x8 (Size: 0x4)
    long spacing; // +0xC (Size: 0x4)
    long base_terrain_type; // +0x10 (Size: 0x4)
    long clumpiness_factor; // +0x14 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class RGE_Terrain_Hot_Spots {
public:
    long x; // +0x0 (Size: 0x4)
    long y; // +0x4 (Size: 0x4)
    long radius; // +0x8 (Size: 0x4)
    long fade; // +0xC (Size: 0x4)
};

// Size: 0x1298 (4760 bytes)
class RGE_Terrain_Info {
public:
    RGE_Terrain_Info_Line terrain[99]; // +0x0 (Size: 0xC60)
    long terrain_num; // +0xC60 (Size: 0x4)
    RGE_Terrain_Hot_Spots hot_spots[99]; // +0xC64 (Size: 0x630)
    long hot_spot_num; // +0x1294 (Size: 0x4)
};

// Size: 0x20 (32 bytes)
class RGE_Terrain_Info_Line {
public:
    long terrain_size; // +0x0 (Size: 0x4)
    long terrain_generated; // +0x4 (Size: 0x4)
    long terrain_type; // +0x8 (Size: 0x4)
    long clumps; // +0xC (Size: 0x4)
    long spacing; // +0x10 (Size: 0x4)
    long base_terrain_type; // +0x14 (Size: 0x4)
    long clumpiness_factor; // +0x18 (Size: 0x4)
    long avoid_hot_spots; // +0x1C (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class RGE_Tile {
public:
    short screen_xpos; // +0x0 (Size: 0x2)
    short screen_ypos; // +0x2 (Size: 0x2)
    unsigned char tile_type; // +0x4 (Size: 0x1)
    unsigned char terrain_type : 5; // +0x5 (Size: 0x1)
    unsigned char border_type : 4; // +0x6 (Size: 0x1)
    unsigned char last_drawn_as; // +0x7 (Size: 0x1)
    unsigned char last_drawn_shape; // +0x8 (Size: 0x1)
    unsigned char draw_as; // +0x9 (Size: 0x1)
    unsigned char draw_attribute; // +0xA (Size: 0x1)
    unsigned char last_drawn_shape2; // +0xB (Size: 0x1)
    RGE_Object_List objects; // +0xC (Size: 0xC)
};

// Size: 0x14 (20 bytes)
class RGE_Tile_List {
public:
    int list_size; // +0x0 (Size: 0x4)
    int num_active; // +0x4 (Size: 0x4)
    int new_count; // +0x8 (Size: 0x4)
    int collapse_list; // +0xC (Size: 0x4)
    RGE_Tile_List_Node* list; // +0x10 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class RGE_Tile_List_Node {
public:
    int col; // +0x0 (Size: 0x4)
    int row; // +0x4 (Size: 0x4)
};

// Size: 0x198 (408 bytes)
class RGE_Tile_Set {
public:
    unsigned char loaded; // +0x0 (Size: 0x1)
    unsigned char random; // +0x1 (Size: 0x1)
    char name[13]; // +0x2 (Size: 0xD)
    char pict_name[13]; // +0xF (Size: 0xD)
    long resource_id; // +0x1C (Size: 0x4)
    TShape* shape; // +0x20 (Size: 0x4)
    RGE_Sound* sound; // +0x24 (Size: 0x4)
    unsigned char map_hi_color; // +0x28 (Size: 0x1)
    unsigned char map_med_color; // +0x29 (Size: 0x1)
    unsigned char map_low_color; // +0x2A (Size: 0x1)
    unsigned char map_lt_cliff_color; // +0x2B (Size: 0x1)
    unsigned char map_rt_cliff_color; // +0x2C (Size: 0x1)
    unsigned char passable_terrain; // +0x2D (Size: 0x1)
    unsigned char impassable_terrain; // +0x2E (Size: 0x1)
    unsigned char is_animated; // +0x2F (Size: 0x1)
    short animation_frames; // +0x30 (Size: 0x2)
    short pause_frames; // +0x32 (Size: 0x2)
    float interval; // +0x34 (Size: 0x4)
    float pause_between_loops; // +0x38 (Size: 0x4)
    short frame; // +0x3C (Size: 0x2)
    short draw_frame; // +0x3E (Size: 0x2)
    float animate_last; // +0x40 (Size: 0x4)
    unsigned char frame_changed; // +0x44 (Size: 0x1)
    unsigned char drawn; // +0x45 (Size: 0x1)
    RGE_TOB_Picts tiles[19]; // +0x46 (Size: 0x72)
    short terrain_to_draw; // +0xB8 (Size: 0x2)
    short rows; // +0xBA (Size: 0x2)
    short cols; // +0xBC (Size: 0x2)
    short borders[32]; // +0xBE (Size: 0x40)
    short obj_types[30]; // +0xFE (Size: 0x3C)
    short obj_density[30]; // +0x13A (Size: 0x3C)
    unsigned char obj_placement_flag[30]; // +0x176 (Size: 0x1E)
    short num_obj_type; // +0x194 (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x0196 (Gap: 2)
};

// Size: 0x6 (6 bytes)
class RGE_Tile_Size {
public:
    short width; // +0x0 (Size: 0x2)
    short height; // +0x2 (Size: 0x2)
    short y_delta; // +0x4 (Size: 0x2)
};

// Size: 0x2B4 (692 bytes)
class RGE_TimeSinceLastCall {
public:
    char TBuff[255]; // +0x0 (Size: 0xFF)
    unsigned char _pad_0[0x1]; // 0x00ff (Gap: 1)
    unsigned long lowTSLC; // +0x100 (Size: 0x4)
    unsigned long highTSLC; // +0x104 (Size: 0x4)
    unsigned long TSLC; // +0x108 (Size: 0x4)
    unsigned long aTSLC[101]; // +0x10C (Size: 0x194)
    int Offset; // +0x2A0 (Size: 0x4)
    unsigned long LastCall; // +0x2A4 (Size: 0x4)
    unsigned long FirstCall; // +0x2A8 (Size: 0x4)
    unsigned long Now; // +0x2AC (Size: 0x4)
    unsigned long cps; // +0x2B0 (Size: 0x4)
};

// Size: 0x30 (48 bytes)
class RGE_Time_Entry {
public:
    float time; // +0x0 (Size: 0x4)
    unsigned char command; // +0x4 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0005 (Gap: 1)
    short obj_type; // +0x6 (Size: 0x2)
    unsigned char player; // +0x8 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0009 (Gap: 3)
    float x; // +0xC (Size: 0x4)
    float y; // +0x10 (Size: 0x4)
    float z; // +0x14 (Size: 0x4)
    short task; // +0x18 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x001a (Gap: 2)
    RGE_Static_Object* this_obj; // +0x1C (Size: 0x4)
    short this_obj_id; // +0x20 (Size: 0x2)
    unsigned char _pad_3[0x2]; // 0x0022 (Gap: 2)
    RGE_Static_Object* target_obj; // +0x24 (Size: 0x4)
    short target_obj_id; // +0x28 (Size: 0x2)
    unsigned char _pad_4[0x2]; // 0x002a (Gap: 2)
    RGE_Time_Entry* next; // +0x2C (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class RGE_Timeline {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Game_World* world; // +0x4 (Size: 0x4)
    RGE_Time_Entry* time_list; // +0x8 (Size: 0x4)
    short list_num; // +0xC (Size: 0x2)
    short avail_id; // +0xE (Size: 0x2)
    float old_time; // +0x10 (Size: 0x4)
};

// Size: 0x20 (32 bytes)
class RGE_Timing_Info {
public:
    unsigned long accum_time; // +0x0 (Size: 0x4)
    unsigned long last_time; // +0x4 (Size: 0x4)
    unsigned long start_time; // +0x8 (Size: 0x4)
    int include_in_total; // +0xC (Size: 0x4)
    int is_summary; // +0x10 (Size: 0x4)
    unsigned long last_single_time; // +0x14 (Size: 0x4)
    unsigned long max_time; // +0x18 (Size: 0x4)
    unsigned long last_max_time; // +0x1C (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Unified_Visible_Map {
public:
    int mapWidth; // +0x0 (Size: 0x4)
    int mapHeight; // +0x4 (Size: 0x4)
    unsigned long* UnifiedVisibleMap; // +0x8 (Size: 0x4)
};

// Size: 0x20 (32 bytes)
class RGE_Victory_Conditions {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Victory_Entry* victory_list; // +0x4 (Size: 0x4)
    long list_num; // +0x8 (Size: 0x4)
    RGE_Player* player; // +0xC (Size: 0x4)
    unsigned char victory; // +0x10 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0011 (Gap: 3)
    RGE_Victory_Point_Entry* victory_point_list; // +0x14 (Size: 0x4)
    long point_list_num; // +0x18 (Size: 0x4)
    long tot_victory_points; // +0x1C (Size: 0x4)
};

// Size: 0x34 (52 bytes)
class RGE_Victory_Entry {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    long obj_type; // +0x4 (Size: 0x4)
    RGE_Player* target_player; // +0x8 (Size: 0x4)
    float x0; // +0xC (Size: 0x4)
    float y0; // +0x10 (Size: 0x4)
    float x1; // +0x14 (Size: 0x4)
    float y1; // +0x18 (Size: 0x4)
    long number; // +0x1C (Size: 0x4)
    long count; // +0x20 (Size: 0x4)
    RGE_Static_Object* this_obj; // +0x24 (Size: 0x4)
    RGE_Static_Object* target_obj; // +0x28 (Size: 0x4)
    unsigned char victory_group; // +0x2C (Size: 0x1)
    unsigned char ally_flag; // +0x2D (Size: 0x1)
    unsigned char state; // +0x2E (Size: 0x1)
    unsigned char checked_flag; // +0x2F (Size: 0x1)
    RGE_Victory_Entry* next; // +0x30 (Size: 0x4)
};

// Size: 0x1C (28 bytes)
class RGE_Victory_Point_Entry {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char state; // +0x1 (Size: 0x1)
    unsigned char id; // +0x2 (Size: 0x1)
    unsigned char group; // +0x3 (Size: 0x1)
    long attribute; // +0x4 (Size: 0x4)
    long amount; // +0x8 (Size: 0x4)
    long points; // +0xC (Size: 0x4)
    long curr_points; // +0x10 (Size: 0x4)
    float curr_attribute_amount; // +0x14 (Size: 0x4)
    RGE_Victory_Point_Entry* next; // +0x18 (Size: 0x4)
};

// Size: 0x360 (864 bytes)
class RGE_View : public TPanel {
public:
    TDrawArea* cur_render_area; // +0xF4 (Size: 0x4)
    int calc_draw_count; // +0xF8 (Size: 0x4)
    RGE_Game_World* world; // +0xFC (Size: 0x4)
    RGE_Player* player; // +0x100 (Size: 0x4)
    RGE_Map* map; // +0x104 (Size: 0x4)
    short tile_wid; // +0x108 (Size: 0x2)
    short tile_hgt; // +0x10A (Size: 0x2)
    short tile_half_wid; // +0x10C (Size: 0x2)
    short tile_half_hgt; // +0x10E (Size: 0x2)
    short elev_hgt; // +0x110 (Size: 0x2)
    short render_rect_wid; // +0x112 (Size: 0x2)
    short render_rect_hgt; // +0x114 (Size: 0x2)
    short max_col_num; // +0x116 (Size: 0x2)
    short max_row_num; // +0x118 (Size: 0x2)
    short center_scr_col; // +0x11A (Size: 0x2)
    short center_scr_row; // +0x11C (Size: 0x2)
    short center_scr_col_offset; // +0x11E (Size: 0x2)
    short center_scr_row_offset; // +0x120 (Size: 0x2)
    short center_map_col; // +0x122 (Size: 0x2)
    short center_map_row; // +0x124 (Size: 0x2)
    short start_scr_col; // +0x126 (Size: 0x2)
    short start_scr_row; // +0x128 (Size: 0x2)
    short start_map_col; // +0x12A (Size: 0x2)
    short start_map_row; // +0x12C (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x012e (Gap: 2)
    int map_scr_x_offset; // +0x130 (Size: 0x4)
    int map_scr_y_offset; // +0x134 (Size: 0x4)
    float last_view_x; // +0x138 (Size: 0x4)
    float last_view_y; // +0x13C (Size: 0x4)
    unsigned char function_mode; // +0x140 (Size: 0x1)
    unsigned char function_parm; // +0x141 (Size: 0x1)
    unsigned char render_terrain_mode; // +0x142 (Size: 0x1)
    unsigned char _pad_1[0x1]; // 0x0143 (Gap: 1)
    long sel_col1; // +0x144 (Size: 0x4)
    long sel_row1; // +0x148 (Size: 0x4)
    long sel_col2; // +0x14C (Size: 0x4)
    long sel_row2; // +0x150 (Size: 0x4)
    short save_paint_terrain; // +0x154 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x0156 (Gap: 2)
    void* white_pen; // +0x158 (Size: 0x4)
    void* red_pen; // +0x15C (Size: 0x4)
    void* hollow_brush; // +0x160 (Size: 0x4)
    TShape* border_line_shape; // +0x164 (Size: 0x4)
    unsigned char scroll_action; // +0x168 (Size: 0x1)
    unsigned char _pad_3[0x3]; // 0x0169 (Gap: 3)
    long mouse_last_x; // +0x16C (Size: 0x4)
    long mouse_last_y; // +0x170 (Size: 0x4)
    RGE_Static_Object* movable_object; // +0x174 (Size: 0x4)
    TSpan_List_Manager* Terrain_Clip_Mask; // +0x178 (Size: 0x4)
    TSpan_List_Manager* Terrain_Fog_Clip_Mask; // +0x17C (Size: 0x4)
    TSpan_List_Manager* Master_Clip_Mask; // +0x180 (Size: 0x4)
    Tile_FogEdge_Table** Tile_Edge_Tables; // +0x184 (Size: 0x4)
    Tile_BlackEdge_Table** Black_Edge_Tables; // +0x188 (Size: 0x4)
    tagRECT OverlaidPanel; // +0x18C (Size: 0x10)
    int OverlaidPanelActive; // +0x19C (Size: 0x4)
    unsigned char EdgeNumber[256]; // +0x1A0 (Size: 0x100)
    int Limited_Render_Rect; // +0x2A0 (Size: 0x4)
    int Use_Rect2; // +0x2A4 (Size: 0x4)
    tagRECT Render_Rect1; // +0x2A8 (Size: 0x10)
    tagRECT Render_Rect2; // +0x2B8 (Size: 0x10)
    void** Float_Scroll_Offsets; // +0x2C8 (Size: 0x4)
    int Float_Scroll_Offsets_Sz; // +0x2CC (Size: 0x4)
    int Float_X_Delta; // +0x2D0 (Size: 0x4)
    int Float_Y_Delta; // +0x2D4 (Size: 0x4)
    int Queued_Blits; // +0x2D8 (Size: 0x4)
    Blit_Queue_Entry* Blit_Queue; // +0x2DC (Size: 0x4)
    int Blit_Queue_Size; // +0x2E0 (Size: 0x4)
    int Blt_Queue_Allocated; // +0x2E4 (Size: 0x4)
    int Current_Blit; // +0x2E8 (Size: 0x4)
    int Blit_Offset_X; // +0x2EC (Size: 0x4)
    int Blit_Offset_Y; // +0x2F0 (Size: 0x4)
    long real_old_map_col; // +0x2F4 (Size: 0x4)
    long real_old_map_row; // +0x2F8 (Size: 0x4)
    RGE_SPick_Info* pick_lists[5]; // +0x2FC (Size: 0x14)
    int pick_list_size[5]; // +0x310 (Size: 0x14)
    TDrawArea* save_area1; // +0x324 (Size: 0x4)
    unsigned char* LastRenderBits; // +0x328 (Size: 0x4)
    void** RenderOffsets; // +0x32C (Size: 0x4)
    int LastRenderSize; // +0x330 (Size: 0x4)
    DClipInfo_List* prior_objs; // +0x334 (Size: 0x4)
    DClipInfo_List* futur_objs; // +0x338 (Size: 0x4)
    int UC_ObjectTouched; // +0x33C (Size: 0x4)
    int UC_TouchedObj; // +0x340 (Size: 0x4)
    unsigned long UC_StartTime; // +0x344 (Size: 0x4)
    unsigned long UC_ElapsedTime; // +0x348 (Size: 0x4)
    TMessagePanel* message_panel; // +0x34C (Size: 0x4)
    Ov_Sprite_Draw_Rec* extra_sprites; // +0x350 (Size: 0x4)
    DisplaySelectedObjRec* DispSel_List; // +0x354 (Size: 0x4)
    int DispSel_List_Size; // +0x358 (Size: 0x4)
    int DispSel_List_Max; // +0x35C (Size: 0x4)
};

// Size: 0x38 (56 bytes)
class RGE_Visible_Map {
public:
    unsigned char** map_offsets; // +0x0 (Size: 0x4)
    RGE_Game_World* world; // +0x4 (Size: 0x4)
    RGE_Player* player; // +0x8 (Size: 0x4)
    RGE_Map* map; // +0xC (Size: 0x4)
    unsigned char* visible_map; // +0x10 (Size: 0x4)
    int widthValue; // +0x14 (Size: 0x4)
    int heightValue; // +0x18 (Size: 0x4)
    int numberTilesExploredValue; // +0x1C (Size: 0x4)
    int numberTotalTilesValue; // +0x20 (Size: 0x4)
    unsigned long PlayerVisibleMaskValue; // +0x24 (Size: 0x4)
    unsigned long PlayerVisibleMaskInvertValue; // +0x28 (Size: 0x4)
    unsigned long PlayerExploredMaskValue; // +0x2C (Size: 0x4)
    unsigned long PlayerExploredMaskInvertValue; // +0x30 (Size: 0x4)
    unsigned long input_csum; // +0x34 (Size: 0x4)
};

// Size: 0x51C (1308 bytes)
class RGE_Zone_Map {
public:
    int numberTilesInZoneValue[257]; // +0x0 (Size: 0x404)
    unsigned char* zone_map; // +0x404 (Size: 0x4)
    unsigned char** zone_map_rows; // +0x408 (Size: 0x4)
    unsigned char zone_info[257]; // +0x40C (Size: 0x101)
    unsigned char _pad_0[0x3]; // 0x050d (Gap: 3)
    float* terrain_passability_rules; // +0x510 (Size: 0x4)
    long terrain_passability_rules_num; // +0x514 (Size: 0x4)
    RGE_Map* map; // +0x518 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class RGE_Zone_Map_List {
public:
    RGE_Zone_Map** zone_maps; // +0x0 (Size: 0x4)
    long zone_map_num; // +0x4 (Size: 0x4)
    RGE_Map* map; // +0x8 (Size: 0x4)
};

// Size: 0x114 (276 bytes)
class ResFileHdr {
public:
    unsigned char* mapped_file; // +0x0 (Size: 0x4)
    int handle; // +0x4 (Size: 0x4)
    resfile_header* header; // +0x8 (Size: 0x4)
    ResFileHdr* next; // +0xC (Size: 0x4)
    char res_name[260]; // +0x10 (Size: 0x104)
};

// Size: 0x250 (592 bytes)
class ResearchAIModule : public AIModule {
public:
    MainDecisionAIModule* md; // +0xF0 (Size: 0x4)
    TechnologyItem techTree; // +0xF4 (Size: 0x54)
    int techTreeLengthValue; // +0x148 (Size: 0x4)
    char techTreeNameValue[257]; // +0x14C (Size: 0x101)
    unsigned char _pad_end[0x3]; // 0x024d (Gap: 3)
};

// Size: 0x10C (268 bytes)
class ResourceAIModule : public AIModule {
public:
    MainDecisionAIModule* md; // +0xF0 (Size: 0x4)
    int numberResourcesValue; // +0xF4 (Size: 0x4)
    int* resourceValue; // +0xF8 (Size: 0x4)
    int* minValue; // +0xFC (Size: 0x4)
    int* maxValue; // +0x100 (Size: 0x4)
    int** resourceTypesValue; // +0x104 (Size: 0x4)
    int* numberResourceTypesValue; // +0x108 (Size: 0x4)
};

// Size: 0x70 (112 bytes)
class ResourceItem {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    ResourceItem* next; // +0x4 (Size: 0x4)
    ResourceItem* prev; // +0x8 (Size: 0x4)
    int valueValue[8]; // +0xC (Size: 0x20)
    int sortedValue[8]; // +0x2C (Size: 0x20)
    int sortedIndexValue[8]; // +0x4C (Size: 0x20)
    int numberValue; // +0x6C (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class ResourceMemory {
public:
    int id; // +0x0 (Size: 0x4)
    unsigned char x; // +0x4 (Size: 0x1)
    unsigned char y; // +0x5 (Size: 0x1)
    unsigned char gatherAttempts; // +0x6 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0007 (Gap: 1)
    int gatherValue; // +0x8 (Size: 0x4)
    unsigned char valid; // +0xC (Size: 0x1)
    unsigned char gone; // +0xD (Size: 0x1)
    unsigned char dropDistance; // +0xE (Size: 0x1)
    unsigned char resourceType; // +0xF (Size: 0x1)
    int dropsiteID; // +0x10 (Size: 0x4)
};

// Size: 0x238 (568 bytes)
class SEs {
public:
    char Name[255]; // +0x0 (Size: 0xFF)
    char Password[255]; // +0xFF (Size: 0xFF)
    unsigned char _pad_0[0x2]; // 0x01fe (Gap: 2)
    _GUID AppGUID; // +0x200 (Size: 0x10)
    _GUID SessGUID; // +0x210 (Size: 0x10)
    unsigned long CurrentPlayers; // +0x220 (Size: 0x4)
    unsigned long MaxPlayers; // +0x224 (Size: 0x4)
    unsigned long User1; // +0x228 (Size: 0x4)
    unsigned long User2; // +0x22C (Size: 0x4)
    unsigned long User3; // +0x230 (Size: 0x4)
    unsigned long User4; // +0x234 (Size: 0x4)
};

// Size: 0x20 (32 bytes)
class SLhape_File_Header {
public:
    char Version[4]; // +0x0 (Size: 0x4)
    long Num_Shapes; // +0x4 (Size: 0x4)
    char Comment[24]; // +0x8 (Size: 0x18)
};

// Size: 0x14 (20 bytes)
class SNDOBJ {
public:
    unsigned char* pbWaveData; // +0x0 (Size: 0x4)
    unsigned long cbWaveSize; // +0x4 (Size: 0x4)
    int iAlloc; // +0x8 (Size: 0x4)
    int iCurrent; // +0xC (Size: 0x4)
    IDirectSoundBuffer* Buffers[1]; // +0x10 (Size: 0x4)
};

// Size: 0x3C (60 bytes)
class SP_Victory_Info {
public:
    int ObjType; // +0x0 (Size: 0x4)
    int AllFlag; // +0x4 (Size: 0x4)
    int PlayerID; // +0x8 (Size: 0x4)
    int DestObjID; // +0xC (Size: 0x4)
    float x1; // +0x10 (Size: 0x4)
    float y1; // +0x14 (Size: 0x4)
    float x2; // +0x18 (Size: 0x4)
    float y2; // +0x1C (Size: 0x4)
    int VictoryType; // +0x20 (Size: 0x4)
    int Amount; // +0x24 (Size: 0x4)
    int AttribType; // +0x28 (Size: 0x4)
    int obj_ID; // +0x2C (Size: 0x4)
    int dest_obj_ID; // +0x30 (Size: 0x4)
    RGE_Static_Object* obj; // +0x34 (Size: 0x4)
    RGE_Static_Object* dest_obj; // +0x38 (Size: 0x4)
};

// Size: 0x60 (96 bytes)
class SPs {
public:
    char Name[80]; // +0x0 (Size: 0x50)
    _GUID* GUID; // +0x50 (Size: 0x4)
    unsigned long MajVersion; // +0x54 (Size: 0x4)
    unsigned long MinVersion; // +0x58 (Size: 0x4)
    int Active; // +0x5C (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class Shape_File_Header {
public:
    long version; // +0x0 (Size: 0x4)
    long shape_num; // +0x4 (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class Shape_Header {
public:
    long bounds; // +0x0 (Size: 0x4)
    long origin; // +0x4 (Size: 0x4)
    long xmin; // +0x8 (Size: 0x4)
    long ymin; // +0xC (Size: 0x4)
    long xmax; // +0x10 (Size: 0x4)
    long ymax; // +0x14 (Size: 0x4)
};

// Size: 0x20 (32 bytes)
class Shape_Info {
public:
    unsigned long Shape_Data_Offsets; // +0x0 (Size: 0x4)
    unsigned long Shape_Outline_Offset; // +0x4 (Size: 0x4)
    long Reserved1; // +0x8 (Size: 0x4)
    long Reserved2; // +0xC (Size: 0x4)
    long Width; // +0x10 (Size: 0x4)
    long Height; // +0x14 (Size: 0x4)
    long Hotspot_X; // +0x18 (Size: 0x4)
    long Hotspot_Y; // +0x1C (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class Shape_Offsets {
public:
    long shape; // +0x0 (Size: 0x4)
    long palette; // +0x4 (Size: 0x4)
};

// Size: 0xB0 (176 bytes)
class Special_Events {
public:
    long time_slice; // +0x0 (Size: 0x4)
    long X_line_pos; // +0x4 (Size: 0x4)
    long Y_line_pos; // +0x8 (Size: 0x4)
    long intermediate_y_line_segment; // +0xC (Size: 0x4)
    unsigned char player_id; // +0x10 (Size: 0x1)
    unsigned char player_color; // +0x11 (Size: 0x1)
    unsigned char event; // +0x12 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0013 (Gap: 1)
    long pop_total; // +0x14 (Size: 0x4)
    long interger_value_1; // +0x18 (Size: 0x4)
    long interger_value_2; // +0x1C (Size: 0x4)
    long start_x; // +0x20 (Size: 0x4)
    long start_y; // +0x24 (Size: 0x4)
    long start_txt_x1; // +0x28 (Size: 0x4)
    long start_txt_y1; // +0x2C (Size: 0x4)
    long start_txt_x2; // +0x30 (Size: 0x4)
    long start_txt_y2; // +0x34 (Size: 0x4)
    int text_length1; // +0x38 (Size: 0x4)
    char text1[50]; // +0x3C (Size: 0x32)
    unsigned char _pad_1[0x2]; // 0x006e (Gap: 2)
    int text_length2; // +0x70 (Size: 0x4)
    char text2[50]; // +0x74 (Size: 0x32)
    unsigned char _pad_2[0x2]; // 0x00a6 (Gap: 2)
    int icon_flag; // +0xA8 (Size: 0x4)
    Special_Events* next; // +0xAC (Size: 0x4)
};

// Size: 0xF0 (240 bytes)
class StrategyAIModule : public AIModule {
public:
};

// Size: 0x2B8 (696 bytes)
class TButtonPanel : public TPanel {
public:
    long id[9]; // +0xF4 (Size: 0x24)
    long id2[9]; // +0x118 (Size: 0x24)
    TButtonPanel::ButtonType buttonTypeValue; // +0x13C (Size: 0x4)
    TButtonPanel::DrawType drawTypeValue; // +0x140 (Size: 0x4)
    TButtonPanel::NotifyType notifyTypeValue; // +0x144 (Size: 0x4)
    TDigital* sound; // +0x148 (Size: 0x4)
    TShape* pic[9]; // +0x14C (Size: 0x24)
    short pic_index[9]; // +0x170 (Size: 0x12)
    unsigned char _pad_0[0x2]; // 0x0182 (Gap: 2)
    int auto_pic_pos; // +0x184 (Size: 0x4)
    long pic_x; // +0x188 (Size: 0x4)
    long pic_y; // +0x18C (Size: 0x4)
    int all_hot; // +0x190 (Size: 0x4)
    int draw_reverse; // +0x194 (Size: 0x4)
    char* text1[9]; // +0x198 (Size: 0x24)
    char* text2[9]; // +0x1BC (Size: 0x24)
    long text_x; // +0x1E0 (Size: 0x4)
    long text_y; // +0x1E4 (Size: 0x4)
    void* font; // +0x1E8 (Size: 0x4)
    long font_wid; // +0x1EC (Size: 0x4)
    long font_hgt; // +0x1F0 (Size: 0x4)
    short num_states; // +0x1F4 (Size: 0x2)
    short cur_state; // +0x1F6 (Size: 0x2)
    int is_down; // +0x1F8 (Size: 0x4)
    TButtonPanel** radio_buttons; // +0x1FC (Size: 0x4)
    short num_radio_buttons; // +0x200 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x0202 (Gap: 2)
    unsigned long button_down_time; // +0x204 (Size: 0x4)
    unsigned long text_color1[9]; // +0x208 (Size: 0x24)
    unsigned long text_color2[9]; // +0x22C (Size: 0x24)
    unsigned long highlight_text_color1[9]; // +0x250 (Size: 0x24)
    unsigned long highlight_text_color2[9]; // +0x274 (Size: 0x24)
    long hotkey; // +0x298 (Size: 0x4)
    int hotkey_shift; // +0x29C (Size: 0x4)
    int bevel_type; // +0x2A0 (Size: 0x4)
    unsigned char bevel_color1; // +0x2A4 (Size: 0x1)
    unsigned char bevel_color2; // +0x2A5 (Size: 0x1)
    unsigned char bevel_color3; // +0x2A6 (Size: 0x1)
    unsigned char bevel_color4; // +0x2A7 (Size: 0x1)
    unsigned char bevel_color5; // +0x2A8 (Size: 0x1)
    unsigned char bevel_color6; // +0x2A9 (Size: 0x1)
    unsigned char _pad_2[0x2]; // 0x02aa (Gap: 2)
    long key_down; // +0x2AC (Size: 0x4)
    int disabled; // +0x2B0 (Size: 0x4)
    int sound_number; // +0x2B4 (Size: 0x4)
};

// Size: 0x100 (256 bytes)
class TChat {
public:
    void* HostWnd; // +0x0 (Size: 0x4)
    int chatGroupPlayers[10]; // +0x4 (Size: 0x28)
    char* Chat[51]; // +0x2C (Size: 0xCC)
    int CurrentMsgNo; // +0xF8 (Size: 0x4)
    TTaunt* taunt; // +0xFC (Size: 0x4)
};

// Size: 0x1774 (6004 bytes)
class TCommunications_Handler {
public:
    int OptionsChanged; // +0x0 (Size: 0x4)
    char* OptionsData; // +0x4 (Size: 0x4)
    int Steps; // +0x8 (Size: 0x4)
    unsigned long TickStart; // +0xC (Size: 0x4)
    unsigned long TickCount; // +0x10 (Size: 0x4)
    unsigned long TimeSinceLastCall; // +0x14 (Size: 0x4)
    TChat* Chat; // +0x18 (Size: 0x4)
    int MeHost; // +0x1C (Size: 0x4)
    int HaveHostInit; // +0x20 (Size: 0x4)
    char InCommBuff[4001]; // +0x24 (Size: 0xFA1)
    char TBuff[257]; // +0xFC5 (Size: 0x101)
    unsigned char _pad_0[0x2]; // 0x10c6 (Gap: 2)
    unsigned long current_turn; // +0x10C8 (Size: 0x4)
    unsigned long next_command_turn; // +0x10CC (Size: 0x4)
    unsigned int sequence; // +0x10D0 (Size: 0x4)
    long WaitOnPlayer; // +0x10D4 (Size: 0x4)
    unsigned long TurnSpeedMsec; // +0x10D8 (Size: 0x4)
    unsigned long AcknowledgeAfterMsec; // +0x10DC (Size: 0x4)
    unsigned int Me; // +0x10E0 (Size: 0x4)
    int Multiplayer; // +0x10E4 (Size: 0x4)
    int OutOfSyncFlag; // +0x10E8 (Size: 0x4)
    unsigned long dwStopTime; // +0x10EC (Size: 0x4)
    float lastRXDataRate; // +0x10F0 (Size: 0x4)
    float lastTXDataRate; // +0x10F4 (Size: 0x4)
    char MyFriendlyName[129]; // +0x10F8 (Size: 0x81)
    char MyFormalName[129]; // +0x1179 (Size: 0x81)
    char MyGameTitle[129]; // +0x11FA (Size: 0x81)
    unsigned char _pad_1[0x1]; // 0x127b (Gap: 1)
    unsigned long CurrentPlayers; // +0x127C (Size: 0x4)
    int previous_last_world_random; // +0x1280 (Size: 0x4)
    int last_world_random; // +0x1284 (Size: 0x4)
    int StepMode; // +0x1288 (Size: 0x4)
    unsigned long turnstart; // +0x128C (Size: 0x4)
    unsigned long lastcalltick; // +0x1290 (Size: 0x4)
    unsigned long mselapsed; // +0x1294 (Size: 0x4)
    int AvgTurnTime; // +0x1298 (Size: 0x4)
    int SkipFrames; // +0x129C (Size: 0x4)
    int PauseChangePending; // +0x12A0 (Size: 0x4)
    unsigned long CommunicationsVersionCode; // +0x12A4 (Size: 0x4)
    int ShuttingDown; // +0x12A8 (Size: 0x4)
    unsigned long ReturnElapsed; // +0x12AC (Size: 0x4)
    unsigned long ReturnRXPacketSize; // +0x12B0 (Size: 0x4)
    unsigned long ReturnTXPacketSize; // +0x12B4 (Size: 0x4)
    unsigned long RXPacketLength; // +0x12B8 (Size: 0x4)
    unsigned long RXPacketLengthHigh; // +0x12BC (Size: 0x4)
    unsigned long TXPacketLength; // +0x12C0 (Size: 0x4)
    unsigned long TXPacketLengthHigh; // +0x12C4 (Size: 0x4)
    NAME* FriendlyName; // +0x12C8 (Size: 0x4)
    NAME* FormalName; // +0x12CC (Size: 0x4)
    unsigned long LastTimeoutMessageTime; // +0x12D0 (Size: 0x4)
    COMMSTATUS CommunicationsStatus; // +0x12D4 (Size: 0x4)
    unsigned short MaxGamePlayers; // +0x12D8 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x12da (Gap: 2)
    _GUID ServiceGUID; // +0x12DC (Size: 0x10)
    _GUID ApplicationGUID; // +0x12EC (Size: 0x10)
    _GUID SessionGUID; // +0x12FC (Size: 0x10)
    void* HostHWND; // +0x130C (Size: 0x4)
    int LobbyLaunched; // +0x1310 (Size: 0x4)
    unsigned long MaxReceiveLatency; // +0x1314 (Size: 0x4)
    _GUID NullGUID; // +0x1318 (Size: 0x10)
    unsigned long ResendAcknowledgements; // +0x1328 (Size: 0x4)
    unsigned long ResentToOther; // +0x132C (Size: 0x4)
    unsigned long DroppedPacketCount; // +0x1330 (Size: 0x4)
    unsigned long RXPackets; // +0x1334 (Size: 0x4)
    unsigned long TXPackets; // +0x1338 (Size: 0x4)
    int IAmLagging; // +0x133C (Size: 0x4)
    unsigned long ServiceTimeout; // +0x1340 (Size: 0x4)
    unsigned long LastPlayerCommunication[10]; // +0x1344 (Size: 0x28)
    unsigned long LastPlayerWarning[10]; // +0x136C (Size: 0x28)
    unsigned long LastTXPing[10]; // +0x1394 (Size: 0x28)
    unsigned long PlayerStopTurn[10]; // +0x13BC (Size: 0x28)
    unsigned int LastSerialRequestedTX[10]; // +0x13E4 (Size: 0x28)
    unsigned long LastRequestHonoredTX[10]; // +0x140C (Size: 0x28)
    unsigned int LastSerialRepliedTX[10]; // +0x1434 (Size: 0x28)
    unsigned long LastRequestRepliedTX[10]; // +0x145C (Size: 0x28)
    unsigned long dwFlags; // +0x1484 (Size: 0x4)
    unsigned long dwMaxBufferSize; // +0x1488 (Size: 0x4)
    unsigned long dwMaxQueueSize; // +0x148C (Size: 0x4)
    unsigned long dwMaxPlayers; // +0x1490 (Size: 0x4)
    unsigned long dwHundredBaud; // +0x1494 (Size: 0x4)
    unsigned long dwLatency; // +0x1498 (Size: 0x4)
    int Kicked[10]; // +0x149C (Size: 0x28)
    RGE_Communications_Queue* InQ; // +0x14C4 (Size: 0x4)
    RGE_Communications_Queue* OutQ; // +0x14C8 (Size: 0x4)
    RGE_Lobby* Lobby; // +0x14CC (Size: 0x4)
    RGE_TimeSinceLastCall* tslc; // +0x14D0 (Size: 0x4)
    RGE_Communications_Speed* Speed; // +0x14D4 (Size: 0x4)
    RGE_Communications_Synchronize* Sync; // +0x14D8 (Size: 0x4)
    RGE_Communications_Addresses* Addresses; // +0x14DC (Size: 0x4)
    RGE_Comm_Error* Err; // +0x14E0 (Size: 0x4)
    unsigned int GTDSerialNo; // +0x14E4 (Size: 0x4)
    unsigned int HighResendStore; // +0x14E8 (Size: 0x4)
    unsigned int DestMap[10]; // +0x14EC (Size: 0x28)
    unsigned char RGE_Guaranteed_Delivery; // +0x1514 (Size: 0x1)
    unsigned char _pad_3[0x3]; // 0x1515 (Gap: 3)
    int IntentionallyDropPackets; // +0x1518 (Size: 0x4)
    unsigned int WaitingForAck; // +0x151C (Size: 0x4)
    RESENDER* Resend; // +0x1520 (Size: 0x4)
    HOLDER* OnHold; // +0x1524 (Size: 0x4)
    unsigned int PlayerHighSerialNumber[10]; // +0x1528 (Size: 0x28)
    COMMPLAYEROPTIONS PlayerOptions; // +0x1550 (Size: 0x1D0)
    unsigned long LastTurnAck[10]; // +0x1720 (Size: 0x28)
    unsigned int HoldCount; // +0x1748 (Size: 0x4)
    int WasKicked[10]; // +0x174C (Size: 0x28)
};

// Size: 0x2584 (9604 bytes)
class TCommunications_Services {
public:
    SPs Service[100]; // +0x0 (Size: 0x2580)
    int ServiceCount; // +0x2580 (Size: 0x4)
};

// Size: 0x457B0 (284592 bytes)
class TCommunications_Sessions {
public:
    int SessionCount; // +0x0 (Size: 0x4)
    SEs Session[501]; // +0x4 (Size: 0x45798)
    _GUID glpGuid; // +0x4579C (Size: 0x10)
    IDirectPlay2* glpIDC; // +0x457AC (Size: 0x4)
};

// Size: 0x7B0 (1968 bytes)
class TDebuggingLog {
public:
    int Timestamp; // +0x0 (Size: 0x4)
    int DateTimestamp; // +0x4 (Size: 0x4)
    int LogToFile; // +0x8 (Size: 0x4)
    int LogToOutput; // +0xC (Size: 0x4)
    int Sequence; // +0x10 (Size: 0x4)
    int Flush; // +0x14 (Size: 0x4)
    int LogIsOpen; // +0x18 (Size: 0x4)
    int LogError; // +0x1C (Size: 0x4)
    unsigned long LogStartTickCount; // +0x20 (Size: 0x4)
    unsigned long SeqNo; // +0x24 (Size: 0x4)
    char TBuff[800]; // +0x28 (Size: 0x320)
    char osbuf[1000]; // +0x348 (Size: 0x3E8)
    char Filename[128]; // +0x730 (Size: 0x80)
};

// Size: 0x490 (1168 bytes)
class TDialogPanel : public TEasy_Panel {
public:
    void* dlg_wnd; // +0x478 (Size: 0x4)
    TPanel* save_parent_child; // +0x47C (Size: 0x4)
    int text_font_id; // +0x480 (Size: 0x4)
    int input_font_id; // +0x484 (Size: 0x4)
    int button_font_id; // +0x488 (Size: 0x4)
    int button_sound_id; // +0x48C (Size: 0x4)
};

// Size: 0x3C (60 bytes)
class TDigital {
public:
    TSound_Driver* sound_system; // +0x0 (Size: 0x4)
    TDigital* owner; // +0x4 (Size: 0x4)
    unsigned char loaded; // +0x8 (Size: 0x1)
    unsigned char failed; // +0x9 (Size: 0x1)
    char sound_file[13]; // +0xA (Size: 0xD)
    unsigned char _pad_0[0x1]; // 0x0017 (Gap: 1)
    long resource_id; // +0x18 (Size: 0x4)
    long volume; // +0x1C (Size: 0x4)
    unsigned long pitch; // +0x20 (Size: 0x4)
    long pan; // +0x24 (Size: 0x4)
    int loop; // +0x28 (Size: 0x4)
    unsigned char* wave_data; // +0x2C (Size: 0x4)
    tWAVEFORMATEX* wave_info; // +0x30 (Size: 0x4)
    IDirectSoundBuffer* sound_buffer; // +0x34 (Size: 0x4)
    unsigned long data_size; // +0x38 (Size: 0x4)
};

// Size: 0x100 (256 bytes)
class TDrawArea {
public:
    TDrawSystem* DrawSystem; // +0x0 (Size: 0x4)
    void* Wnd; // +0x4 (Size: 0x4)
    unsigned char* Bits; // +0x8 (Size: 0x4)
    BITMAPINFO256* BitmapInfo; // +0xC (Size: 0x4)
    void* Bitmap; // +0x10 (Size: 0x4)
    void* OldBitmap; // +0x14 (Size: 0x4)
    int Width; // +0x18 (Size: 0x4)
    int Height; // +0x1C (Size: 0x4)
    int Pitch; // +0x20 (Size: 0x4)
    int Orien; // +0x24 (Size: 0x4)
    tagRECT ClipRect; // +0x28 (Size: 0x10)
    void* DrawDc; // +0x38 (Size: 0x4)
    IDirectDrawSurface* DrawSurface; // +0x3C (Size: 0x4)
    _DDSURFACEDESC SurfaceDesc; // +0x40 (Size: 0x6C)
    DrawAreaNode* Node; // +0xAC (Size: 0x4)
    char* Name; // +0xB0 (Size: 0x4)
    unsigned char* LastBits; // +0xB4 (Size: 0x4)
    int LastPitch; // +0xB8 (Size: 0x4)
    void** DisplayOffsets; // +0xBC (Size: 0x4)
    void** CurDisplayOffsets; // +0xC0 (Size: 0x4)
    void** FloatOffsets; // +0xC4 (Size: 0x4)
    RGE_Color_Table* shadow_color_table; // +0xC8 (Size: 0x4)
    TSpan_List_Manager* SpanList; // +0xCC (Size: 0x4)
    TSpan_List_Manager* CurSpanList; // +0xD0 (Size: 0x4)
    int Float_X_Delta; // +0xD4 (Size: 0x4)
    int Float_Y_Delta; // +0xD8 (Size: 0x4)
    int DisplayOffsetsSz; // +0xDC (Size: 0x4)
    int FloatOffsetsSz; // +0xE0 (Size: 0x4)
    int SystemMemOnly; // +0xE4 (Size: 0x4)
    int UsingVidMem; // +0xE8 (Size: 0x4)
    int UseTrans; // +0xEC (Size: 0x4)
    int IsPrimarySurface; // +0xF0 (Size: 0x4)
    int Restored; // +0xF4 (Size: 0x4)
    int ExtendedLines; // +0xF8 (Size: 0x4)
    unsigned char TransColor; // +0xFC (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x00fd (Gap: 3)
};

// Size: 0x47C (1148 bytes)
class TDrawSystem {
public:
    void* Inst; // +0x0 (Size: 0x4)
    void* Wnd; // +0x4 (Size: 0x4)
    void* Pal; // +0x8 (Size: 0x4)
    TDrawArea* DrawArea; // +0xC (Size: 0x4)
    TDrawArea* PrimaryArea; // +0x10 (Size: 0x4)
    DrawAreaNode* DrawAreaList; // +0x14 (Size: 0x4)
    IDirectDraw* DirDraw; // +0x18 (Size: 0x4)
    IDirectDrawSurface* PrimarySurface; // +0x1C (Size: 0x4)
    IDirectDrawClipper* Clipper; // +0x20 (Size: 0x4)
    IDirectDrawPalette* DirDrawPal; // +0x24 (Size: 0x4)
    unsigned long Flags; // +0x28 (Size: 0x4)
    int ScreenWidth; // +0x2C (Size: 0x4)
    int ScreenHeight; // +0x30 (Size: 0x4)
    int ColorBits; // +0x34 (Size: 0x4)
    int ErrorCode; // +0x38 (Size: 0x4)
    int ChangedMode; // +0x3C (Size: 0x4)
    int IsBanked; // +0x40 (Size: 0x4)
    int CanSrcBlt; // +0x44 (Size: 0x4)
    int Restored; // +0x48 (Size: 0x4)
    int ModeAvail640; // +0x4C (Size: 0x4)
    int ModeAvail800; // +0x50 (Size: 0x4)
    int ModeAvail1024; // +0x54 (Size: 0x4)
    int ModeAvail1280; // +0x58 (Size: 0x4)
    int ModeAvail320_200; // +0x5C (Size: 0x4)
    int ModeAvail320_240; // +0x60 (Size: 0x4)
    int ModeAvail320_200_16; // +0x64 (Size: 0x4)
    int ModeAvail320_240_16; // +0x68 (Size: 0x4)
    int ModeAvail640_16; // +0x6C (Size: 0x4)
    int ModeAvail800_16; // +0x70 (Size: 0x4)
    int ModeAvail1024_16; // +0x74 (Size: 0x4)
    tagPALETTEENTRY palette[256]; // +0x78 (Size: 0x400)
    unsigned char DrawType; // +0x478 (Size: 0x1)
    unsigned char ScreenMode; // +0x479 (Size: 0x1)
    unsigned char _pad_end[0x2]; // 0x047a (Gap: 2)
};

// Size: 0x2BC (700 bytes)
class TDropDownButtonPanel : public TButtonPanel {
public:
    TDropDownPanel* drop_down_panel; // +0x2B8 (Size: 0x4)
};

// Size: 0x144 (324 bytes)
class TDropDownPanel : public TPanel {
public:
    TTextPanel* val_panel; // +0xF4 (Size: 0x4)
    TButtonPanel* btn_panel; // +0xF8 (Size: 0x4)
    TListPanel* list_panel; // +0xFC (Size: 0x4)
    TScrollBarPanel* scbar_panel; // +0x100 (Size: 0x4)
    TDropDownPanel::DropdownMode mode; // +0x104 (Size: 0x4)
    short val_num; // +0x108 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x010a (Gap: 2)
    long val_wid; // +0x10C (Size: 0x4)
    long val_hgt; // +0x110 (Size: 0x4)
    long btn_wid; // +0x114 (Size: 0x4)
    long btn_hgt; // +0x118 (Size: 0x4)
    long list_wid; // +0x11C (Size: 0x4)
    long list_hgt; // +0x120 (Size: 0x4)
    long scbar_wid; // +0x124 (Size: 0x4)
    long scbar_arrow_hgt; // +0x128 (Size: 0x4)
    long scbar_tab_hgt; // +0x12C (Size: 0x4)
    unsigned char list_is_above; // +0x130 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0131 (Gap: 3)
    long font_hgt; // +0x134 (Size: 0x4)
    int outline_color; // +0x138 (Size: 0x4)
    TDropDownPanel::DrawStyle draw_style; // +0x13C (Size: 0x4)
    int draw_val_rect; // +0x140 (Size: 0x4)
};

// Size: 0x478 (1144 bytes)
class TEasy_Panel : public TPanel {
public:
    long ideal_width; // +0xF4 (Size: 0x4)
    long ideal_height; // +0xF8 (Size: 0x4)
    char info_file_name[260]; // +0xFC (Size: 0x104)
    long info_id; // +0x200 (Size: 0x4)
    TShape* background_pic; // +0x204 (Size: 0x4)
    TShape* background_pic2; // +0x208 (Size: 0x4)
    void* palette; // +0x20C (Size: 0x4)
    char cursor_file[260]; // +0x210 (Size: 0x104)
    long cursor_id; // +0x314 (Size: 0x4)
    int background_pos; // +0x318 (Size: 0x4)
    int use_bevels; // +0x31C (Size: 0x4)
    unsigned char bevel_color1; // +0x320 (Size: 0x1)
    unsigned char bevel_color2; // +0x321 (Size: 0x1)
    unsigned char bevel_color3; // +0x322 (Size: 0x1)
    unsigned char bevel_color4; // +0x323 (Size: 0x1)
    unsigned char bevel_color5; // +0x324 (Size: 0x1)
    unsigned char bevel_color6; // +0x325 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0326 (Gap: 2)
    unsigned long text_color1; // +0x328 (Size: 0x4)
    unsigned long text_color2; // +0x32C (Size: 0x4)
    unsigned long focus_color1; // +0x330 (Size: 0x4)
    unsigned long focus_color2; // +0x334 (Size: 0x4)
    unsigned long state_color1; // +0x338 (Size: 0x4)
    unsigned long state_color2; // +0x33C (Size: 0x4)
    char popup_info_file_name[260]; // +0x340 (Size: 0x104)
    long popup_info_id; // +0x444 (Size: 0x4)
    TShape* button_pics; // +0x448 (Size: 0x4)
    RGE_Color_Table* shadow_color_table; // +0x44C (Size: 0x4)
    long shadow_amount; // +0x450 (Size: 0x4)
    unsigned char background_color1; // +0x454 (Size: 0x1)
    unsigned char background_color2; // +0x455 (Size: 0x1)
    unsigned char _pad_1[0x2]; // 0x0456 (Gap: 2)
    int enable_ime; // +0x458 (Size: 0x4)
    unsigned char help_mode; // +0x45C (Size: 0x1)
    unsigned char _pad_2[0x3]; // 0x045d (Gap: 3)
    int stock_brush; // +0x460 (Size: 0x4)
    void* brush; // +0x464 (Size: 0x4)
    unsigned long brush_color; // +0x468 (Size: 0x4)
    TDrawArea* shadow_area; // +0x46C (Size: 0x4)
    int allow_shadow_area; // +0x470 (Size: 0x4)
    int saved_mouse_mode; // +0x474 (Size: 0x4)
};

// Size: 0x16C (364 bytes)
class TEditPanel : public TPanel {
public:
    void* edit_wnd; // +0xF4 (Size: 0x4)
    short fixed_len; // +0xF8 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x00fa (Gap: 2)
    char* text; // +0xFC (Size: 0x4)
    int text_len; // +0x100 (Size: 0x4)
    int hidden; // +0x104 (Size: 0x4)
    void* brush; // +0x108 (Size: 0x4)
    int stock_brush; // +0x10C (Size: 0x4)
    int  (__stdcall * old_sub_wnd_proc)(); // +0x110 (Size: 0x4)
    unsigned long text_color1; // +0x114 (Size: 0x4)
    unsigned long text_color2; // +0x118 (Size: 0x4)
    unsigned long highlight_text_color1; // +0x11C (Size: 0x4)
    unsigned long highlight_text_color2; // +0x120 (Size: 0x4)
    unsigned long back_color; // +0x124 (Size: 0x4)
    TEditPanel::FormatType format; // +0x128 (Size: 0x4)
    void* font; // +0x12C (Size: 0x4)
    int multi_line; // +0x130 (Size: 0x4)
    tagRECT draw_rect; // +0x134 (Size: 0x10)
    unsigned int draw_format; // +0x144 (Size: 0x4)
    int auto_sel; // +0x148 (Size: 0x4)
    int sel_len; // +0x14C (Size: 0x4)
    int bevel_type; // +0x150 (Size: 0x4)
    unsigned char bevel_color1; // +0x154 (Size: 0x1)
    unsigned char bevel_color2; // +0x155 (Size: 0x1)
    unsigned char bevel_color3; // +0x156 (Size: 0x1)
    unsigned char bevel_color4; // +0x157 (Size: 0x1)
    unsigned char bevel_color5; // +0x158 (Size: 0x1)
    unsigned char bevel_color6; // +0x159 (Size: 0x1)
    unsigned char _pad_1[0x2]; // 0x015a (Gap: 2)
    int bevel_size; // +0x15C (Size: 0x4)
    unsigned long imc; // +0x160 (Size: 0x4)
    int enable_ime; // +0x164 (Size: 0x4)
    int turn_ime_on; // +0x168 (Size: 0x4)
};

// Size: 0x5A4 (1444 bytes)
class THelpDialog : public TDialogPanel {
public:
    long help_page_id; // +0x490 (Size: 0x4)
    char parent_panel[256]; // +0x494 (Size: 0x100)
    TTextPanel* title; // +0x594 (Size: 0x4)
    TTextPanel* list; // +0x598 (Size: 0x4)
    TButtonPanel* ok_button; // +0x59C (Size: 0x4)
    TButtonPanel* encyclopedia_button; // +0x5A0 (Size: 0x4)
};

// Size: 0x1CC (460 bytes)
class THorizontalSliderPanel : public TVerticalSliderPanel {
public:
};

// Size: 0x1B8 (440 bytes)
class TInputPanel : public TTextPanel {
public:
    unsigned char caret_color; // +0x188 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0189 (Gap: 3)
    unsigned long caret_interval; // +0x18C (Size: 0x4)
    unsigned long caret_last_time; // +0x190 (Size: 0x4)
    int draw_caret; // +0x194 (Size: 0x4)
    TDigital* overLengthSound; // +0x198 (Size: 0x4)
    TInputPanel::FormatType format_type; // +0x19C (Size: 0x4)
    char* input_buffer; // +0x1A0 (Size: 0x4)
    char* input_buffer1; // +0x1A4 (Size: 0x4)
    char* input_buffer2; // +0x1A8 (Size: 0x4)
    short input_len; // +0x1AC (Size: 0x2)
    short max_len; // +0x1AE (Size: 0x2)
    int insert_mode; // +0x1B0 (Size: 0x4)
    short input_pos; // +0x1B4 (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x01b6 (Gap: 2)
};

// Size: 0x4AC (1196 bytes)
class TListDialog : public TDialogPanel {
public:
    TTextPanel* title; // +0x490 (Size: 0x4)
    TListPanel* list; // +0x494 (Size: 0x4)
    TScrollBarPanel* scroll_bar; // +0x498 (Size: 0x4)
    TButtonPanel* ok_btn; // +0x49C (Size: 0x4)
    TButtonPanel* cancel_btn; // +0x4A0 (Size: 0x4)
    short list_id; // +0x4A4 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x04a6 (Gap: 2)
    char* list_name; // +0x4A8 (Size: 0x4)
};

// Size: 0x1A0 (416 bytes)
class TListPanel : public TTextPanel {
public:
    int auto_track; // +0x188 (Size: 0x4)
    unsigned long mouse_scroll_last_time; // +0x18C (Size: 0x4)
    unsigned long mouse_scroll_interval; // +0x190 (Size: 0x4)
    int mouse_scroll_up; // +0x194 (Size: 0x4)
    int mouse_scroll_down; // +0x198 (Size: 0x4)
    int drawHighlightBar; // +0x19C (Size: 0x4)
};

// Size: 0x4A4 (1188 bytes)
class TMessageDialog : public TDialogPanel {
public:
    unsigned char dlg_type; // +0x490 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0491 (Gap: 3)
    TTextPanel* text; // +0x494 (Size: 0x4)
    TButtonPanel* button[3]; // +0x498 (Size: 0xC)
};

// Size: 0x380 (896 bytes)
class TMessagePanel : public TPanel {
public:
    TMessagePanel::MessageType message_type; // +0xF4 (Size: 0x4)
    char text[512]; // +0xF8 (Size: 0x200)
    int showing_message; // +0x2F8 (Size: 0x4)
    unsigned long start_time; // +0x2FC (Size: 0x4)
    long show_message_interval; // +0x300 (Size: 0x4)
    void* font; // +0x304 (Size: 0x4)
    long font_wid; // +0x308 (Size: 0x4)
    long font_hgt; // +0x30C (Size: 0x4)
    unsigned char font_color; // +0x310 (Size: 0x1)
    unsigned char back_color; // +0x311 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0312 (Gap: 2)
    int index_color; // +0x314 (Size: 0x4)
    unsigned long font_color1; // +0x318 (Size: 0x4)
    unsigned long font_color2; // +0x31C (Size: 0x4)
    TMessagePanel::JustType horz_just; // +0x320 (Size: 0x4)
    TMessagePanel::JustType vert_just; // +0x324 (Size: 0x4)
    int word_wrap; // +0x328 (Size: 0x4)
    void* image_clip_region; // +0x32C (Size: 0x4)
    TDrawArea* ImageBuffer; // +0x330 (Size: 0x4)
    tagRECT ImageRect; // +0x334 (Size: 0x10)
    tagRECT UsedImageRect; // +0x344 (Size: 0x10)
    tagRECT UsedScreenRect; // +0x354 (Size: 0x10)
    int LastIBWidth; // +0x364 (Size: 0x4)
    int LastIBHeight; // +0x368 (Size: 0x4)
    int ImageTextActive; // +0x36C (Size: 0x4)
    TShape* Icon1; // +0x370 (Size: 0x4)
    TShape* Icon2; // +0x374 (Size: 0x4)
    int IconFrame1; // +0x378 (Size: 0x4)
    int IconFrame2; // +0x37C (Size: 0x4)
};

// Size: 0x254 (596 bytes)
class TMousePointer {
public:
    int custom_draw; // +0x0 (Size: 0x4)
    TDrawArea* render_area; // +0x4 (Size: 0x4)
    TDrawArea* save_area; // +0x8 (Size: 0x4)
    TDrawArea* primary_area; // +0xC (Size: 0x4)
    int Num_Cursors; // +0x10 (Size: 0x4)
    int Max_Cursors; // +0x14 (Size: 0x4)
    TDrawArea* cursors[16]; // +0x18 (Size: 0x40)
    TShape* Cursor_Shape; // +0x58 (Size: 0x4)
    int Mouse_Mode; // +0x5C (Size: 0x4)
    int Max_CX; // +0x60 (Size: 0x4)
    int Max_CY; // +0x64 (Size: 0x4)
    int cWidth; // +0x68 (Size: 0x4)
    int cHeight; // +0x6C (Size: 0x4)
    int gWidth; // +0x70 (Size: 0x4)
    int gHeight; // +0x74 (Size: 0x4)
    long mouse_x; // +0x78 (Size: 0x4)
    long mouse_y; // +0x7C (Size: 0x4)
    long save_x; // +0x80 (Size: 0x4)
    long save_y; // +0x84 (Size: 0x4)
    int facet; // +0x88 (Size: 0x4)
    int game_facet; // +0x8C (Size: 0x4)
    int next_facet; // +0x90 (Size: 0x4)
    int last_facet; // +0x94 (Size: 0x4)
    int d_top; // +0x98 (Size: 0x4)
    int d_left; // +0x9C (Size: 0x4)
    int d_bottom; // +0xA0 (Size: 0x4)
    int d_right; // +0xA4 (Size: 0x4)
    int g_top; // +0xA8 (Size: 0x4)
    int g_left; // +0xAC (Size: 0x4)
    int g_bottom; // +0xB0 (Size: 0x4)
    int g_right; // +0xB4 (Size: 0x4)
    int save_area_valid; // +0xB8 (Size: 0x4)
    tagRECT save_rect; // +0xBC (Size: 0x10)
    tagRECT mouse_rect; // +0xCC (Size: 0x10)
    tagRECT cursor_rect; // +0xDC (Size: 0x10)
    tagRECT new_save_rect; // +0xEC (Size: 0x10)
    tagRECT restore_rect; // +0xFC (Size: 0x10)
    tagRECT game_window; // +0x10C (Size: 0x10)
    IDirectDrawSurface* restoreSurface; // +0x11C (Size: 0x4)
    IDirectDrawSurface* renderSurface; // +0x120 (Size: 0x4)
    IDirectDrawSurface* PrimarySurface; // +0x124 (Size: 0x4)
    int active; // +0x128 (Size: 0x4)
    int drawn; // +0x12C (Size: 0x4)
    int Shutdown; // +0x130 (Size: 0x4)
    int Setup; // +0x134 (Size: 0x4)
    int GameMode; // +0x138 (Size: 0x4)
    int GameEnabled; // +0x13C (Size: 0x4)
    int MouseOnScreen; // +0x140 (Size: 0x4)
    unsigned long LastDrawTime; // +0x144 (Size: 0x4)
    long LastddError; // +0x148 (Size: 0x4)
    char cursor_file[260]; // +0x14C (Size: 0x104)
    int cursor_file_id; // +0x250 (Size: 0x4)
};

// Size: 0x3F8 (1016 bytes)
class TMusic_System {
public:
    char path[260]; // +0x0 (Size: 0x104)
    unsigned char music_type; // +0x104 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0105 (Gap: 3)
    TSound_Driver* sound_system; // +0x108 (Size: 0x4)
    void* instance; // +0x10C (Size: 0x4)
    void* window; // +0x110 (Size: 0x4)
    int device_open; // +0x114 (Size: 0x4)
    unsigned int device_id; // +0x118 (Size: 0x4)
    tagMCI_PLAY_PARMS play_info; // +0x11C (Size: 0xC)
    unsigned char playing_track; // +0x128 (Size: 0x1)
    char file_name[261]; // +0x129 (Size: 0x105)
    unsigned char _pad_1[0x2]; // 0x022e (Gap: 2)
    int start_track; // +0x230 (Size: 0x4)
    int end_track; // +0x234 (Size: 0x4)
    int make_cur_track; // +0x238 (Size: 0x4)
    unsigned long set_pos; // +0x23C (Size: 0x4)
    int loop; // +0x240 (Size: 0x4)
    int current_track; // +0x244 (Size: 0x4)
    int track_count; // +0x248 (Size: 0x4)
    int notify_waiting; // +0x24C (Size: 0x4)
    long start_volume; // +0x250 (Size: 0x4)
    long volume; // +0x254 (Size: 0x4)
    int paused; // +0x258 (Size: 0x4)
    int auto_paused; // +0x25C (Size: 0x4)
    int inactivated; // +0x260 (Size: 0x4)
    int fade_out; // +0x264 (Size: 0x4)
    unsigned long fade_time; // +0x268 (Size: 0x4)
    int fading_track; // +0x26C (Size: 0x4)
    long fade_volume; // +0x270 (Size: 0x4)
    unsigned long last_fade_time; // +0x274 (Size: 0x4)
    int mixer_open; // +0x278 (Size: 0x4)
    void* mixer_handle; // +0x27C (Size: 0x4)
    tagMIXERLINEA mixer_line_info; // +0x280 (Size: 0xA8)
    tagMIXERLINECONTROLSA mixer_line_controls; // +0x328 (Size: 0x18)
    tagMIXERCONTROLA mixer_volume_control; // +0x340 (Size: 0x94)
    tMIXERCONTROLDETAILS mixer_volume_details; // +0x3D4 (Size: 0x18)
    tMIXERCONTROLDETAILS_UNSIGNED mixer_volume_value; // +0x3EC (Size: 0x4)
    void* midi_window; // +0x3F0 (Size: 0x4)
    unsigned long last_check_time; // +0x3F4 (Size: 0x4)
};

// Size: 0xF4 (244 bytes)
class TPanel {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    TPanel* previousPanelValue; // +0x4 (Size: 0x4)
    TPanel* previousModalPanelValue; // +0x8 (Size: 0x4)
    long pnl_x; // +0xC (Size: 0x4)
    long pnl_y; // +0x10 (Size: 0x4)
    long pnl_wid; // +0x14 (Size: 0x4)
    long pnl_hgt; // +0x18 (Size: 0x4)
    char* panelNameValue; // +0x1C (Size: 0x4)
    TDrawArea* render_area; // +0x20 (Size: 0x4)
    tagRECT clip_rect; // +0x24 (Size: 0x10)
    TPanel::PositionMode position_mode; // +0x34 (Size: 0x4)
    TPanel::RedrawMode need_redraw; // +0x38 (Size: 0x4)
    TPanel* curr_child; // +0x3C (Size: 0x4)
    TPanel* parent_panel; // +0x40 (Size: 0x4)
    TPanel* left_panel; // +0x44 (Size: 0x4)
    TPanel* top_panel; // +0x48 (Size: 0x4)
    TPanel* right_panel; // +0x4C (Size: 0x4)
    TPanel* bottom_panel; // +0x50 (Size: 0x4)
    PanelNode* node; // +0x54 (Size: 0x4)
    PanelNode* first_child_node; // +0x58 (Size: 0x4)
    PanelNode* last_child_node; // +0x5C (Size: 0x4)
    TPanel* tab_prev_panel; // +0x60 (Size: 0x4)
    TPanel* tab_next_panel; // +0x64 (Size: 0x4)
    int mouse_captured; // +0x68 (Size: 0x4)
    int active; // +0x6C (Size: 0x4)
    int visible; // +0x70 (Size: 0x4)
    int tab_stop; // +0x74 (Size: 0x4)
    int have_focus; // +0x78 (Size: 0x4)
    int overlapping_children; // +0x7C (Size: 0x4)
    int handle_mouse_input; // +0x80 (Size: 0x4)
    int just_drawn; // +0x84 (Size: 0x4)
    void* clip_rgn; // +0x88 (Size: 0x4)
    tagRECT render_rect; // +0x8C (Size: 0x10)
    long left_border; // +0x9C (Size: 0x4)
    long top_border; // +0xA0 (Size: 0x4)
    long right_border; // +0xA4 (Size: 0x4)
    long bottom_border; // +0xA8 (Size: 0x4)
    long min_wid; // +0xAC (Size: 0x4)
    long max_wid; // +0xB0 (Size: 0x4)
    long min_hgt; // +0xB4 (Size: 0x4)
    long max_hgt; // +0xB8 (Size: 0x4)
    long mouse_hold_interval; // +0xBC (Size: 0x4)
    long mouse_move_tolerance; // +0xC0 (Size: 0x4)
    long mouse_down_x; // +0xC4 (Size: 0x4)
    long mouse_down_y; // +0xC8 (Size: 0x4)
    int mouse_down_ctrl; // +0xCC (Size: 0x4)
    int mouse_down_shift; // +0xD0 (Size: 0x4)
    unsigned long mouse_down_time; // +0xD4 (Size: 0x4)
    int error_code; // +0xD8 (Size: 0x4)
    int z_order; // +0xDC (Size: 0x4)
    int display_changed_count; // +0xE0 (Size: 0x4)
    long help_string_id; // +0xE4 (Size: 0x4)
    long help_page_id; // +0xE8 (Size: 0x4)
    unsigned char mouse_action; // +0xEC (Size: 0x1)
    unsigned char mouse_down_button; // +0xED (Size: 0x1)
    unsigned char panel_type; // +0xEE (Size: 0x1)
    unsigned char color; // +0xEF (Size: 0x1)
    unsigned char fill_in_background; // +0xF0 (Size: 0x1)
    unsigned char clip_to_parent; // +0xF1 (Size: 0x1)
    unsigned char draw_rect2_flag; // +0xF2 (Size: 0x1)
    unsigned char need_restore; // +0xF3 (Size: 0x1)
};

// Size: 0xAD8 (2776 bytes)
class TPanelSystem {
public:
    TPanel* mouseOwnerValue; // +0x0 (Size: 0x4)
    TPanel* keyboardOwnerValue; // +0x4 (Size: 0x4)
    TPanel* modalPanelValue; // +0x8 (Size: 0x4)
    TPanel* currentPanelValue; // +0xC (Size: 0x4)
    PanelNode* panelListValue; // +0x10 (Size: 0x4)
    int numberActivePanelsValue; // +0x14 (Size: 0x4)
    TPanel* prevCurrentChildValue; // +0x18 (Size: 0x4)
    void* palette[10]; // +0x1C (Size: 0x28)
    char palette_file[10][260]; // +0x44 (Size: 0xA28)
    int palette_use_count[10]; // +0xA6C (Size: 0x28)
    long palette_id[10]; // +0xA94 (Size: 0x28)
    unsigned long Imc; // +0xABC (Size: 0x4)
    int ImeEnabled; // +0xAC0 (Size: 0x4)
    int ImeOn; // +0xAC4 (Size: 0x4)
    int InputEnabled; // +0xAC8 (Size: 0x4)
    int saved_colors; // +0xACC (Size: 0x4)
    unsigned long save_back_color; // +0xAD0 (Size: 0x4)
    unsigned long save_text_color; // +0xAD4 (Size: 0x4)
};

// Size: 0x20 (32 bytes)
class TPicture {
public:
    tagBITMAPINFOHEADER* Dib; // +0x0 (Size: 0x4)
    BITMAPINFO256* BitmapInfo; // +0x4 (Size: 0x4)
    unsigned char* Bits; // +0x8 (Size: 0x4)
    TRANSINFO* TransInfo; // +0xC (Size: 0x4)
    int OwnMemory; // +0x10 (Size: 0x4)
    long Width; // +0x14 (Size: 0x4)
    long Height; // +0x18 (Size: 0x4)
    short Orien; // +0x1C (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x001e (Gap: 2)
};

// Size: 0x11C (284 bytes)
class TPicturePanel : public TPanel {
public:
    char pic_name[12]; // +0xF4 (Size: 0xC)
    long res_id; // +0x100 (Size: 0x4)
    int size_from_pic; // +0x104 (Size: 0x4)
    int keep_loaded; // +0x108 (Size: 0x4)
    int own_pic; // +0x10C (Size: 0x4)
    TPicturePanel::PictureType pic_type; // +0x110 (Size: 0x4)
    TPicture* pic; // +0x114 (Size: 0x4)
    TShape* shape; // +0x118 (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class TRANSINFO {
public:
    int AnyTrans; // +0x0 (Size: 0x4)
    long x; // +0x4 (Size: 0x4)
    long y; // +0x8 (Size: 0x4)
    long w; // +0xC (Size: 0x4)
    long h; // +0x10 (Size: 0x4)
    LINEINFO* LineInfo; // +0x14 (Size: 0x4)
};

// Size: 0x40 (64 bytes)
class TRIBE_Action : public RGE_Action {
public:
};

// Size: 0x40 (64 bytes)
class TRIBE_Action_Artifact : public RGE_Action {
public:
};

// Size: 0x40 (64 bytes)
class TRIBE_Action_Build : public RGE_Action {
public:
};

// Size: 0x48 (72 bytes)
class TRIBE_Action_Convert : public RGE_Action {
public:
    unsigned char was_same_owner; // +0x40 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0041 (Gap: 3)
    float requiredRange; // +0x44 (Size: 0x4)
};

// Size: 0x44 (68 bytes)
class TRIBE_Action_Discovery_Artifact : public RGE_Action {
public:
    unsigned char* flags; // +0x40 (Size: 0x4)
};

// Size: 0x40 (64 bytes)
class TRIBE_Action_Heal : public RGE_Action {
public:
};

// Size: 0x44 (68 bytes)
class TRIBE_Action_Hunt : public RGE_Action {
public:
    int targetType; // +0x40 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class TRIBE_Action_List : public RGE_Action_List {
public:
};

// Size: 0x50 (80 bytes)
class TRIBE_Action_Make_Obj : public RGE_Action {
public:
    short obj_id; // +0x40 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x0042 (Gap: 2)
    float work_done; // +0x44 (Size: 0x4)
    int unique_id; // +0x48 (Size: 0x4)
    unsigned char pre_paid; // +0x4C (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x004d (Gap: 3)
};

// Size: 0x48 (72 bytes)
class TRIBE_Action_Make_Tech : public RGE_Action {
public:
    short tech_id; // +0x40 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x0042 (Gap: 2)
    int unique_id; // +0x44 (Size: 0x4)
};

// Size: 0x44 (68 bytes)
class TRIBE_Action_Repair : public RGE_Action {
public:
    unsigned char save_target_command_flag; // +0x40 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x0041 (Gap: 3)
};

// Size: 0x48 (72 bytes)
class TRIBE_Action_Trade : public RGE_Action {
public:
    float pick_up_x; // +0x40 (Size: 0x4)
    float pick_up_y; // +0x44 (Size: 0x4)
};

// Size: 0x40 (64 bytes)
class TRIBE_Action_Wonder : public RGE_Action {
public:
};

// Size: 0x204 (516 bytes)
class TRIBE_Building_Object : public TRIBE_Combat_Object {
public:
    Production_Queue_Record* production_queue; // +0x1C8 (Size: 0x4)
    short production_queue_size; // +0x1CC (Size: 0x2)
    short production_queue_count; // +0x1CE (Size: 0x2)
    unsigned char production_queue_enabled; // +0x1D0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x01d1 (Gap: 3)
    RGE_Action_List* production_queue_actions; // +0x1D4 (Size: 0x4)
    unsigned char production_queue_change_flag; // +0x1D8 (Size: 0x1)
    unsigned char production_queue_auto_paused; // +0x1D9 (Size: 0x1)
    short production_queue_need_attr; // +0x1DA (Size: 0x2)
    float build_pts; // +0x1DC (Size: 0x4)
    int unique_build_id; // +0x1E0 (Size: 0x4)
    unsigned char culture; // +0x1E4 (Size: 0x1)
    unsigned char built; // +0x1E5 (Size: 0x1)
    unsigned char _pad_1[0x2]; // 0x01e6 (Gap: 2)
    int DoppleInstalled; // +0x1E8 (Size: 0x4)
    unsigned long PriorMap1; // +0x1EC (Size: 0x4)
    unsigned long PriorMap2; // +0x1F0 (Size: 0x4)
    unsigned long PriorMap3; // +0x1F4 (Size: 0x4)
    long PriorTurn1; // +0x1F8 (Size: 0x4)
    long PriorTurn2; // +0x1FC (Size: 0x4)
    long PriorTurn3; // +0x200 (Size: 0x4)
};

// Size: 0x4C4 (1220 bytes)
class TRIBE_Campaign_Editor_Screen : public TScreenPanel {
public:
    unsigned char need_to_save; // +0x478 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0479 (Gap: 3)
    TTextPanel* title; // +0x47C (Size: 0x4)
    TTextPanel* filename_title; // +0x480 (Size: 0x4)
    TTextPanel* scenarios_title; // +0x484 (Size: 0x4)
    TTextPanel* campaign_scenarios_title; // +0x488 (Size: 0x4)
    TListPanel* scenarios; // +0x48C (Size: 0x4)
    TListPanel* campaign_scenarios; // +0x490 (Size: 0x4)
    TScrollBarPanel* scenarios_bar; // +0x494 (Size: 0x4)
    TScrollBarPanel* campaign_scenarios_bar; // +0x498 (Size: 0x4)
    TEditPanel* filename; // +0x49C (Size: 0x4)
    TButtonPanel* ok_button; // +0x4A0 (Size: 0x4)
    TButtonPanel* cancel_button; // +0x4A4 (Size: 0x4)
    TButtonPanel* save_button; // +0x4A8 (Size: 0x4)
    TButtonPanel* add_button; // +0x4AC (Size: 0x4)
    TButtonPanel* remove_button; // +0x4B0 (Size: 0x4)
    TButtonPanel* move_scenario_up_button; // +0x4B4 (Size: 0x4)
    TButtonPanel* move_scenario_down_button; // +0x4B8 (Size: 0x4)
    TDropDownPanel* filename_drop; // +0x4BC (Size: 0x4)
    RGE_Campaign* campaign; // +0x4C0 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class TRIBE_Cliff_Info {
public:
    long info[4]; // +0x0 (Size: 0x10)
};

// Size: 0x1C8 (456 bytes)
class TRIBE_Combat_Object : public RGE_Combat_Object {
public:
    unsigned char own_master; // +0x1C4 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x01c5 (Gap: 3)
};

// Size: 0x18 (24 bytes)
class TRIBE_Command : public RGE_Command {
public:
};

// Size: 0xC (12 bytes)
class TRIBE_Command_Attack_Ground {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char unit_num; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    float location_x; // +0x4 (Size: 0x4)
    float location_y; // +0x8 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class TRIBE_Command_Build {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char unit_num; // +0x1 (Size: 0x1)
    unsigned char unit_player_id; // +0x2 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0003 (Gap: 1)
    float location_x; // +0x4 (Size: 0x4)
    float location_y; // +0x8 (Size: 0x4)
    short obj_id; // +0xC (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x000e (Gap: 2)
    int unique_id; // +0x10 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class TRIBE_Command_Build_Wall {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char unit_num; // +0x1 (Size: 0x1)
    unsigned char unit_player_id; // +0x2 (Size: 0x1)
    unsigned char x1; // +0x3 (Size: 0x1)
    unsigned char y1; // +0x4 (Size: 0x1)
    unsigned char x2; // +0x5 (Size: 0x1)
    unsigned char y2; // +0x6 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0007 (Gap: 1)
    short obj_id; // +0x8 (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x000a (Gap: 2)
    int unique_id; // +0xC (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class TRIBE_Command_Cancel_Build {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    int unit_id; // +0x4 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class TRIBE_Command_Explore {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char numUnits; // +0x1 (Size: 0x1)
    unsigned char unit_player_id; // +0x2 (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x0003 (Gap: 1)
    float targetXPosition; // +0x4 (Size: 0x4)
    float targetYPosition; // +0x8 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class TRIBE_Command_Game {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char game_command; // +0x1 (Size: 0x1)
    short var1; // +0x2 (Size: 0x2)
    short var2; // +0x4 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x0006 (Gap: 2)
    float var3; // +0x8 (Size: 0x4)
    short var4; // +0xC (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x000e (Gap: 2)
};

// Size: 0xC (12 bytes)
class TRIBE_Command_Give_Attribute {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char player_id; // +0x1 (Size: 0x1)
    unsigned char to_player_id; // +0x2 (Size: 0x1)
    unsigned char attr_id; // +0x3 (Size: 0x1)
    float attr_amount; // +0x4 (Size: 0x4)
    float attr_cost; // +0x8 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class TRIBE_Command_Make {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    int unit_id; // +0x4 (Size: 0x4)
    unsigned char unit_player_id; // +0x8 (Size: 0x1)
    unsigned char _pad_1[0x1]; // 0x0009 (Gap: 1)
    short obj_id; // +0xA (Size: 0x2)
    int unique_id; // +0xC (Size: 0x4)
};

// Size: 0xC (12 bytes)
class TRIBE_Command_Queue {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    long bldg_id; // +0x4 (Size: 0x4)
    short train_id; // +0x8 (Size: 0x2)
    short train_count; // +0xA (Size: 0x2)
};

// Size: 0x8 (8 bytes)
class TRIBE_Command_Repair {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char unit_num; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    RGE_Obj_Info target; // +0x4 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class TRIBE_Command_Research {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    int unit_id; // +0x4 (Size: 0x4)
    unsigned char unit_player_id; // +0x8 (Size: 0x1)
    unsigned char _pad_1[0x1]; // 0x0009 (Gap: 1)
    short tech_id; // +0xA (Size: 0x2)
    int unique_id; // +0xC (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class TRIBE_Command_Trade_Attribute {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char unit_num; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    long attribute; // +0x4 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class TRIBE_Command_Unload {
public:
    unsigned char command; // +0x0 (Size: 0x1)
    unsigned char unit_num; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    float location_x; // +0x4 (Size: 0x4)
    float location_y; // +0x8 (Size: 0x4)
};

// Size: 0x8B8 (2232 bytes)
class TRIBE_Credits_Screen : public TScreenPanel {
public:
    TScrollTextPanel* text_panel; // +0x478 (Size: 0x4)
    int text_set; // +0x47C (Size: 0x4)
    int picture_set; // +0x480 (Size: 0x4)
    unsigned long last_picture_time; // +0x484 (Size: 0x4)
    unsigned long last_pause_time; // +0x488 (Size: 0x4)
    TRIBE_Credits_Screen::ScreenMode mode; // +0x48C (Size: 0x4)
    tagPALETTEENTRY color_table[256]; // +0x490 (Size: 0x400)
    tagPALETTEENTRY color; // +0x890 (Size: 0x4)
    TShape* back_pics[7]; // +0x894 (Size: 0x1C)
    int first_draw; // +0x8B0 (Size: 0x4)
    int text_done; // +0x8B4 (Size: 0x4)
};

// Size: 0x4BC (1212 bytes)
class TRIBE_Dialog_List : public RGE_Dialog_List {
public:
};

// Size: 0x4A4 (1188 bytes)
class TRIBE_Dialog_Name : public TDialogPanel {
public:
    TTextPanel* title; // +0x490 (Size: 0x4)
    TTextPanel* name_text; // +0x494 (Size: 0x4)
    TEditPanel* name_input; // +0x498 (Size: 0x4)
    TButtonPanel* ok_button; // +0x49C (Size: 0x4)
    TButtonPanel* cancel_button; // +0x4A0 (Size: 0x4)
};

// Size: 0x4B4 (1204 bytes)
class TRIBE_Dialog_Sed_Menu : public TDialogPanel {
public:
    TRIBE_Screen_Sed* scenario_editor; // +0x490 (Size: 0x4)
    TTextPanel* title; // +0x494 (Size: 0x4)
    TButtonPanel* buttons[7]; // +0x498 (Size: 0x1C)
};

// Size: 0x174 (372 bytes)
class TRIBE_Diamond_Map_View : public RGE_Diamond_Map_View {
public:
    unsigned long last_attack_time; // +0x16C (Size: 0x4)
    int flash_on; // +0x170 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class TRIBE_Effects : public RGE_Effects {
public:
};

// Size: 0x858 (2136 bytes)
class TRIBE_Gaia : public TRIBE_Player {
public:
    float update_time; // +0x848 (Size: 0x4)
    long update_nature; // +0x84C (Size: 0x4)
    long last_count; // +0x850 (Size: 0x4)
    long animal_max; // +0x854 (Size: 0x4)
};

// Size: 0x1254 (4692 bytes)
class TRIBE_Game : public RGE_Base_Game {
public:
    MouseClickInfo* MouseRightClickTable; // +0xA24 (Size: 0x4)
    int MouseRightClickTableSize; // +0xA28 (Size: 0x4)
    MouseClickInfo* MouseLeftClickTable; // +0xA2C (Size: 0x4)
    int MouseLeftClickTableSize; // +0xA30 (Size: 0x4)
    long queue_is_waiting_on_pop_counter[9]; // +0xA34 (Size: 0x24)
    int random_civ[9]; // +0xA58 (Size: 0x24)
    TRIBE_Game::TRIBE_Game_Options tribe_game_options; // +0xA7C (Size: 0x6C)
    char testing_scenario[260]; // +0xAE8 (Size: 0x104)
    void* video_window; // +0xBEC (Size: 0x4)
    int cur_video; // +0xBF0 (Size: 0x4)
    int  (__stdcall * old_video_wnd_proc)(); // +0xBF4 (Size: 0x4)
    int video_paused; // +0xBF8 (Size: 0x4)
    unsigned long last_video_time; // +0xBFC (Size: 0x4)
    int video_setup; // +0xC00 (Size: 0x4)
    int video_double_size; // +0xC04 (Size: 0x4)
    int video_changed_res; // +0xC08 (Size: 0x4)
    int video_hi_color; // +0xC0C (Size: 0x4)
    long video_save_res_wid; // +0xC10 (Size: 0x4)
    long video_save_res_hgt; // +0xC14 (Size: 0x4)
    void* video_save_palette; // +0xC18 (Size: 0x4)
    int started_menu_music; // +0xC1C (Size: 0x4)
    int show_object_id; // +0xC20 (Size: 0x4)
    TRIBE_Screen_Game* game_screen; // +0xC24 (Size: 0x4)
    long notification_loc_x[5]; // +0xC28 (Size: 0x14)
    long notification_loc_y[5]; // +0xC3C (Size: 0x14)
    long current_notification_loc; // +0xC50 (Size: 0x4)
    long current_notification_recalled; // +0xC54 (Size: 0x4)
    char startup_scenario[260]; // +0xC58 (Size: 0x104)
    char startup_game[260]; // +0xD5C (Size: 0x104)
    unsigned long auto_exit_time; // +0xE60 (Size: 0x4)
    char save_game_name[260]; // +0xE64 (Size: 0x104)
    char load_game_name[260]; // +0xF68 (Size: 0x104)
    char timing_text2[256]; // +0x106C (Size: 0x100)
    int save_humanity[9]; // +0x116C (Size: 0x24)
    unsigned char quick_start_game; // +0x1190 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x1191 (Gap: 3)
    int random_start_value; // +0x1194 (Size: 0x4)
    unsigned char computerNameUsed[18][10]; // +0x1198 (Size: 0xB4)
    void* handleIdleLock; // +0x124C (Size: 0x4)
    int inHandleIdle; // +0x1250 (Size: 0x4)
};

// Size: 0x6C (108 bytes)
class TRIBE_Game::TRIBE_Game_Options {
public:
    TRIBE_Game::MapSize mapSizeValue; // +0x0 (Size: 0x4)
    TRIBE_Game::MapType mapTypeValue; // +0x4 (Size: 0x4)
    int animalsValue; // +0x8 (Size: 0x4)
    int predatorsValue; // +0xC (Size: 0x4)
    TRIBE_Game::VictoryType victoryTypeValue; // +0x10 (Size: 0x4)
    int victoryAmountValue; // +0x14 (Size: 0x4)
    unsigned char civilizationValue[9]; // +0x18 (Size: 0x9)
    unsigned char _pad_0[0x3]; // 0x0021 (Gap: 3)
    int scenarioPlayerValue[9]; // +0x24 (Size: 0x24)
    unsigned char playerColorValue[9]; // +0x48 (Size: 0x9)
    unsigned char computerNameValue[9]; // +0x51 (Size: 0x9)
    unsigned char allowTradingValue; // +0x5A (Size: 0x1)
    unsigned char longCombatValue; // +0x5B (Size: 0x1)
    unsigned char randomizePositionsValue; // +0x5C (Size: 0x1)
    unsigned char fullTechTreeValue; // +0x5D (Size: 0x1)
    unsigned char _pad_1[0x2]; // 0x005e (Gap: 2)
    TRIBE_Game::ResourceLevel resourceLevelValue; // +0x60 (Size: 0x4)
    TRIBE_Game::Age startingAgeValue; // +0x64 (Size: 0x4)
    unsigned char startingUnitsValue; // +0x68 (Size: 0x1)
    unsigned char deathMatchValue; // +0x69 (Size: 0x1)
    unsigned char popLimitValue; // +0x6A (Size: 0x1)
    unsigned char _pad_end[0x1]; // 0x006b (Gap: 1)
};

// Size: 0x114 (276 bytes)
class TRIBE_Game::receive_game_options::combined_options {
public:
    RGE_Base_Game::RGE_Game_Options rge_options; // +0x0 (Size: 0xA8)
    TRIBE_Game::TRIBE_Game_Options tribe_options; // +0xA8 (Size: 0x6C)
};

// Size: 0x114 (276 bytes)
class TRIBE_Game::send_game_options::combined_options {
public:
    RGE_Base_Game::RGE_Game_Options rge_options; // +0x0 (Size: 0xA8)
    TRIBE_Game::TRIBE_Game_Options tribe_options; // +0xA8 (Size: 0x6C)
};

// Size: 0x1 (1 bytes)
class TRIBE_History_Entry {
public:
    unsigned char population; // +0x0 (Size: 0x1)
};

// Size: 0x10 (16 bytes)
class TRIBE_History_Events {
public:
    unsigned char event; // +0x0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0001 (Gap: 3)
    long time; // +0x4 (Size: 0x4)
    long world_time; // +0x8 (Size: 0x4)
    TRIBE_History_Events* next; // +0xC (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class TRIBE_History_Info {
public:
    TRIBE_History_Entry* history; // +0x0 (Size: 0x4)
    TRIBE_History_Events* events; // +0x4 (Size: 0x4)
    long number_of_events; // +0x8 (Size: 0x4)
    long number_of_entries; // +0xC (Size: 0x4)
    long max_number_of_entries; // +0x10 (Size: 0x4)
};

// Size: 0x380 (896 bytes)
class TRIBE_Main_View : public RGE_Main_View {
public:
};

// Size: 0xB5F8 (46584 bytes)
class TRIBE_Map : public RGE_Map {
public:
    TRIBE_Game* Game; // +0x8DD0 (Size: 0x4)
    RGE_Player* rge_player; // +0x8DD4 (Size: 0x4)
    RGE_Game_World* rge_game_world; // +0x8DD8 (Size: 0x4)
    RGE_Map_Gen_Info* rge_map_gen_information; // +0x8DDC (Size: 0x4)
    unsigned char* zones; // +0x8DE0 (Size: 0x4)
    long old_cliff_x; // +0x8DE4 (Size: 0x4)
    long old_cliff_y; // +0x8DE8 (Size: 0x4)
    long safe_cliff_x; // +0x8DEC (Size: 0x4)
    long safe_cliff_y; // +0x8DF0 (Size: 0x4)
    long old_cliff_direction; // +0x8DF4 (Size: 0x4)
    TRIBE_Master_Cliff_Info cliff_master_table[256]; // +0x8DF8 (Size: 0x2800)
};

// Size: 0x17C (380 bytes)
class TRIBE_Master_Building_Object : public TRIBE_Master_Combat_Object {
public:
    RGE_Sound* construction_sound; // +0x164 (Size: 0x4)
    RGE_Sprite* construction_sprite; // +0x168 (Size: 0x4)
    unsigned char building_connect_flag; // +0x16C (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x016d (Gap: 1)
    short building_facet; // +0x16E (Size: 0x2)
    unsigned char build_and_go_away; // +0x170 (Size: 0x1)
    unsigned char _pad_1[0x1]; // 0x0171 (Gap: 1)
    short on_build_make_obj; // +0x172 (Size: 0x2)
    short on_build_make_tile; // +0x174 (Size: 0x2)
    short on_build_make_overlay; // +0x176 (Size: 0x2)
    short on_build_make_tech; // +0x178 (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x017a (Gap: 2)
};

// Size: 0x28 (40 bytes)
class TRIBE_Master_Cliff_Info {
public:
    long id; // +0x0 (Size: 0x4)
    long facet; // +0x4 (Size: 0x4)
    long id2; // +0x8 (Size: 0x4)
    long facet2; // +0xC (Size: 0x4)
    TRIBE_Cliff_Info info; // +0x10 (Size: 0x10)
    float offset_x; // +0x20 (Size: 0x4)
    float offset_y; // +0x24 (Size: 0x4)
};

// Size: 0x164 (356 bytes)
class TRIBE_Master_Combat_Object : public RGE_Master_Combat_Object {
public:
    Attribute_Cost build_inventory[3]; // +0x148 (Size: 0x12)
    short build_pts_required; // +0x15A (Size: 0x2)
    short id_of_building_obj; // +0x15C (Size: 0x2)
    unsigned char button_location; // +0x15E (Size: 0x1)
    unsigned char _pad_0[0x1]; // 0x015f (Gap: 1)
    short orig_pierce_armor; // +0x160 (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x0162 (Gap: 2)
};

// Size: 0x2C (44 bytes)
class TRIBE_Master_Player : public RGE_Master_Player {
public:
};

// Size: 0xB8 (184 bytes)
class TRIBE_Master_Tree_Object : public RGE_Master_Static_Object {
public:
};

// Size: 0x49C (1180 bytes)
class TRIBE_Mission_Screen : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    TTextPanel* list; // +0x47C (Size: 0x4)
    TScrollBarPanel* scroll_bar; // +0x480 (Size: 0x4)
    TButtonPanel* ok_button; // +0x484 (Size: 0x4)
    TButtonPanel* text_buttons[3]; // +0x488 (Size: 0xC)
    unsigned char game_flag; // +0x494 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0495 (Gap: 3)
    TPicture* vc_back_bmp; // +0x498 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class TRIBE_Object_List : public RGE_Object_List {
public:
};

// Size: 0x3D4 (980 bytes)
class TRIBE_Panel_Button : public TButtonPanel {
public:
    int display_garrison; // +0x2B8 (Size: 0x4)
    int garrsion_number; // +0x2BC (Size: 0x4)
    unsigned char tribe_button_type; // +0x2C0 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x02c1 (Gap: 3)
    TShape* border_pic; // +0x2C4 (Size: 0x4)
    unsigned char* color_table; // +0x2C8 (Size: 0x4)
    int border_frame; // +0x2CC (Size: 0x4)
    char text_msg[256]; // +0x2D0 (Size: 0x100)
    int in_use; // +0x3D0 (Size: 0x4)
};

// Size: 0x118 (280 bytes)
class TRIBE_Panel_Inven : public TPanel {
public:
    TShape* pics; // +0xF4 (Size: 0x4)
    TRIBE_Player* player; // +0xF8 (Size: 0x4)
    short save_attr_num; // +0xFC (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x00fe (Gap: 2)
    short* save_attr; // +0x100 (Size: 0x4)
    unsigned long idle_time; // +0x104 (Size: 0x4)
    unsigned long idle_interval; // +0x108 (Size: 0x4)
    void* font; // +0x10C (Size: 0x4)
    unsigned long font_color; // +0x110 (Size: 0x4)
    unsigned long back_color; // +0x114 (Size: 0x4)
};

// Size: 0x214 (532 bytes)
class TRIBE_Panel_Object : public TPanel {
public:
    void* font; // +0xF4 (Size: 0x4)
    long font_wid; // +0xF8 (Size: 0x4)
    long font_hgt; // +0xFC (Size: 0x4)
    TShape* health_pic; // +0x100 (Size: 0x4)
    TShape* item_pic; // +0x104 (Size: 0x4)
    TShape* unit_pics; // +0x108 (Size: 0x4)
    TShape** bldg_pics; // +0x10C (Size: 0x4)
    TRIBE_Player* player; // +0x110 (Size: 0x4)
    RGE_Static_Object* game_obj; // +0x114 (Size: 0x4)
    unsigned long idle_time; // +0x118 (Size: 0x4)
    unsigned long idle_interval; // +0x11C (Size: 0x4)
    unsigned char mode; // +0x120 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0121 (Gap: 3)
    RGE_Master_Static_Object* save_obj_type; // +0x124 (Size: 0x4)
    RGE_Sprite* save_sprite; // +0x128 (Size: 0x4)
    short save_attr_type; // +0x12C (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x012e (Gap: 2)
    float save_attr_amount; // +0x130 (Size: 0x4)
    unsigned char save_object_state; // +0x134 (Size: 0x1)
    unsigned char _pad_2[0x3]; // 0x0135 (Gap: 3)
    float save_build_pts; // +0x138 (Size: 0x4)
    RGE_Object_Node* save_list; // +0x13C (Size: 0x4)
    short save_number_of_objects; // +0x140 (Size: 0x2)
    unsigned char save_can_debark; // +0x142 (Size: 0x1)
    unsigned char _pad_3[0x1]; // 0x0143 (Gap: 1)
    float save_world_x; // +0x144 (Size: 0x4)
    float save_world_y; // +0x148 (Size: 0x4)
    float save_hp; // +0x14C (Size: 0x4)
    short save_armor; // +0x150 (Size: 0x2)
    short save_pierce_armor; // +0x152 (Size: 0x2)
    short save_weapon; // +0x154 (Size: 0x2)
    unsigned char _pad_4[0x2]; // 0x0156 (Gap: 2)
    float save_weapon_range; // +0x158 (Size: 0x4)
    float save_speed_of_attack; // +0x15C (Size: 0x4)
    short save_work_type; // +0x160 (Size: 0x2)
    short save_work_target; // +0x162 (Size: 0x2)
    short save_progress; // +0x164 (Size: 0x2)
    char save_name[100]; // +0x166 (Size: 0x64)
    unsigned char save_facet; // +0x1CA (Size: 0x1)
    unsigned char _pad_5[0x1]; // 0x01cb (Gap: 1)
    float save_angle; // +0x1CC (Size: 0x4)
    float save_los; // +0x1D0 (Size: 0x4)
    int save_pop; // +0x1D4 (Size: 0x4)
    int save_max_pop; // +0x1D8 (Size: 0x4)
    unsigned char save_selected_group; // +0x1DC (Size: 0x1)
    unsigned char _pad_6[0x3]; // 0x01dd (Gap: 3)
    RGE_Player* save_owner; // +0x1E0 (Size: 0x4)
    int save_age; // +0x1E4 (Size: 0x4)
    unsigned char save_have_action; // +0x1E8 (Size: 0x1)
    unsigned char _pad_7[0x3]; // 0x01e9 (Gap: 3)
    int save_score[9]; // +0x1EC (Size: 0x24)
    int save_farm_amt; // +0x210 (Size: 0x4)
};

// Size: 0x164 (356 bytes)
class TRIBE_Panel_Pop : public TPanel {
public:
    void* font; // +0xF4 (Size: 0x4)
    unsigned long color1; // +0xF8 (Size: 0x4)
    unsigned long color2; // +0xFC (Size: 0x4)
    unsigned long color3; // +0x100 (Size: 0x4)
    int player_id; // +0x104 (Size: 0x4)
    TRIBE_World* world; // +0x108 (Size: 0x4)
    TRIBE_Player* player; // +0x10C (Size: 0x4)
    int pop; // +0x110 (Size: 0x4)
    int max_pop; // +0x114 (Size: 0x4)
    unsigned char mode; // +0x118 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0119 (Gap: 3)
    float timer; // +0x11C (Size: 0x4)
    void* image_clip_region; // +0x120 (Size: 0x4)
    TDrawArea* ImageBuffer; // +0x124 (Size: 0x4)
    tagRECT ImageRect; // +0x128 (Size: 0x10)
    tagRECT UsedImageRect; // +0x138 (Size: 0x10)
    tagRECT UsedScreenRect; // +0x148 (Size: 0x10)
    int ImageTextActive; // +0x158 (Size: 0x4)
    int LastIBWidth; // +0x15C (Size: 0x4)
    int LastIBHeight; // +0x160 (Size: 0x4)
};

// Size: 0x1C8 (456 bytes)
class TRIBE_Panel_Text_Line : public TPanel {
public:
    void* font; // +0xF4 (Size: 0x4)
    unsigned char text_type; // +0xF8 (Size: 0x1)
    char text[200]; // +0xF9 (Size: 0xC8)
    unsigned char _pad_0[0x3]; // 0x01c1 (Gap: 3)
    long id; // +0x1C4 (Size: 0x4)
};

// Size: 0x174 (372 bytes)
class TRIBE_Panel_Time : public TPanel {
public:
    void* font; // +0xF4 (Size: 0x4)
    unsigned long color1; // +0xF8 (Size: 0x4)
    unsigned long color2; // +0xFC (Size: 0x4)
    int clock_type; // +0x100 (Size: 0x4)
    int old_clock_type; // +0x104 (Size: 0x4)
    int clock_format; // +0x108 (Size: 0x4)
    int old_clock_format; // +0x10C (Size: 0x4)
    int player_id; // +0x110 (Size: 0x4)
    TRIBE_World* world; // +0x114 (Size: 0x4)
    TRIBE_Player* player; // +0x118 (Size: 0x4)
    unsigned long start_real_time; // +0x11C (Size: 0x4)
    unsigned long game_time; // +0x120 (Size: 0x4)
    unsigned long last_game_time; // +0x124 (Size: 0x4)
    unsigned long display_time; // +0x128 (Size: 0x4)
    unsigned long last_display_time; // +0x12C (Size: 0x4)
    void* image_clip_region; // +0x130 (Size: 0x4)
    TDrawArea* ImageBuffer; // +0x134 (Size: 0x4)
    tagRECT ImageRect; // +0x138 (Size: 0x10)
    tagRECT UsedImageRect; // +0x148 (Size: 0x10)
    tagRECT UsedScreenRect; // +0x158 (Size: 0x10)
    int ImageTextActive; // +0x168 (Size: 0x4)
    int LastIBWidth; // +0x16C (Size: 0x4)
    int LastIBHeight; // +0x170 (Size: 0x4)
};

// Size: 0x848 (2120 bytes)
class TRIBE_Player : public RGE_Player {
public:
    TRIBE_Player_Tech* tech_tree; // +0x220 (Size: 0x4)
    long fog_update; // +0x224 (Size: 0x4)
    long update_count; // +0x228 (Size: 0x4)
    long update_history_count; // +0x22C (Size: 0x4)
    long updateCountNeedHelp; // +0x230 (Size: 0x4)
    float update_time; // +0x234 (Size: 0x4)
    TribeMainDecisionAIModule* playerAI; // +0x238 (Size: 0x4)
    char aiStatusInformationValue[256]; // +0x23C (Size: 0x100)
    char aiStatusInformationValue2[256]; // +0x33C (Size: 0x100)
    char aiStatusInformationValue3[256]; // +0x43C (Size: 0x100)
    char aiStatusInformationValue4[256]; // +0x53C (Size: 0x100)
    char aiStatusInformationValue5[256]; // +0x63C (Size: 0x100)
    char aiStatusInformationValue6[256]; // +0x73C (Size: 0x100)
    TRIBE_History_Info* history; // +0x83C (Size: 0x4)
    float ruin_held_time; // +0x840 (Size: 0x4)
    float artifact_held_time; // +0x844 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class TRIBE_Player_Tech {
public:
    Tech_Player_Tree* tech_player_tree; // +0x0 (Size: 0x4)
    short tech_player_tree_num; // +0x4 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x0006 (Gap: 2)
    TRIBE_Tech* base_tech; // +0x8 (Size: 0x4)
    RGE_Player* owner; // +0xC (Size: 0x4)
};

// Size: 0x4F5C (20316 bytes)
class TRIBE_RMM_Database_Controller : public RGE_RMM_Database_Controller {
public:
};

// Size: 0x21C (540 bytes)
class TRIBE_Scenario_Editor_Panel_Object : public TRIBE_Panel_Object {
public:
    RGE_Master_Static_Object* master_game_obj; // +0x214 (Size: 0x4)
    int master_culture_id; // +0x218 (Size: 0x4)
};

// Size: 0x1C (28 bytes)
class TRIBE_Scenario_Header : public RGE_Scenario_Header {
public:
    int any_sp_victory; // +0x14 (Size: 0x4)
    int active_player_count; // +0x18 (Size: 0x4)
};

// Size: 0x4CC (1228 bytes)
class TRIBE_Screen_Campaign_Selection : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    long campaignListX; // +0x47C (Size: 0x4)
    long campaignListY; // +0x480 (Size: 0x4)
    long campaignListWidth; // +0x484 (Size: 0x4)
    long campaignListHeight; // +0x488 (Size: 0x4)
    TTextPanel* campaignTitle; // +0x48C (Size: 0x4)
    TListPanel* campaignList; // +0x490 (Size: 0x4)
    TScrollBarPanel* campaignScrollbar; // +0x494 (Size: 0x4)
    long scenarioListX; // +0x498 (Size: 0x4)
    long scenarioListY; // +0x49C (Size: 0x4)
    long scenarioListWidth; // +0x4A0 (Size: 0x4)
    long scenarioListHeight; // +0x4A4 (Size: 0x4)
    TTextPanel* scenarioTitle; // +0x4A8 (Size: 0x4)
    TListPanel* scenarioList; // +0x4AC (Size: 0x4)
    TScrollBarPanel* scenarioScrollbar; // +0x4B0 (Size: 0x4)
    TTextPanel* difficultyTitle; // +0x4B4 (Size: 0x4)
    TDropDownPanel* difficultyDrop; // +0x4B8 (Size: 0x4)
    TButtonPanel* okButton; // +0x4BC (Size: 0x4)
    TButtonPanel* cancelButton; // +0x4C0 (Size: 0x4)
    TButtonPanel* close_button; // +0x4C4 (Size: 0x4)
    int campaignsLoaded; // +0x4C8 (Size: 0x4)
};

// Size: 0x488 (1160 bytes)
class TRIBE_Screen_Disconnect : public TScreenPanel {
public:
    int mode; // +0x478 (Size: 0x4)
    TTextPanel* message; // +0x47C (Size: 0x4)
    TButtonPanel* cancel_button; // +0x480 (Size: 0x4)
    TButtonPanel* close_button; // +0x484 (Size: 0x4)
};

// Size: 0x7C4 (1988 bytes)
class TRIBE_Screen_Game : public TScreenPanel {
public:
    TShape* game_screen_pic; // +0x478 (Size: 0x4)
    TShape* button_border1_pic; // +0x47C (Size: 0x4)
    TShape* button_other_pic; // +0x480 (Size: 0x4)
    TShape* button_border2_pic; // +0x484 (Size: 0x4)
    TShape* button_border3_pic; // +0x488 (Size: 0x4)
    TShape* button_cmd_pic; // +0x48C (Size: 0x4)
    TShape* button_tech_pic; // +0x490 (Size: 0x4)
    TShape* button_unit_pic; // +0x494 (Size: 0x4)
    TShape* button_bldg_pics[5]; // +0x498 (Size: 0x14)
    TShape* more_cancel_pic; // +0x4AC (Size: 0x4)
    short more_frame; // +0x4B0 (Size: 0x2)
    short cancel_frame; // +0x4B2 (Size: 0x2)
    short unselect_frame; // +0x4B4 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x04b6 (Gap: 2)
    TRIBE_Main_View* main_view; // +0x4B8 (Size: 0x4)
    TRIBE_Diamond_Map_View* map_view; // +0x4BC (Size: 0x4)
    TRIBE_Panel_Inven* inven_panel; // +0x4C0 (Size: 0x4)
    TRIBE_Panel_Object* object_panel; // +0x4C4 (Size: 0x4)
    TRIBE_Panel_Button* button_panel[17]; // +0x4C8 (Size: 0x44)
    TMessagePanel* text_line_panel; // +0x50C (Size: 0x4)
    TTextPanel* quit_message_panel; // +0x510 (Size: 0x4)
    TRIBE_Panel_Time* time_panel; // +0x514 (Size: 0x4)
    TRIBE_Panel_Time* countdown_clock[10]; // +0x518 (Size: 0x28)
    TRIBE_Panel_Pop* pop_panel; // +0x540 (Size: 0x4)
    TMessagePanel* message_panel; // +0x544 (Size: 0x4)
    TMessagePanel* message_panel2; // +0x548 (Size: 0x4)
    TMessagePanel* message_panel3; // +0x54C (Size: 0x4)
    TMessagePanel* message_panel4; // +0x550 (Size: 0x4)
    TMessagePanel* message_panel5; // +0x554 (Size: 0x4)
    TMessagePanel* message_panel6; // +0x558 (Size: 0x4)
    TMessagePanel* chat_panel[8]; // +0x55C (Size: 0x20)
    RGE_Panel_Tool_Box* tool_box; // +0x57C (Size: 0x4)
    TTextPanel* age_panel; // +0x580 (Size: 0x4)
    TTextPanel* pause_text; // +0x584 (Size: 0x4)
    TTextPanel* fps_panel; // +0x588 (Size: 0x4)
    TMessagePanel* score_panel[8]; // +0x58C (Size: 0x20)
    TTextPanel* log_text; // +0x5AC (Size: 0x4)
    TScrollBarPanel* log_scrollbar; // +0x5B0 (Size: 0x4)
    TRIBE_World* world; // +0x5B4 (Size: 0x4)
    unsigned long update_interval; // +0x5B8 (Size: 0x4)
    unsigned long last_update_time; // +0x5BC (Size: 0x4)
    unsigned long map_redraw_interval; // +0x5C0 (Size: 0x4)
    unsigned long last_map_redraw_time; // +0x5C4 (Size: 0x4)
    RGE_Static_Object* game_obj; // +0x5C8 (Size: 0x4)
    short sel_count; // +0x5CC (Size: 0x2)
    unsigned char _pad_1[0x2]; // 0x05ce (Gap: 2)
    Item_Avail* tech_list; // +0x5D0 (Size: 0x4)
    Item_Avail* make_list; // +0x5D4 (Size: 0x4)
    Item_Avail* bldg_list; // +0x5D8 (Size: 0x4)
    Trade_Avail* trade_list; // +0x5DC (Size: 0x4)
    short item_cnt; // +0x5E0 (Size: 0x2)
    short start_item; // +0x5E2 (Size: 0x2)
    short last_item; // +0x5E4 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x05e6 (Gap: 2)
    TRIBE_Screen_Game::__unnamed port_info[9]; // +0x5E8 (Size: 0x90)
    unsigned long terrain_sound_interval; // +0x678 (Size: 0x4)
    unsigned long last_terrain_sound_time; // +0x67C (Size: 0x4)
    RGE_Sound* terrain_sound; // +0x680 (Size: 0x4)
    int terrain_playing; // +0x684 (Size: 0x4)
    unsigned long terrain_sound_start_time; // +0x688 (Size: 0x4)
    int anim_pal; // +0x68C (Size: 0x4)
    unsigned long anim_pal_interval; // +0x690 (Size: 0x4)
    unsigned long last_anim_pal_time; // +0x694 (Size: 0x4)
    short last_anim_pal_index; // +0x698 (Size: 0x2)
    short last_anim_pal_index2; // +0x69A (Size: 0x2)
    short last_anim_pal_index3; // +0x69C (Size: 0x2)
    TRIBE_Screen_Game::__unnamed anim_pal_table[7]; // +0x69E (Size: 0x15)
    TRIBE_Screen_Game::__unnamed anim_pal_table2[16]; // +0x6B3 (Size: 0x30)
    TRIBE_Screen_Game::__unnamed anim_pal_table3[12]; // +0x6E3 (Size: 0x24)
    unsigned char _pad_3[0x1]; // 0x0707 (Gap: 1)
    long mouse_last_x; // +0x708 (Size: 0x4)
    long mouse_last_y; // +0x70C (Size: 0x4)
    int save_age; // +0x710 (Size: 0x4)
    int save_culture; // +0x714 (Size: 0x4)
    long save_screen_width; // +0x718 (Size: 0x4)
    unsigned long game_over_time; // +0x71C (Size: 0x4)
    int showing_game_over; // +0x720 (Size: 0x4)
    int chat_line; // +0x724 (Size: 0x4)
    unsigned long view_interval; // +0x728 (Size: 0x4)
    unsigned long last_view_time; // +0x72C (Size: 0x4)
    int player_quit; // +0x730 (Size: 0x4)
    long cheat_code_entry; // +0x734 (Size: 0x4)
    char cheat_code_entry_str[52]; // +0x738 (Size: 0x34)
    long view_town_center_hotkey; // +0x76C (Size: 0x4)
    long work_hotkey; // +0x770 (Size: 0x4)
    long move_hotkey; // +0x774 (Size: 0x4)
    long attack_hotkey; // +0x778 (Size: 0x4)
    long ungroup_hotkey; // +0x77C (Size: 0x4)
    long watch_hotkey; // +0x780 (Size: 0x4)
    long select_building_hotkey[8]; // +0x784 (Size: 0x20)
    int reset_after_update; // +0x7A4 (Size: 0x4)
    unsigned long score_interval; // +0x7A8 (Size: 0x4)
    unsigned long last_score_time; // +0x7AC (Size: 0x4)
    int watch_mode; // +0x7B0 (Size: 0x4)
    int game_ended; // +0x7B4 (Size: 0x4)
    TDigital* game_over_sound; // +0x7B8 (Size: 0x4)
    unsigned long last_game_speed_change; // +0x7BC (Size: 0x4)
    unsigned long last_pause_change; // +0x7C0 (Size: 0x4)
};

// Size: 0x3 (3 bytes)
class TRIBE_Screen_Game::__unnamed {
public:
    unsigned char red; // +0x0 (Size: 0x1)
    unsigned char green; // +0x1 (Size: 0x1)
    unsigned char blue; // +0x2 (Size: 0x1)
};

// Size: 0x484 (1156 bytes)
class TRIBE_Screen_Info : public TScreenPanel {
public:
    int auto_close; // +0x478 (Size: 0x4)
    unsigned long timer; // +0x47C (Size: 0x4)
    unsigned long last_time; // +0x480 (Size: 0x4)
};

// Size: 0x484 (1156 bytes)
class TRIBE_Screen_Main_Error : public TScreenPanel {
public:
    TTextPanel* message; // +0x478 (Size: 0x4)
    TButtonPanel* cancel_button; // +0x47C (Size: 0x4)
    TButtonPanel* close_button; // +0x480 (Size: 0x4)
};

// Size: 0x4B0 (1200 bytes)
class TRIBE_Screen_Main_Menu : public TScreenPanel {
public:
    TTextPanel* title1; // +0x478 (Size: 0x4)
    TTextPanel* title2; // +0x47C (Size: 0x4)
    TButtonPanel* button[7]; // +0x480 (Size: 0x1C)
    TTextPanel* ms_title_text; // +0x49C (Size: 0x4)
    TTextPanel* ms_copy_text1; // +0x4A0 (Size: 0x4)
    TTextPanel* ms_copy_text2; // +0x4A4 (Size: 0x4)
    TTextPanel* warning_text; // +0x4A8 (Size: 0x4)
    TPicturePanel* circle_p_pic; // +0x4AC (Size: 0x4)
};

// Size: 0x4A0 (1184 bytes)
class TRIBE_Screen_Name : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    TTextPanel* name_text; // +0x47C (Size: 0x4)
    TListPanel* name_list; // +0x480 (Size: 0x4)
    TScrollBarPanel* name_scrollbar; // +0x484 (Size: 0x4)
    TButtonPanel* new_button; // +0x488 (Size: 0x4)
    TButtonPanel* remove_button; // +0x48C (Size: 0x4)
    TButtonPanel* ok_button; // +0x490 (Size: 0x4)
    TButtonPanel* cancel_button; // +0x494 (Size: 0x4)
    TButtonPanel* close_button; // +0x498 (Size: 0x4)
    int started_input; // +0x49C (Size: 0x4)
};

// Size: 0x948 (2376 bytes)
class TRIBE_Screen_Sed : public TScreenPanel {
public:
    int is_multi_player; // +0x478 (Size: 0x4)
    int set_player_first_flag; // +0x47C (Size: 0x4)
    RGE_Static_Object* SelectedObject; // +0x480 (Size: 0x4)
    RGE_Static_Object* DestinationObject; // +0x484 (Size: 0x4)
    float px1; // +0x488 (Size: 0x4)
    float py1; // +0x48C (Size: 0x4)
    float px2; // +0x490 (Size: 0x4)
    float py2; // +0x494 (Size: 0x4)
    int CurrentVictory; // +0x498 (Size: 0x4)
    int CurrentPlayer; // +0x49C (Size: 0x4)
    TRIBE_Screen_Sed::SELECT_REGION_e SelectRegionFlag; // +0x4A0 (Size: 0x4)
    TRIBE_Screen_Sed::ScenarioMode scenario_mode; // +0x4A4 (Size: 0x4)
    TRIBE_Screen_Sed::MapType map_type; // +0x4A8 (Size: 0x4)
    TRIBE_Screen_Sed::VictoryType mp_victory_type; // +0x4AC (Size: 0x4)
    TRIBE_Screen_Sed::BrushSize brush_size; // +0x4B0 (Size: 0x4)
    TRIBE_Screen_Sed::PaintType paint_type; // +0x4B4 (Size: 0x4)
    short player_num; // +0x4B8 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x04ba (Gap: 2)
    TRIBE_Screen_Sed::MessageType message_type; // +0x4BC (Size: 0x4)
    unsigned char need_to_save_flag; // +0x4C0 (Size: 0x1)
    unsigned char valid_save_spot_flag; // +0x4C1 (Size: 0x1)
    unsigned char _pad_1[0x2]; // 0x04c2 (Gap: 2)
    TShape* background_pic; // +0x4C4 (Size: 0x4)
    TRIBE_Main_View* main_view; // +0x4C8 (Size: 0x4)
    RGE_Diamond_Map_View* map_view; // +0x4CC (Size: 0x4)
    TMessagePanel* message_panel; // +0x4D0 (Size: 0x4)
    TPanel* bottom_panel; // +0x4D4 (Size: 0x4)
    TButtonPanel* scenario_mode_button[10]; // +0x4D8 (Size: 0x28)
    TButtonPanel* menu_button; // +0x500 (Size: 0x4)
    TButtonPanel* help_button; // +0x504 (Size: 0x4)
    TButtonPanel* map_type_button[3]; // +0x508 (Size: 0xC)
    TTextPanel* map_type_text[3]; // +0x514 (Size: 0xC)
    TTextPanel* map_type_label; // +0x520 (Size: 0x4)
    TTextPanel* default_terrain_label; // +0x524 (Size: 0x4)
    TDropDownPanel* default_terrain_drop; // +0x528 (Size: 0x4)
    TTextPanel* map_size_label; // +0x52C (Size: 0x4)
    TDropDownPanel* map_size_drop; // +0x530 (Size: 0x4)
    TTextPanel* map_style_label; // +0x534 (Size: 0x4)
    TDropDownPanel* map_style_drop; // +0x538 (Size: 0x4)
    TTextPanel* random_seed_label; // +0x53C (Size: 0x4)
    TEditPanel* random_seed_input; // +0x540 (Size: 0x4)
    TTextPanel* random_seed_used_label; // +0x544 (Size: 0x4)
    TTextPanel* random_seed_used_text; // +0x548 (Size: 0x4)
    TButtonPanel* generate_map_button; // +0x54C (Size: 0x4)
    TTextPanel* map_generating_text; // +0x550 (Size: 0x4)
    TTextPanel* brush_size_label; // +0x554 (Size: 0x4)
    TButtonPanel* brush_size_button[5]; // +0x558 (Size: 0x14)
    TTextPanel* brush_size_button_label[5]; // +0x56C (Size: 0x14)
    TTextPanel* paint_type_label; // +0x580 (Size: 0x4)
    TButtonPanel* paint_type_button[3]; // +0x584 (Size: 0xC)
    TTextPanel* paint_type_button_label[3]; // +0x590 (Size: 0xC)
    TTextPanel* paint_terrain_label; // +0x59C (Size: 0x4)
    TListPanel* paint_terrain_list; // +0x5A0 (Size: 0x4)
    TScrollBarPanel* paint_terrain_scrollbar; // +0x5A4 (Size: 0x4)
    TListPanel* paint_elevation_list; // +0x5A8 (Size: 0x4)
    TScrollBarPanel* paint_elevation_scrollbar; // +0x5AC (Size: 0x4)
    TTextPanel* player_label; // +0x5B0 (Size: 0x4)
    TDropDownPanel* player_list; // +0x5B4 (Size: 0x4)
    TDropDownPanel* player_number_list; // +0x5B8 (Size: 0x4)
    TDropDownPanel* player_advance_civilization_drop; // +0x5BC (Size: 0x4)
    TButtonPanel* player_advance_civilization_button; // +0x5C0 (Size: 0x4)
    TTextPanel* player_inven_label[5]; // +0x5C4 (Size: 0x14)
    TEditPanel* player_inven_input[5]; // +0x5D8 (Size: 0x14)
    TTextPanel* player_setting_label[2]; // +0x5EC (Size: 0x8)
    TTextPanel* player_starting_age_label; // +0x5F4 (Size: 0x4)
    TDropDownPanel* player_setting_drop[2]; // +0x5F8 (Size: 0x8)
    TDropDownPanel* BuildList; // +0x600 (Size: 0x4)
    TDropDownPanel* CityLayout; // +0x604 (Size: 0x4)
    TDropDownPanel* AiRules; // +0x608 (Size: 0x4)
    TTextPanel* player_build_text; // +0x60C (Size: 0x4)
    TTextPanel* player_city_text; // +0x610 (Size: 0x4)
    TTextPanel* AiRules_text; // +0x614 (Size: 0x4)
    TDropDownPanel* unit_player_list; // +0x618 (Size: 0x4)
    TButtonPanel* unit_mode_select[4]; // +0x61C (Size: 0x10)
    TTextPanel* unit_mode_select_label[4]; // +0x62C (Size: 0x10)
    TListPanel* unit_list; // +0x63C (Size: 0x4)
    TScrollBarPanel* unit_scrollbar; // +0x640 (Size: 0x4)
    TRIBE_Screen_Sed::List_Info* unit_list_info; // +0x644 (Size: 0x4)
    TShape* button_unit_pics; // +0x648 (Size: 0x4)
    TShape* button_bldg_pics[5]; // +0x64C (Size: 0x14)
    TRIBE_Scenario_Editor_Panel_Object* object_panel; // +0x660 (Size: 0x4)
    short unit_list_size; // +0x664 (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x0666 (Gap: 2)
    TButtonPanel* victory_cond_on[6]; // +0x668 (Size: 0x18)
    TButtonPanel* victory_and_or[2]; // +0x680 (Size: 0x8)
    TTextPanel* victory_condition_label; // +0x688 (Size: 0x4)
    TTextPanel* victory_amount_label; // +0x68C (Size: 0x4)
    TTextPanel* victory_long_label; // +0x690 (Size: 0x4)
    TTextPanel* victory_text_and_or[2]; // +0x694 (Size: 0x8)
    TTextPanel* victory_label_conquest; // +0x69C (Size: 0x4)
    TTextPanel* victory_label_explore; // +0x6A0 (Size: 0x4)
    TTextPanel* victory_label_explore_percent; // +0x6A4 (Size: 0x4)
    TTextPanel* victory_label_ruins; // +0x6A8 (Size: 0x4)
    TTextPanel* victory_label_artifacts; // +0x6AC (Size: 0x4)
    TTextPanel* victory_label_discoveries; // +0x6B0 (Size: 0x4)
    TTextPanel* victory_label_gold; // +0x6B4 (Size: 0x4)
    TEditPanel* victory_condition_explore; // +0x6B8 (Size: 0x4)
    TEditPanel* victory_condition_ruins; // +0x6BC (Size: 0x4)
    TEditPanel* victory_condition_artifacts; // +0x6C0 (Size: 0x4)
    TEditPanel* victory_condition_discoveries; // +0x6C4 (Size: 0x4)
    TEditPanel* victory_condition_gold; // +0x6C8 (Size: 0x4)
    TTextPanel* victory_cond_type_label[5]; // +0x6CC (Size: 0x14)
    TButtonPanel* victory_cond_type[5]; // +0x6E0 (Size: 0x14)
    TTextPanel* victory_score_label; // +0x6F4 (Size: 0x4)
    TDropDownPanel* victory_score; // +0x6F8 (Size: 0x4)
    TTextPanel* victory_time_label; // +0x6FC (Size: 0x4)
    TDropDownPanel* victory_time; // +0x700 (Size: 0x4)
    TButtonPanel* victory_button[12]; // +0x704 (Size: 0x30)
    TDropDownPanel* victory_drop_down; // +0x734 (Size: 0x4)
    TDropDownPanel* victory_object_list; // +0x738 (Size: 0x4)
    TDropDownPanel* victory_player_list; // +0x73C (Size: 0x4)
    TDropDownPanel* victory_enemy_player_list; // +0x740 (Size: 0x4)
    TDropDownPanel* victory_attribute_list; // +0x744 (Size: 0x4)
    TDropDownPanel* victory_ages_list; // +0x748 (Size: 0x4)
    TDropDownPanel* victory_tech_list; // +0x74C (Size: 0x4)
    TButtonPanel* victory_button_set_object; // +0x750 (Size: 0x4)
    TButtonPanel* victory_button_set_destination; // +0x754 (Size: 0x4)
    TButtonPanel* victory_button_go_to_dest; // +0x758 (Size: 0x4)
    TTextPanel* victory_condition_text; // +0x75C (Size: 0x4)
    TTextPanel* victory_condition_type; // +0x760 (Size: 0x4)
    TTextPanel* victory_amount_text; // +0x764 (Size: 0x4)
    TTextPanel* victory_which_enemy_text; // +0x768 (Size: 0x4)
    TEditPanel* victory_amount_input; // +0x76C (Size: 0x4)
    TScrollBarPanel* victory_object_scrollbar; // +0x770 (Size: 0x4)
    TEditPanel* message_input; // +0x774 (Size: 0x4)
    TButtonPanel* message_button[5]; // +0x778 (Size: 0x14)
    TTextPanel* message_button_label[5]; // +0x78C (Size: 0x14)
    long current_message; // +0x7A0 (Size: 0x4)
    TTextPanel* cinematic_label[4]; // +0x7A4 (Size: 0x10)
    TDropDownPanel* cinematic_input[4]; // +0x7B4 (Size: 0x10)
    TTextPanel* options_label[1]; // +0x7C4 (Size: 0x4)
    TButtonPanel* options_button[1]; // +0x7C8 (Size: 0x4)
    TDropDownPanel* options_player_list; // +0x7CC (Size: 0x4)
    TTextPanel* options_disable_tech_text; // +0x7D0 (Size: 0x4)
    TButtonPanel* options_disable_button[16]; // +0x7D4 (Size: 0x40)
    TTextPanel* options_disable_text[16]; // +0x814 (Size: 0x40)
    TTextPanel* Diplomacy_opponent_label[8]; // +0x854 (Size: 0x20)
    TTextPanel* Diplomacy_player_text[8]; // +0x874 (Size: 0x20)
    TDropDownPanel* Diplomacy_player_list; // +0x894 (Size: 0x4)
    TTextPanel* Diplomacy_status_label[4]; // +0x898 (Size: 0x10)
    TButtonPanel* Diplomacy_friend_box[8][3]; // +0x8A8 (Size: 0x60)
    TButtonPanel* Diplomacy_AlliedVictory[8]; // +0x908 (Size: 0x20)
    TRIBE_World* world; // +0x928 (Size: 0x4)
    unsigned long update_interval; // +0x92C (Size: 0x4)
    unsigned long last_update_time; // +0x930 (Size: 0x4)
    unsigned long map_redraw_interval; // +0x934 (Size: 0x4)
    unsigned long last_map_redraw_time; // +0x938 (Size: 0x4)
    int changed_system_colors; // +0x93C (Size: 0x4)
    unsigned long save_text_color; // +0x940 (Size: 0x4)
    unsigned long save_window_color; // +0x944 (Size: 0x4)
};

// Size: 0x66 (102 bytes)
class TRIBE_Screen_Sed::List_Info {
public:
    char text[100]; // +0x0 (Size: 0x64)
    short id; // +0x64 (Size: 0x2)
};

// Size: 0x490 (1168 bytes)
class TRIBE_Screen_Sed_Menu : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    TButtonPanel* button[4]; // +0x47C (Size: 0x10)
    TButtonPanel* close_button; // +0x48C (Size: 0x4)
};

// Size: 0x490 (1168 bytes)
class TRIBE_Screen_Sed_Open : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    TListPanel* list; // +0x47C (Size: 0x4)
    TScrollBarPanel* scrollbar; // +0x480 (Size: 0x4)
    TButtonPanel* okButton; // +0x484 (Size: 0x4)
    TButtonPanel* cancelButton; // +0x488 (Size: 0x4)
    TButtonPanel* deleteButton; // +0x48C (Size: 0x4)
};

// Size: 0x47C (1148 bytes)
class TRIBE_Screen_Status_Message : public TScreenPanel {
public:
    TTextPanel* message; // +0x478 (Size: 0x4)
};

// Size: 0x4D8 (1240 bytes)
class TRIBE_Screen_Wait : public TScreenPanel {
public:
    TTextPanel* message; // +0x478 (Size: 0x4)
    TButtonPanel* cancel_button; // +0x47C (Size: 0x4)
    TButtonPanel* close_button; // +0x480 (Size: 0x4)
    TTextPanel* scenarioName; // +0x484 (Size: 0x4)
    TTextPanel* settingText[20]; // +0x488 (Size: 0x50)
};

// Size: 0xC (12 bytes)
class TRIBE_Task_List : public RGE_Task_List {
public:
};

// Size: 0xC (12 bytes)
class TRIBE_Tech {
public:
    Tech_Tree* tech_tree; // +0x0 (Size: 0x4)
    short tech_tree_num; // +0x4 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x0006 (Gap: 2)
    TRIBE_World* world; // +0x8 (Size: 0x4)
};

// Size: 0x88 (136 bytes)
class TRIBE_Tree_Object : public RGE_Static_Object {
public:
};

// Size: 0x20 (32 bytes)
class TRIBE_Victory_Conditions : public RGE_Victory_Conditions {
public:
};

// Size: 0x124 (292 bytes)
class TRIBE_World : public RGE_Game_World {
public:
    TRIBE_Tech* tech; // +0x104 (Size: 0x4)
    int victory_type; // +0x108 (Size: 0x4)
    int artifact_count; // +0x10C (Size: 0x4)
    int ruin_count; // +0x110 (Size: 0x4)
    unsigned char countdown_victory; // +0x114 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0115 (Gap: 3)
    float countdown_clock; // +0x118 (Size: 0x4)
    unsigned char score_displayed; // +0x11C (Size: 0x1)
    unsigned char controllingComputerPlayer; // +0x11D (Size: 0x1)
    unsigned char _pad_1[0x2]; // 0x011e (Gap: 2)
    int sent_zone_score; // +0x120 (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class TRIBE_Zone_High_Score_Info {
public:
    long score; // +0x0 (Size: 0x4)
    unsigned char civ; // +0x4 (Size: 0x1)
    char player_name[16]; // +0x5 (Size: 0x10)
    unsigned char num_allies; // +0x15 (Size: 0x1)
    unsigned char _pad_end[0x2]; // 0x0016 (Gap: 2)
};

// Size: 0x1FC (508 bytes)
class TRIBE_Zone_Info {
public:
    unsigned char number_of_players; // +0x0 (Size: 0x1)
    unsigned char number_of_computer_players; // +0x1 (Size: 0x1)
    char scenario_name[32]; // +0x2 (Size: 0x20)
    unsigned char _pad_0[0x2]; // 0x0022 (Gap: 2)
    unsigned long game_time; // +0x24 (Size: 0x4)
    TRIBE_Zone_High_Score_Info total_score; // +0x28 (Size: 0x18)
    TRIBE_Zone_High_Score_Info religion_score; // +0x40 (Size: 0x18)
    TRIBE_Zone_High_Score_Info economy_score; // +0x58 (Size: 0x18)
    TRIBE_Zone_High_Score_Info combat_score; // +0x70 (Size: 0x18)
    TRIBE_Zone_High_Score_Info research_score; // +0x88 (Size: 0x18)
    TRIBE_Zone_Player_Info player_info[8]; // +0xA0 (Size: 0x140)
    TRIBE_Zone_Map_Info map_info; // +0x1E0 (Size: 0xC)
    unsigned char cheats_enabled; // +0x1EC (Size: 0x1)
    unsigned char game_end_condition_code; // +0x1ED (Size: 0x1)
    unsigned char _pad_1[0x2]; // 0x01ee (Gap: 2)
    unsigned long database_checksum; // +0x1F0 (Size: 0x4)
    unsigned long code_checksum; // +0x1F4 (Size: 0x4)
    unsigned long program_version; // +0x1F8 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class TRIBE_Zone_Map_Info {
public:
    unsigned char Map_Size; // +0x0 (Size: 0x1)
    unsigned char Map_Type; // +0x1 (Size: 0x1)
    short Pop_Limit; // +0x2 (Size: 0x2)
    unsigned char Victory_Condition; // +0x4 (Size: 0x1)
    unsigned char Start_Age; // +0x5 (Size: 0x1)
    unsigned char Resources; // +0x6 (Size: 0x1)
    unsigned char Full_Tech; // +0x7 (Size: 0x1)
    unsigned char Fixed_Pos; // +0x8 (Size: 0x1)
    unsigned char Reveal_Map; // +0x9 (Size: 0x1)
    unsigned char Death_Match; // +0xA (Size: 0x1)
    unsigned char _pad_end[0x1]; // 0x000b (Gap: 1)
};

// Size: 0x28 (40 bytes)
class TRIBE_Zone_Player_Info {
public:
    char name[16]; // +0x0 (Size: 0x10)
    long score; // +0x10 (Size: 0x4)
    unsigned char winner; // +0x14 (Size: 0x1)
    unsigned char civ_played; // +0x15 (Size: 0x1)
    unsigned char civ_random; // +0x16 (Size: 0x1)
    unsigned char player_no; // +0x17 (Size: 0x1)
    unsigned char team_no; // +0x18 (Size: 0x1)
    unsigned char game_outcome; // +0x19 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x001a (Gap: 2)
    long tool_time; // +0x1C (Size: 0x4)
    long bronze_time; // +0x20 (Size: 0x4)
    long iron_time; // +0x24 (Size: 0x4)
};

// Size: 0x11680 (71296 bytes)
class TRIGONOMETRY {
public:
    float sines[4096]; // +0x0 (Size: 0x4000)
    float cose[4096]; // +0x4000 (Size: 0x4000)
    float tane[4096]; // +0x8000 (Size: 0x4000)
    float atane[4096]; // +0xC000 (Size: 0x4000)
    float sine360[360]; // +0x10000 (Size: 0x5A0)
    float cose360[360]; // +0x105A0 (Size: 0x5A0)
    float tane360[360]; // +0x10B40 (Size: 0x5A0)
    float atane360[360]; // +0x110E0 (Size: 0x5A0)
};

// Size: 0x110 (272 bytes)
class TRegistry {
public:
    void* ghMachineKey; // +0x0 (Size: 0x4)
    void* ghUserKey; // +0x4 (Size: 0x4)
    void* ghMachineKeyRead; // +0x8 (Size: 0x4)
    unsigned long gdwDisp; // +0xC (Size: 0x4)
    char Data[255]; // +0x10 (Size: 0xFF)
    unsigned char _pad_end[0x1]; // 0x010f (Gap: 1)
};

// Size: 0x478 (1144 bytes)
class TScreenPanel : public TEasy_Panel {
public:
};

// Size: 0x1C4 (452 bytes)
class TScrollBarPanel : public TPanel {
public:
    TPanel* list_panel; // +0xF4 (Size: 0x4)
    long list_len; // +0xF8 (Size: 0x4)
    long one_step; // +0xFC (Size: 0x4)
    long page_step; // +0x100 (Size: 0x4)
    long list_num; // +0x104 (Size: 0x4)
    TShape* button_pics; // +0x108 (Size: 0x4)
    int back_frame; // +0x10C (Size: 0x4)
    int up_frame; // +0x110 (Size: 0x4)
    int down_frame; // +0x114 (Size: 0x4)
    int tab_frame; // +0x118 (Size: 0x4)
    long arrowSize; // +0x11C (Size: 0x4)
    long tabSize; // +0x120 (Size: 0x4)
    long tab_y; // +0x124 (Size: 0x4)
    long tab_min_y; // +0x128 (Size: 0x4)
    long tab_max_y; // +0x12C (Size: 0x4)
    long tab_mouse_y; // +0x130 (Size: 0x4)
    long tab_x; // +0x134 (Size: 0x4)
    long tab_min_x; // +0x138 (Size: 0x4)
    long tab_max_x; // +0x13C (Size: 0x4)
    long tab_mouse_x; // +0x140 (Size: 0x4)
    unsigned char item_down; // +0x144 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x0145 (Gap: 3)
    int item_is_down; // +0x148 (Size: 0x4)
    long item_x; // +0x14C (Size: 0x4)
    long item_y; // +0x150 (Size: 0x4)
    unsigned char item_mode; // +0x154 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0155 (Gap: 3)
    unsigned long item_last_time; // +0x158 (Size: 0x4)
    unsigned long item_hold_interval; // +0x15C (Size: 0x4)
    unsigned long item_down_interval; // +0x160 (Size: 0x4)
    tagRECT up_rect; // +0x164 (Size: 0x10)
    tagRECT down_rect; // +0x174 (Size: 0x10)
    tagRECT tab_rect; // +0x184 (Size: 0x10)
    tagRECT top_rect; // +0x194 (Size: 0x10)
    tagRECT bottom_rect; // +0x1A4 (Size: 0x10)
    TScrollBarPanel::Orientation orientationValue; // +0x1B4 (Size: 0x4)
    int bevel_type; // +0x1B8 (Size: 0x4)
    unsigned char bevel_color1; // +0x1BC (Size: 0x1)
    unsigned char bevel_color2; // +0x1BD (Size: 0x1)
    unsigned char bevel_color3; // +0x1BE (Size: 0x1)
    unsigned char bevel_color4; // +0x1BF (Size: 0x1)
    unsigned char bevel_color5; // +0x1C0 (Size: 0x1)
    unsigned char bevel_color6; // +0x1C1 (Size: 0x1)
    unsigned char _pad_end[0x2]; // 0x01c2 (Gap: 2)
};

// Size: 0x198 (408 bytes)
class TScrollTextPanel : public TTextPanel {
public:
    int scroll; // +0x188 (Size: 0x4)
    unsigned long last_time; // +0x18C (Size: 0x4)
    int speed; // +0x190 (Size: 0x4)
    int done; // +0x194 (Size: 0x4)
};

// Size: 0x20 (32 bytes)
class TShape {
public:
    unsigned char* shape; // +0x0 (Size: 0x4)
    int load_type; // +0x4 (Size: 0x4)
    int load_size; // +0x8 (Size: 0x4)
    Shape_Header* shape_header; // +0xC (Size: 0x4)
    Shape_File_Header* head; // +0x10 (Size: 0x4)
    Shape_Offsets* offsets; // +0x14 (Size: 0x4)
    SLhape_File_Header* FShape; // +0x18 (Size: 0x4)
    Shape_Info* shape_info; // +0x1C (Size: 0x4)
};

// Size: 0x69C (1692 bytes)
class TSound_Driver {
public:
    unsigned char ready; // +0x0 (Size: 0x1)
    unsigned char mute; // +0x1 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x0002 (Gap: 2)
    void* main_wnd; // +0x4 (Size: 0x4)
    IDirectSound* direct_sound; // +0x8 (Size: 0x4)
    IDirectSoundBuffer* primary_buffer; // +0xC (Size: 0x4)
    long dsrval; // +0x10 (Size: 0x4)
    long start_volume; // +0x14 (Size: 0x4)
    long volume; // +0x18 (Size: 0x4)
    char path[260]; // +0x1C (Size: 0x104)
    int mixer_open; // +0x120 (Size: 0x4)
    void* mixer_handle; // +0x124 (Size: 0x4)
    tagMIXERLINEA mixer_line_info; // +0x128 (Size: 0xA8)
    tagMIXERLINECONTROLSA mixer_line_controls; // +0x1D0 (Size: 0x18)
    tagMIXERCONTROLA mixer_volume_control; // +0x1E8 (Size: 0x94)
    tMIXERCONTROLDETAILS mixer_volume_details; // +0x27C (Size: 0x18)
    tMIXERCONTROLDETAILS_UNSIGNED mixer_volume_value; // +0x294 (Size: 0x4)
    TDigital* sound_play_list[256]; // +0x298 (Size: 0x400)
    int play_list_count; // +0x698 (Size: 0x4)
};

// Size: 0x68 (104 bytes)
class TSpan_List_Manager {
public:
    TSpan_Node_List VSList; // +0x0 (Size: 0x3C)
    VSpan_Node** Line_Head_Ptrs; // +0x3C (Size: 0x4)
    VSpan_Node** Line_Tail_Ptrs; // +0x40 (Size: 0x4)
    int* LeftMostPx; // +0x44 (Size: 0x4)
    int* RightMostPx; // +0x48 (Size: 0x4)
    int* Span_Count; // +0x4C (Size: 0x4)
    int Num_Lines; // +0x50 (Size: 0x4)
    int Num_Pixels; // +0x54 (Size: 0x4)
    int Min_Span_Px; // +0x58 (Size: 0x4)
    int Max_Span_Px; // +0x5C (Size: 0x4)
    int Min_Line; // +0x60 (Size: 0x4)
    int Max_Line; // +0x64 (Size: 0x4)
};

// Size: 0x3C (60 bytes)
class TSpan_Node_List {
public:
    VSpan_Node** Zone_Ptrs; // +0x0 (Size: 0x4)
    int* Zone_Size_Ptrs; // +0x4 (Size: 0x4)
    int Used_Zones; // +0x8 (Size: 0x4)
    int Max_Zones; // +0xC (Size: 0x4)
    VSpan_Node* Free_Head; // +0x10 (Size: 0x4)
    int Free_Pool_Zone; // +0x14 (Size: 0x4)
    int Free_Pool_Index; // +0x18 (Size: 0x4)
    int Total_Blocks; // +0x1C (Size: 0x4)
    int Free_Blocks; // +0x20 (Size: 0x4)
    int Default_Grow_Size; // +0x24 (Size: 0x4)
    int Element_Size; // +0x28 (Size: 0x4)
    int Alloc_Count; // +0x2C (Size: 0x4)
    int Dealloc_Count; // +0x30 (Size: 0x4)
    int NewZone_Count; // +0x34 (Size: 0x4)
    int Reset_Count; // +0x38 (Size: 0x4)
};

// Size: 0x198 (408 bytes)
class TTaunt {
public:
    TDigital* Audio[4]; // +0x0 (Size: 0x10)
    int LastAudioPlayed; // +0x10 (Size: 0x4)
    char TBuff[255]; // +0x14 (Size: 0xFF)
    char TauntDir[128]; // +0x113 (Size: 0x80)
    unsigned char _pad_0[0x1]; // 0x0193 (Gap: 1)
    int Mute; // +0x194 (Size: 0x4)
};

// Size: 0x188 (392 bytes)
class TTextPanel : public TPanel {
public:
    TTextPanel::TextNode* list; // +0xF4 (Size: 0x4)
    short num_lines; // +0xF8 (Size: 0x2)
    short draw_lines; // +0xFA (Size: 0x2)
    short top_line; // +0xFC (Size: 0x2)
    short bot_line; // +0xFE (Size: 0x2)
    short cur_line; // +0x100 (Size: 0x2)
    short cur_col; // +0x102 (Size: 0x2)
    void* font; // +0x104 (Size: 0x4)
    long font_wid; // +0x108 (Size: 0x4)
    long font_hgt; // +0x10C (Size: 0x4)
    TTextPanel::Alignment vert_align; // +0x110 (Size: 0x4)
    TTextPanel::Alignment horz_align; // +0x114 (Size: 0x4)
    int word_wrap; // +0x118 (Size: 0x4)
    TTextPanel::Style text_style; // +0x11C (Size: 0x4)
    unsigned long text_color1; // +0x120 (Size: 0x4)
    unsigned long text_color2; // +0x124 (Size: 0x4)
    unsigned long highlightTextColor1; // +0x128 (Size: 0x4)
    unsigned long highlightTextColor2; // +0x12C (Size: 0x4)
    TScrollBarPanel* scbar_panel; // +0x130 (Size: 0x4)
    int auto_scbar; // +0x134 (Size: 0x4)
    short fixed_len; // +0x138 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x013a (Gap: 2)
    long text_wid; // +0x13C (Size: 0x4)
    long text_hgt; // +0x140 (Size: 0x4)
    TShape* back_pic; // +0x144 (Size: 0x4)
    short back_pic_wid; // +0x148 (Size: 0x2)
    short back_pic_hgt; // +0x14A (Size: 0x2)
    int fill_back; // +0x14C (Size: 0x4)
    unsigned char back_color; // +0x150 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x0151 (Gap: 3)
    int outline; // +0x154 (Size: 0x4)
    unsigned char outline_color; // +0x158 (Size: 0x1)
    unsigned char _pad_2[0x3]; // 0x0159 (Gap: 3)
    int sorted; // +0x15C (Size: 0x4)
    long second_column_pos; // +0x160 (Size: 0x4)
    long full_width; // +0x164 (Size: 0x4)
    long scbar_width; // +0x168 (Size: 0x4)
    int scbar_active; // +0x16C (Size: 0x4)
    int bevel_type; // +0x170 (Size: 0x4)
    unsigned char bevel_color1; // +0x174 (Size: 0x1)
    unsigned char bevel_color2; // +0x175 (Size: 0x1)
    unsigned char bevel_color3; // +0x176 (Size: 0x1)
    unsigned char bevel_color4; // +0x177 (Size: 0x1)
    unsigned char bevel_color5; // +0x178 (Size: 0x1)
    unsigned char bevel_color6; // +0x179 (Size: 0x1)
    unsigned char _pad_3[0x2]; // 0x017a (Gap: 2)
    void* clip_rgn2; // +0x17C (Size: 0x4)
    int border_size; // +0x180 (Size: 0x4)
    int spacer_size; // +0x184 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class TTextPanel::TextNode {
public:
    char* text; // +0x0 (Size: 0x4)
    char* text2; // +0x4 (Size: 0x4)
    long id; // +0x8 (Size: 0x4)
    TTextPanel::TextNode* next_node; // +0xC (Size: 0x4)
};

// Size: 0x1CC (460 bytes)
class TVerticalSliderPanel : public TScrollBarPanel {
public:
    int drawBox; // +0x1C4 (Size: 0x4)
    int spineWidth; // +0x1C8 (Size: 0x4)
};

// Size: 0x514C (20812 bytes)
class T_Scenario : public RGE_Scenario {
public:
    Player_Start_Info player_info[16]; // +0x1990 (Size: 0x100)
    Victory_StartInfo victory; // +0x1A90 (Size: 0x18)
    SP_Victory_Info sp_victory[16][12]; // +0x1AA8 (Size: 0x2D00)
    Friendliness Opponent[16]; // +0x47A8 (Size: 0x400)
    int AlliedVictory[16]; // +0x4BA8 (Size: 0x40)
    int victory_all_flag; // +0x4BE8 (Size: 0x4)
    int is_multi_player_flag; // +0x4BEC (Size: 0x4)
    int which_player; // +0x4BF0 (Size: 0x4)
    int DisabledTechnology[16][20]; // +0x4BF4 (Size: 0x500)
    int ScenarioOptions[3]; // +0x50F4 (Size: 0xC)
    int PlayerAge[16]; // +0x5100 (Size: 0x40)
    int mp_victory_type; // +0x5140 (Size: 0x4)
    int victory_score; // +0x5144 (Size: 0x4)
    int victory_time; // +0x5148 (Size: 0x4)
};

// Size: 0x330 (816 bytes)
class TacticalAIGroup {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    TacticalAIGroup* next; // +0x4 (Size: 0x4)
    TacticalAIGroup* prev; // +0x8 (Size: 0x4)
    int idValue; // +0xC (Size: 0x4)
    int inUseValue; // +0x10 (Size: 0x4)
    int typeValue; // +0x14 (Size: 0x4)
    int subTypeValue; // +0x18 (Size: 0x4)
    int unitsValue[40]; // +0x1C (Size: 0xA0)
    int unitsOriginalHitPointsValue[40]; // +0xBC (Size: 0xA0)
    int numberUnitsValue; // +0x15C (Size: 0x4)
    int desiredNumberUnitsValue; // +0x160 (Size: 0x4)
    int commanderValue; // +0x164 (Size: 0x4)
    int originalHitPointsValue; // +0x168 (Size: 0x4)
    int originalUnitNumberValue; // +0x16C (Size: 0x4)
    Waypoint locationValue; // +0x170 (Size: 0x10)
    int actionValue; // +0x180 (Size: 0x4)
    int targetValue; // +0x184 (Size: 0x4)
    int targetTypeValue; // +0x188 (Size: 0x4)
    Waypoint targetLocationValue; // +0x18C (Size: 0x10)
    Waypoint gatherLocationValue; // +0x19C (Size: 0x10)
    Waypoint retreatLocationValue; // +0x1AC (Size: 0x10)
    int priorityValue; // +0x1BC (Size: 0x4)
    int waitCodeValue; // +0x1C0 (Size: 0x4)
    int assistGroupIDValue; // +0x1C4 (Size: 0x4)
    int assistGroupTypeValue; // +0x1C8 (Size: 0x4)
    unsigned long consecutiveIdleUnitCountValue; // +0x1CC (Size: 0x4)
    int playNumberValue; // +0x1D0 (Size: 0x4)
    unsigned char numberAttackWaypointsValue; // +0x1D4 (Size: 0x1)
    unsigned char currentAttackWaypointValue; // +0x1D5 (Size: 0x1)
    unsigned char _pad_0[0x2]; // 0x01d6 (Gap: 2)
    Waypoint attackWaypoints[15]; // +0x1D8 (Size: 0xF0)
    unsigned char consecutiveGatherAttemptsValue; // +0x2C8 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x02c9 (Gap: 3)
    int numberObjectsToDestroyValue; // +0x2CC (Size: 0x4)
    int objectsToDestroyValue[20]; // +0x2D0 (Size: 0x50)
    int objectsToDestroyOwnerValue; // +0x320 (Size: 0x4)
    int objectsToDestroyCommanderZoneValue; // +0x324 (Size: 0x4)
    unsigned long lastAttackRoundupTime; // +0x328 (Size: 0x4)
    unsigned long lastAddedUnitTimeValue; // +0x32C (Size: 0x4)
};

// Size: 0xF0 (240 bytes)
class TacticalAIModule : public AIModule {
public:
};

// Size: 0x8 (8 bytes)
class Tech_Player_Tree {
public:
    float research_done; // +0x0 (Size: 0x4)
    short state; // +0x4 (Size: 0x2)
    unsigned char _pad_end[0x2]; // 0x0006 (Gap: 2)
};

// Size: 0x3C (60 bytes)
class Tech_Tree {
public:
    char* name; // +0x0 (Size: 0x4)
    short pre_reqs[4]; // +0x4 (Size: 0x8)
    short pre_reqs_required; // +0xC (Size: 0x2)
    short attribute[3]; // +0xE (Size: 0x6)
    short attribute_cost[3]; // +0x14 (Size: 0x6)
    unsigned char attribute_used[3]; // +0x1A (Size: 0x3)
    unsigned char _pad_0[0x1]; // 0x001d (Gap: 1)
    short research; // +0x1E (Size: 0x2)
    short effect; // +0x20 (Size: 0x2)
    short track; // +0x22 (Size: 0x2)
    short icon; // +0x24 (Size: 0x2)
    unsigned char button_location; // +0x26 (Size: 0x1)
    unsigned char _pad_1[0x1]; // 0x0027 (Gap: 1)
    short build_obj_id; // +0x28 (Size: 0x2)
    short string_id; // +0x2A (Size: 0x2)
    short string_id2; // +0x2C (Size: 0x2)
    unsigned char _pad_2[0x2]; // 0x002e (Gap: 2)
    long help_string_id; // +0x30 (Size: 0x4)
    long help_page_id; // +0x34 (Size: 0x4)
    long hotkey_id; // +0x38 (Size: 0x4)
};

// Size: 0x54 (84 bytes)
class TechnologyItem {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    TechnologyItem* next; // +0x4 (Size: 0x4)
    TechnologyItem* prev; // +0x8 (Size: 0x4)
    int idValue; // +0xC (Size: 0x4)
    char nameValue[64]; // +0x10 (Size: 0x40)
    ResourceItem* resourceCostValue; // +0x50 (Size: 0x4)
};

// Size: 0x4 (4 bytes)
class Tile_BlackEdge_Table {
public:
    VSpanMiniList* black_UNdraw; // +0x0 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class Tile_FogEdge_Table {
public:
    VSpanMiniList* normal_draw; // +0x0 (Size: 0x4)
    VSpanMiniList* fog_draw; // +0x4 (Size: 0x4)
};

// Size: 0x52C (1324 bytes)
class Time_Line_Panel : public TEasy_Panel {
public:
    void* axis_font; // +0x478 (Size: 0x4)
    long axis_font_wid; // +0x47C (Size: 0x4)
    long axis_font_hgt; // +0x480 (Size: 0x4)
    void* body_font; // +0x484 (Size: 0x4)
    long body_font_wid; // +0x488 (Size: 0x4)
    long body_font_hgt; // +0x48C (Size: 0x4)
    Time_Line_Panel::Style text_style; // +0x490 (Size: 0x4)
    unsigned long text_color1; // +0x494 (Size: 0x4)
    unsigned long text_color2; // +0x498 (Size: 0x4)
    unsigned long highlightTextColor1; // +0x49C (Size: 0x4)
    unsigned long highlightTextColor2; // +0x4A0 (Size: 0x4)
    long text_wid; // +0x4A4 (Size: 0x4)
    long text_hgt; // +0x4A8 (Size: 0x4)
    TShape* background_pic; // +0x4AC (Size: 0x4)
    short background_pic_wid; // +0x4B0 (Size: 0x2)
    short background_pic_hgt; // +0x4B2 (Size: 0x2)
    int fill_back; // +0x4B4 (Size: 0x4)
    unsigned char back_color; // +0x4B8 (Size: 0x1)
    unsigned char _pad_0[0x3]; // 0x04b9 (Gap: 3)
    int outline; // +0x4BC (Size: 0x4)
    unsigned char outline_color; // +0x4C0 (Size: 0x1)
    unsigned char _pad_1[0x3]; // 0x04c1 (Gap: 3)
    int sorted; // +0x4C4 (Size: 0x4)
    int bevel_type; // +0x4C8 (Size: 0x4)
    unsigned char bevel_color1; // +0x4CC (Size: 0x1)
    unsigned char bevel_color2; // +0x4CD (Size: 0x1)
    unsigned char bevel_color3; // +0x4CE (Size: 0x1)
    unsigned char bevel_color4; // +0x4CF (Size: 0x1)
    unsigned char bevel_color5; // +0x4D0 (Size: 0x1)
    unsigned char bevel_color6; // +0x4D1 (Size: 0x1)
    unsigned char _pad_2[0x2]; // 0x04d2 (Gap: 2)
    TShape* special_events_pic; // +0x4D4 (Size: 0x4)
    short special_events_pic_wid; // +0x4D8 (Size: 0x2)
    short special_events_pic_hgt; // +0x4DA (Size: 0x2)
    long X_start_line_pos; // +0x4DC (Size: 0x4)
    long Y_start_line_pos; // +0x4E0 (Size: 0x4)
    long X_line_pos; // +0x4E4 (Size: 0x4)
    long Y_line_pos; // +0x4E8 (Size: 0x4)
    long X_line_max_width; // +0x4EC (Size: 0x4)
    long Y_line_max_length; // +0x4F0 (Size: 0x4)
    long X_axis_length; // +0x4F4 (Size: 0x4)
    long Y_axis_length; // +0x4F8 (Size: 0x4)
    float bar_thickness; // +0x4FC (Size: 0x4)
    long pop_reading_rate; // +0x500 (Size: 0x4)
    float time_slice_drop_rate; // +0x504 (Size: 0x4)
    long total_slices_to_drop; // +0x508 (Size: 0x4)
    unsigned char drop_flag; // +0x50C (Size: 0x1)
    unsigned char _pad_3[0x3]; // 0x050d (Gap: 3)
    long num_entries_page; // +0x510 (Size: 0x4)
    long num_history_entries; // +0x514 (Size: 0x4)
    Special_Events* time_slice_events; // +0x518 (Size: 0x4)
    unsigned char timeline_flag; // +0x51C (Size: 0x1)
    unsigned char _pad_4[0x3]; // 0x051d (Gap: 3)
    TTextPanel* legend_entry_text[3]; // +0x520 (Size: 0xC)
};

// Size: 0xF4 (244 bytes)
class TradeAIModule : public AIModule {
public:
    MainDecisionAIModule* md; // +0xF0 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class Trade_Avail {
public:
    RGE_Player* player; // +0x0 (Size: 0x4)
    RGE_Static_Object* dock; // +0x4 (Size: 0x4)
    float inventory; // +0x8 (Size: 0x4)
};

// Size: 0x50 (80 bytes)
class TribeAIPlayBook : public AIPlayBook {
public:
};

// Size: 0x4C4 (1220 bytes)
class TribeAboutDialog : public TDialogPanel {
public:
    TTextPanel* title_text; // +0x490 (Size: 0x4)
    TTextPanel* version_text; // +0x494 (Size: 0x4)
    TTextPanel* ms_copy_text1; // +0x498 (Size: 0x4)
    TTextPanel* ms_copy_text2; // +0x49C (Size: 0x4)
    TTextPanel* ens_copy_text; // +0x4A0 (Size: 0x4)
    TTextPanel* genie_copy_text; // +0x4A4 (Size: 0x4)
    TTextPanel* pid_label_text; // +0x4A8 (Size: 0x4)
    TTextPanel* pid_text; // +0x4AC (Size: 0x4)
    TTextPanel* warning_text; // +0x4B0 (Size: 0x4)
    TTextPanel* background; // +0x4B4 (Size: 0x4)
    TButtonPanel* credits_button; // +0x4B8 (Size: 0x4)
    TButtonPanel* close_button; // +0x4BC (Size: 0x4)
    TPicturePanel* circle_p_pic; // +0x4C0 (Size: 0x4)
};

// Size: 0x5F8 (1528 bytes)
class TribeAchievementsScreen : public TScreenPanel {
public:
    int end_game_flag; // +0x478 (Size: 0x4)
    int current_mode; // +0x47C (Size: 0x4)
    int size; // +0x480 (Size: 0x4)
    TTextPanel* title; // +0x484 (Size: 0x4)
    TTextPanel* summary_text; // +0x488 (Size: 0x4)
    TTextPanel* instruction; // +0x48C (Size: 0x4)
    TTextPanel* win_loss_text; // +0x490 (Size: 0x4)
    TTextPanel* time; // +0x494 (Size: 0x4)
    TTextPanel* title_bar[7]; // +0x498 (Size: 0x1C)
    TTextPanel* achievement_choice[5]; // +0x4B4 (Size: 0x14)
    TTextPanel* statistics[8][7]; // +0x4C8 (Size: 0xE0)
    TTextPanel* player_names[8]; // +0x5A8 (Size: 0x20)
    TScrollBarPanel* summary_text_bar; // +0x5C8 (Size: 0x4)
    TScrollBarPanel* instruction_bar; // +0x5CC (Size: 0x4)
    TScrollBarPanel* win_loss_text_bar; // +0x5D0 (Size: 0x4)
    TButtonPanel* okButton; // +0x5D4 (Size: 0x4)
    TButtonPanel* backButton; // +0x5D8 (Size: 0x4)
    TButtonPanel* backButton2; // +0x5DC (Size: 0x4)
    TButtonPanel* timelineButton; // +0x5E0 (Size: 0x4)
    TButtonPanel* aftermathButton; // +0x5E4 (Size: 0x4)
    TButtonPanel* restartButton; // +0x5E8 (Size: 0x4)
    TButtonPanel* close_button; // +0x5EC (Size: 0x4)
    TShape* win_decal; // +0x5F0 (Size: 0x4)
    Time_Line_Panel* time_line; // +0x5F4 (Size: 0x4)
};

// Size: 0x134 (308 bytes)
class TribeArtifactUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x5C0 (1472 bytes)
class TribeBuildAIModule : public BuildAIModule {
public:
    TribeMainDecisionAIModule* md; // +0x5BC (Size: 0x4)
};

// Size: 0x134 (308 bytes)
class TribeBuildingUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x134 (308 bytes)
class TribeCivilianUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x564 (1380 bytes)
class TribeConfigDialog : public TDialogPanel {
public:
    TribeConfigDialog::Mode modeValue; // +0x490 (Size: 0x4)
    TTextPanel* title; // +0x494 (Size: 0x4)
    TTextPanel* speedTitle[4]; // +0x498 (Size: 0x10)
    TButtonPanel* speedButton[3]; // +0x4A8 (Size: 0xC)
    TTextPanel* musicTitle[3]; // +0x4B4 (Size: 0xC)
    TVerticalSliderPanel* musicSlider; // +0x4C0 (Size: 0x4)
    TTextPanel* soundTitle[3]; // +0x4C4 (Size: 0xC)
    TVerticalSliderPanel* soundSlider; // +0x4D0 (Size: 0x4)
    TTextPanel* scrollSpeedTitle[3]; // +0x4D4 (Size: 0xC)
    TVerticalSliderPanel* scrollSpeedSlider; // +0x4E0 (Size: 0x4)
    TTextPanel* sizeTitle[4]; // +0x4E4 (Size: 0x10)
    TButtonPanel* sizeButton[3]; // +0x4F4 (Size: 0xC)
    TTextPanel* mouseTitle[3]; // +0x500 (Size: 0xC)
    TButtonPanel* mouseButton[2]; // +0x50C (Size: 0x8)
    TTextPanel* rolloverTitle[3]; // +0x514 (Size: 0xC)
    TButtonPanel* rolloverButton[2]; // +0x520 (Size: 0x8)
    TTextPanel* pathFindingTitle[4]; // +0x528 (Size: 0x10)
    TButtonPanel* pathFindingButton[3]; // +0x538 (Size: 0xC)
    TButtonPanel* okButton; // +0x544 (Size: 0x4)
    TButtonPanel* cancelButton; // +0x548 (Size: 0x4)
    long musicVolume; // +0x54C (Size: 0x4)
    long soundVolume; // +0x550 (Size: 0x4)
    float gameSpeed; // +0x554 (Size: 0x4)
    long scrollSpeed; // +0x558 (Size: 0x4)
    long newMusicVolume; // +0x55C (Size: 0x4)
    long newSoundVolume; // +0x560 (Size: 0x4)
};

// Size: 0x318 (792 bytes)
class TribeConstructionAIModule : public ConstructionAIModule {
public:
    TribeMainDecisionAIModule* md; // +0x314 (Size: 0x4)
};

// Size: 0x6B8 (1720 bytes)
class TribeDiplomacyDialog : public TDialogPanel {
public:
    TTextPanel* title[8]; // +0x490 (Size: 0x20)
    TTextPanel* playerName[8]; // +0x4B0 (Size: 0x20)
    TTextPanel* playerVictoryScores[8]; // +0x4D0 (Size: 0x20)
    TTextPanel* playerCivilization[8]; // +0x4F0 (Size: 0x20)
    TTextPanel* needMarket; // +0x510 (Size: 0x4)
    TButtonPanel* goldTributeButton[8]; // +0x514 (Size: 0x20)
    TButtonPanel* woodTributeButton[8]; // +0x534 (Size: 0x20)
    TButtonPanel* foodTributeButton[8]; // +0x554 (Size: 0x20)
    TButtonPanel* stoneTributeButton[8]; // +0x574 (Size: 0x20)
    TButtonPanel* allyButton[24]; // +0x594 (Size: 0x60)
    TButtonPanel* allianceButton; // +0x5F4 (Size: 0x4)
    TButtonPanel* okButton; // +0x5F8 (Size: 0x4)
    TButtonPanel* clearButton; // +0x5FC (Size: 0x4)
    TButtonPanel* cancelButton; // +0x600 (Size: 0x4)
    TButtonPanel* help_button; // +0x604 (Size: 0x4)
    TShape* buttonPics; // +0x608 (Size: 0x4)
    TShape* backgroundPics; // +0x60C (Size: 0x4)
    float foodTotal; // +0x610 (Size: 0x4)
    float woodTotal; // +0x614 (Size: 0x4)
    float goldTotal; // +0x618 (Size: 0x4)
    float stoneTotal; // +0x61C (Size: 0x4)
    TTextPanel* playerFood; // +0x620 (Size: 0x4)
    TTextPanel* playerGold; // +0x624 (Size: 0x4)
    TTextPanel* playerWood; // +0x628 (Size: 0x4)
    TTextPanel* playerStone; // +0x62C (Size: 0x4)
    float goldTributeAmount[8]; // +0x630 (Size: 0x20)
    float foodTributeAmount[8]; // +0x650 (Size: 0x20)
    float stoneTributeAmount[8]; // +0x670 (Size: 0x20)
    float woodTributeAmount[8]; // +0x690 (Size: 0x20)
    int cur_player_row; // +0x6B0 (Size: 0x4)
    int tribute_flag; // +0x6B4 (Size: 0x4)
};

// Size: 0x134 (308 bytes)
class TribeElephantUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x488 (1160 bytes)
class TribeEndScreen : public TScreenPanel {
public:
    TPicturePanel* background; // +0x478 (Size: 0x4)
    TTextPanel* title; // +0x47C (Size: 0x4)
    TTextPanel* text; // +0x480 (Size: 0x4)
    TButtonPanel* okButton; // +0x484 (Size: 0x4)
};

// Size: 0x134 (308 bytes)
class TribeFishingShipUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x560 (1376 bytes)
class TribeGameSettingsScreen : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    TribeGameSettingsScreen::State state; // +0x47C (Size: 0x4)
    TTextPanel* mapSizeLabel; // +0x480 (Size: 0x4)
    TDropDownPanel* mapSizeDrop; // +0x484 (Size: 0x4)
    TTextPanel* mapTypeLabel; // +0x488 (Size: 0x4)
    TDropDownPanel* mapTypeDrop; // +0x48C (Size: 0x4)
    TTextPanel* victoryTypeLabel; // +0x490 (Size: 0x4)
    TDropDownPanel* victoryTypeDrop; // +0x494 (Size: 0x4)
    TTextPanel* victoryFixedText; // +0x498 (Size: 0x4)
    TTextPanel* percentLabel; // +0x49C (Size: 0x4)
    TTextPanel* scoreLabel; // +0x4A0 (Size: 0x4)
    TDropDownPanel* scoreDrop; // +0x4A4 (Size: 0x4)
    TTextPanel* timeLabel; // +0x4A8 (Size: 0x4)
    TDropDownPanel* timeDrop; // +0x4AC (Size: 0x4)
    TTextPanel* difficultyLabel; // +0x4B0 (Size: 0x4)
    TDropDownPanel* difficultyDrop; // +0x4B4 (Size: 0x4)
    TTextPanel* ageLabel; // +0x4B8 (Size: 0x4)
    TDropDownPanel* ageDrop; // +0x4BC (Size: 0x4)
    TTextPanel* resourcesLabel; // +0x4C0 (Size: 0x4)
    TDropDownPanel* resourcesDrop; // +0x4C4 (Size: 0x4)
    TTextPanel* pathingLabel; // +0x4C8 (Size: 0x4)
    TDropDownPanel* pathingDrop; // +0x4CC (Size: 0x4)
    TTextPanel* limitLabel; // +0x4D0 (Size: 0x4)
    TDropDownPanel* limitDrop; // +0x4D4 (Size: 0x4)
    TTextPanel* scenarioTitle; // +0x4D8 (Size: 0x4)
    TTextPanel* scenarioPlayersTitle; // +0x4DC (Size: 0x4)
    long scenarioListX; // +0x4E0 (Size: 0x4)
    long scenarioListY; // +0x4E4 (Size: 0x4)
    long scenarioListWidth; // +0x4E8 (Size: 0x4)
    long scenarioListHeight; // +0x4EC (Size: 0x4)
    TListPanel* scenarioList; // +0x4F0 (Size: 0x4)
    TScrollBarPanel* scenarioScrollbar; // +0x4F4 (Size: 0x4)
    int scenarioCount; // +0x4F8 (Size: 0x4)
    char** scenarioMission; // +0x4FC (Size: 0x4)
    int* scenarioFixed; // +0x500 (Size: 0x4)
    int scenariosLoaded; // +0x504 (Size: 0x4)
    TTextPanel* missionTitle; // +0x508 (Size: 0x4)
    long missionTextX; // +0x50C (Size: 0x4)
    long missionTextY; // +0x510 (Size: 0x4)
    long missionTextWidth; // +0x514 (Size: 0x4)
    long missionTextHeight; // +0x518 (Size: 0x4)
    TTextPanel* missionText; // +0x51C (Size: 0x4)
    TScrollBarPanel* missionScrollbar; // +0x520 (Size: 0x4)
    TButtonPanel* optionButton[4]; // +0x524 (Size: 0x10)
    TTextPanel* optionText[4]; // +0x534 (Size: 0x10)
    TButtonPanel* okButton; // +0x544 (Size: 0x4)
    TButtonPanel* cancelButton; // +0x548 (Size: 0x4)
    TButtonPanel* help_button; // +0x54C (Size: 0x4)
    TribeMPSetupScreen* chat_scr; // +0x550 (Size: 0x4)
    int last_scenario_line; // +0x554 (Size: 0x4)
    int scenario_line_offset; // +0x558 (Size: 0x4)
    unsigned long last_send_shared; // +0x55C (Size: 0x4)
};

// Size: 0x134 (308 bytes)
class TribeHuntedAnimalUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x10090 (65680 bytes)
class TribeInformationAIModule : public InformationAIModule {
public:
    ManagedArray<int> farmsTaskedThisUpdate; // +0xF0 (Size: 0x10)
    TribeMainDecisionAIModule* md; // +0x100 (Size: 0x4)
    int mapXSizeValue; // +0x104 (Size: 0x4)
    int mapYSizeValue; // +0x108 (Size: 0x4)
    int lastUpdateRowValue; // +0x10C (Size: 0x4)
    int maxImportantObjectMemory; // +0x110 (Size: 0x4)
    ObjectMemory* importantObjectMemory; // +0x114 (Size: 0x4)
    ManagedArray<int> importantObjects; // +0x118 (Size: 0x10)
    ManagedArray<int> importantUnits; // +0x128 (Size: 0x10)
    ManagedArray<int> importantMiscs; // +0x138 (Size: 0x10)
    ManagedArray<int> itemsToDefend; // +0x148 (Size: 0x10)
    InfluenceMap pathMap; // +0x158 (Size: 0x28)
    ManagedArray<int> playerObjects; // +0x180 (Size: 0x10)
    ManagedArray<int> playerBuildings; // +0x190 (Size: 0x10)
    XYPoint lastWallPosition; // +0x1A0 (Size: 0x8)
    XYPoint lastWallPosition2; // +0x1A8 (Size: 0x8)
    int numberGatesValue; // +0x1B0 (Size: 0x4)
    XYPoint minGatePosition[4]; // +0x1B4 (Size: 0x20)
    XYPoint maxGatePosition[4]; // +0x1D4 (Size: 0x20)
    int maxBuildingLots; // +0x1F4 (Size: 0x4)
    BuildingLot* buildingLots; // +0x1F8 (Size: 0x4)
    int maxAttackMemories; // +0x1FC (Size: 0x4)
    AttackMemory* attackMemories; // +0x200 (Size: 0x4)
    int saveLearnInformationValue; // +0x204 (Size: 0x4)
    char learnFileName[256]; // +0x208 (Size: 0x100)
    unsigned char fullyExploredZoneValue[255]; // +0x308 (Size: 0xFF)
    unsigned char _pad_0[0x1]; // 0x0407 (Gap: 1)
    QuadrantLog quadrantLog[4][4]; // +0x408 (Size: 0xC0)
    int** resourceTypesValue; // +0x4C8 (Size: 0x4)
    int* numberResourceTypesValue; // +0x4CC (Size: 0x4)
    ResourceMemory* resources[4]; // +0x4D0 (Size: 0x10)
    int numResources[4]; // +0x4E0 (Size: 0x10)
    int maxResources[4]; // +0x4F0 (Size: 0x10)
    int dropsitesByAge[4][4]; // +0x500 (Size: 0x40)
    int closestDropsiteValue[4]; // +0x540 (Size: 0x10)
    int closestDropsiteResourceID[4]; // +0x550 (Size: 0x10)
    int numberFoundForestTilesValue; // +0x560 (Size: 0x4)
    int playHistory[16000]; // +0x564 (Size: 0xFA00)
    int unitHistory[11]; // +0xFF64 (Size: 0x2C)
    char unitHistoryFilename[256]; // +0xFF90 (Size: 0x100)
};

// Size: 0x4B0 (1200 bytes)
class TribeJoinScreen : public TScreenPanel {
public:
    int startedSession; // +0x478 (Size: 0x4)
    int listFilled; // +0x47C (Size: 0x4)
    TTextPanel* title; // +0x480 (Size: 0x4)
    TTextPanel* listTitle; // +0x484 (Size: 0x4)
    TListPanel* list; // +0x488 (Size: 0x4)
    TScrollBarPanel* scrollbar; // +0x48C (Size: 0x4)
    TButtonPanel* joinButton; // +0x490 (Size: 0x4)
    TButtonPanel* createButton; // +0x494 (Size: 0x4)
    TButtonPanel* cancelButton; // +0x498 (Size: 0x4)
    TButtonPanel* refreshButton; // +0x49C (Size: 0x4)
    TButtonPanel* close_button; // +0x4A0 (Size: 0x4)
    int game_count; // +0x4A4 (Size: 0x4)
    int waitingToStart; // +0x4A8 (Size: 0x4)
    unsigned long joinTime; // +0x4AC (Size: 0x4)
};

// Size: 0x134 (308 bytes)
class TribeLionUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x494 (1172 bytes)
class TribeLoadSavedGameScreen : public TScreenPanel {
public:
    TTextPanel* screenTitle; // +0x478 (Size: 0x4)
    TTextPanel* listTitle; // +0x47C (Size: 0x4)
    TListPanel* list; // +0x480 (Size: 0x4)
    TScrollBarPanel* scrollbar; // +0x484 (Size: 0x4)
    TButtonPanel* okButton; // +0x488 (Size: 0x4)
    TButtonPanel* cancelButton; // +0x48C (Size: 0x4)
    TButtonPanel* deleteButton; // +0x490 (Size: 0x4)
};

// Size: 0x4A4 (1188 bytes)
class TribeMPCreateDialog : public TDialogPanel {
public:
    TTextPanel* title; // +0x490 (Size: 0x4)
    TTextPanel* input_title; // +0x494 (Size: 0x4)
    TEditPanel* inputGamename; // +0x498 (Size: 0x4)
    TButtonPanel* okButton; // +0x49C (Size: 0x4)
    TButtonPanel* cancelButton; // +0x4A0 (Size: 0x4)
};

// Size: 0x890 (2192 bytes)
class TribeMPSetupScreen : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    TTextPanel* playerTitle; // +0x47C (Size: 0x4)
    TTextPanel* civTitle; // +0x480 (Size: 0x4)
    TTextPanel* settingsTitle; // +0x484 (Size: 0x4)
    TTextPanel* colorTitle; // +0x488 (Size: 0x4)
    TTextPanel* teamTitle; // +0x48C (Size: 0x4)
    TTextPanel* playerNameText[8]; // +0x490 (Size: 0x20)
    TTextPanel* playerCivText[8]; // +0x4B0 (Size: 0x20)
    TTextPanel* scenarioPlayerText[8]; // +0x4D0 (Size: 0x20)
    TTextPanel* playerCDText[8]; // +0x4F0 (Size: 0x20)
    TTextPanel* playerVersionText[8]; // +0x510 (Size: 0x20)
    TTextPanel* playerColorText[8]; // +0x530 (Size: 0x20)
    TTextPanel* playerTeamText[8]; // +0x550 (Size: 0x20)
    TButtonPanel* playerColor[8]; // +0x570 (Size: 0x20)
    TButtonPanel* playerTeam[8]; // +0x590 (Size: 0x20)
    TDropDownPanel* playerNameDrop[8]; // +0x5B0 (Size: 0x20)
    TDropDownPanel* playerCivDrop[8]; // +0x5D0 (Size: 0x20)
    TDropDownPanel* scenarioPlayerDrop[8]; // +0x5F0 (Size: 0x20)
    TEditPanel* chatInput; // +0x610 (Size: 0x4)
    TTextPanel* chatTitle; // +0x614 (Size: 0x4)
    TTextPanel* chatBox; // +0x618 (Size: 0x4)
    TScrollBarPanel* chatScrollbar; // +0x61C (Size: 0x4)
    TButtonPanel* gameSettingsButton; // +0x620 (Size: 0x4)
    TTextPanel* scenarioName; // +0x624 (Size: 0x4)
    TTextPanel* victoryFixedText; // +0x628 (Size: 0x4)
    TTextPanel* settingText[20]; // +0x62C (Size: 0x50)
    TTextPanel* settingValue[20]; // +0x67C (Size: 0x50)
    TTextPanel* mapSizeLabel; // +0x6CC (Size: 0x4)
    TDropDownPanel* mapSizeDrop; // +0x6D0 (Size: 0x4)
    TTextPanel* mapTypeLabel; // +0x6D4 (Size: 0x4)
    TDropDownPanel* mapTypeDrop; // +0x6D8 (Size: 0x4)
    TTextPanel* numberPlayersTitle; // +0x6DC (Size: 0x4)
    TDropDownPanel* numberPlayersDrop; // +0x6E0 (Size: 0x4)
    TTextPanel* numberPlayersText; // +0x6E4 (Size: 0x4)
    TButtonPanel* hiddenMapButton; // +0x6E8 (Size: 0x4)
    TTextPanel* hiddenMapText; // +0x6EC (Size: 0x4)
    TTextPanel* victoryTypeLabel; // +0x6F0 (Size: 0x4)
    TDropDownPanel* victoryTypeDrop; // +0x6F4 (Size: 0x4)
    TTextPanel* victoryAmountLabel; // +0x6F8 (Size: 0x4)
    TEditPanel* victoryAmountInput; // +0x6FC (Size: 0x4)
    TButtonPanel* startButton; // +0x700 (Size: 0x4)
    TButtonPanel* readyButtons[2]; // +0x704 (Size: 0x8)
    TButtonPanel* cancelButton; // +0x70C (Size: 0x4)
    TButtonPanel* help_button; // +0x710 (Size: 0x4)
    TButtonPanel* ready_button; // +0x714 (Size: 0x4)
    TButtonPanel* close_button; // +0x718 (Size: 0x4)
    TTextPanel* ready_button_label; // +0x71C (Size: 0x4)
    int cancelMode; // +0x720 (Size: 0x4)
    int playerToKick; // +0x724 (Size: 0x4)
    int scenarioPlayerCount; // +0x728 (Size: 0x4)
    int myCivilization; // +0x72C (Size: 0x4)
    int myScenarioPlayer; // +0x730 (Size: 0x4)
    int myPlayerColor; // +0x734 (Size: 0x4)
    int myPlayerTeam; // +0x738 (Size: 0x4)
    long myScenarioChecksum; // +0x73C (Size: 0x4)
    char saveScenarioName[256]; // +0x740 (Size: 0x100)
    int saveRandomGame; // +0x840 (Size: 0x4)
    long saveScenarioChecksum; // +0x844 (Size: 0x4)
    T_Scenario* scenarioInfo; // +0x848 (Size: 0x4)
    int settingsFixed; // +0x84C (Size: 0x4)
    int numberAnyPlayers; // +0x850 (Size: 0x4)
    int sent_cd_status; // +0x854 (Size: 0x4)
    TButtonPanel* netInfoButton; // +0x858 (Size: 0x4)
    int i_am_ready; // +0x85C (Size: 0x4)
    unsigned char defaultColor[8]; // +0x860 (Size: 0x8)
    long scenarioCheckSum[8]; // +0x868 (Size: 0x20)
    unsigned long last_send_shared; // +0x888 (Size: 0x4)
    int resend_game_options; // +0x88C (Size: 0x4)
};

// Size: 0x6A0 (1696 bytes)
class TribeMPStartupScreen : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    TTextPanel* inputTitle; // +0x47C (Size: 0x4)
    TEditPanel* input; // +0x480 (Size: 0x4)
    TTextPanel* connectionTitle; // +0x484 (Size: 0x4)
    TButtonPanel* okButton; // +0x488 (Size: 0x4)
    TButtonPanel* cancelButton; // +0x48C (Size: 0x4)
    TButtonPanel* help_button; // +0x490 (Size: 0x4)
    TButtonPanel* close_button; // +0x494 (Size: 0x4)
    TListPanel* list; // +0x498 (Size: 0x4)
    TScrollBarPanel* scrollbar; // +0x49C (Size: 0x4)
    char zone_exec[255]; // +0x4A0 (Size: 0xFF)
    char browser_exec[255]; // +0x59F (Size: 0xFF)
    unsigned char _pad_end[0x2]; // 0x069e (Gap: 2)
};

// Size: 0x125C8 (75208 bytes)
class TribeMainDecisionAIModule : public MainDecisionAIModule {
public:
    TribeBuildAIModule buildAI; // +0x104 (Size: 0x5C0)
    TribeConstructionAIModule constructionAI; // +0x6C4 (Size: 0x318)
    DiplomacyAIModule diplomacyAI; // +0x9DC (Size: 0x150)
    EmotionalAIModule emotionalAI; // +0xB2C (Size: 0x1C0)
    TribeInformationAIModule informationAI; // +0xCEC (Size: 0x10090)
    TribeResourceAIModule resourceAI; // +0x10D7C (Size: 0xF8)
    TribeStrategyAIModule strategyAI; // +0x10E74 (Size: 0x5F8)
    TribeTacticalAIModule tacticalAI; // +0x1146C (Size: 0x100C)
    TradeAIModule tradeAI; // +0x12478 (Size: 0xF4)
    TRIBE_Player* aiPlayer; // +0x1256C (Size: 0x4)
    int firstUpdate; // +0x12570 (Size: 0x4)
    int veryFirstUpdate; // +0x12574 (Size: 0x4)
    int updateDelay; // +0x12578 (Size: 0x4)
    unsigned long lastDiplomacyUpdateTime; // +0x1257C (Size: 0x4)
    unsigned long lastTacticalUpdateTime; // +0x12580 (Size: 0x4)
    unsigned long lastTributeChatTime; // +0x12584 (Size: 0x4)
    unsigned long tributeChatTimeout; // +0x12588 (Size: 0x4)
    int waitingOnTribute; // +0x1258C (Size: 0x4)
    int tributeExpirationTimeout; // +0x12590 (Size: 0x4)
    int tributeAddressed; // +0x12594 (Size: 0x4)
    int tributeAmount; // +0x12598 (Size: 0x4)
    int decidedInitialDiplomacy; // +0x1259C (Size: 0x4)
    int requiredDiplomacyTributeAmount; // +0x125A0 (Size: 0x4)
    int tributeGiven[9]; // +0x125A4 (Size: 0x24)
};

// Size: 0x4BC (1212 bytes)
class TribeMenuDialog : public TDialogPanel {
public:
    TButtonPanel* button[11]; // +0x490 (Size: 0x2C)
};

// Size: 0x134 (308 bytes)
class TribePreditorUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x134 (308 bytes)
class TribePriestUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x134 (308 bytes)
class TribeRangedUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x134 (308 bytes)
class TribeRangedUnitAIModule2 : public UnitAIModule {
public:
};

// Size: 0xF8 (248 bytes)
class TribeResourceAIModule : public AIModule {
public:
    TribeMainDecisionAIModule* md; // +0xF0 (Size: 0x4)
    int numberResourcesValue; // +0xF4 (Size: 0x4)
};

// Size: 0x49C (1180 bytes)
class TribeSPMenuScreen : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    TButtonPanel* button[7]; // +0x47C (Size: 0x1C)
    TButtonPanel* close_button; // +0x498 (Size: 0x4)
};

// Size: 0x6A4 (1700 bytes)
class TribeSaveGameScreen : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    TEditPanel* input; // +0x47C (Size: 0x4)
    TListPanel* list; // +0x480 (Size: 0x4)
    TScrollBarPanel* scrollbar; // +0x484 (Size: 0x4)
    TButtonPanel* okButton; // +0x488 (Size: 0x4)
    TButtonPanel* cancelButton; // +0x48C (Size: 0x4)
    TButtonPanel* deleteButton; // +0x490 (Size: 0x4)
    char fileName[260]; // +0x494 (Size: 0x104)
    char fileNameNoExt[260]; // +0x598 (Size: 0x104)
    TribeSaveGameScreen::Mode modeValue; // +0x69C (Size: 0x4)
    int quit_after_save; // +0x6A0 (Size: 0x4)
};

// Size: 0x4D8 (1240 bytes)
class TribeSelectScenarioScreen : public TScreenPanel {
public:
    TTextPanel* title; // +0x478 (Size: 0x4)
    TTextPanel* scenarioTitle; // +0x47C (Size: 0x4)
    TTextPanel* scenarioPlayersTitle; // +0x480 (Size: 0x4)
    long scenarioListX; // +0x484 (Size: 0x4)
    long scenarioListY; // +0x488 (Size: 0x4)
    long scenarioListWidth; // +0x48C (Size: 0x4)
    long scenarioListHeight; // +0x490 (Size: 0x4)
    TListPanel* scenarioList; // +0x494 (Size: 0x4)
    TScrollBarPanel* scenarioScrollbar; // +0x498 (Size: 0x4)
    int scenarioCount; // +0x49C (Size: 0x4)
    char** scenarioMission; // +0x4A0 (Size: 0x4)
    int* scenarioFixed; // +0x4A4 (Size: 0x4)
    int scenariosLoaded; // +0x4A8 (Size: 0x4)
    TTextPanel* missionTitle; // +0x4AC (Size: 0x4)
    long missionTextX; // +0x4B0 (Size: 0x4)
    long missionTextY; // +0x4B4 (Size: 0x4)
    long missionTextWidth; // +0x4B8 (Size: 0x4)
    long missionTextHeight; // +0x4BC (Size: 0x4)
    TTextPanel* missionText; // +0x4C0 (Size: 0x4)
    TScrollBarPanel* missionScrollbar; // +0x4C4 (Size: 0x4)
    TButtonPanel* okButton; // +0x4C8 (Size: 0x4)
    TButtonPanel* cancelButton; // +0x4CC (Size: 0x4)
    TButtonPanel* close_button; // +0x4D0 (Size: 0x4)
    int last_scenario_line; // +0x4D4 (Size: 0x4)
};

// Size: 0x4B8 (1208 bytes)
class TribeSelectTribeScreen : public TScreenPanel {
public:
    TPicturePanel* background; // +0x478 (Size: 0x4)
    TTextPanel* title; // +0x47C (Size: 0x4)
    TTextPanel* tribeText; // +0x480 (Size: 0x4)
    TButtonPanel* tribeButton[9]; // +0x484 (Size: 0x24)
    TButtonPanel* okButton; // +0x4A8 (Size: 0x4)
    TButtonPanel* cancelButton; // +0x4AC (Size: 0x4)
    char** screenText; // +0x4B0 (Size: 0x4)
    int numLines; // +0x4B4 (Size: 0x4)
};

// Size: 0x54C (1356 bytes)
class TribeSendMessageDialog : public TDialogPanel {
public:
    TTextPanel* title; // +0x490 (Size: 0x4)
    TTextPanel* playerName[8]; // +0x494 (Size: 0x20)
    TTextPanel* playerCivilization[8]; // +0x4B4 (Size: 0x20)
    TButtonPanel* checkButton[8]; // +0x4D4 (Size: 0x20)
    TTextPanel* radioTitle[4]; // +0x4F4 (Size: 0x10)
    TButtonPanel* radioButton[4]; // +0x504 (Size: 0x10)
    TShape* radioButtonShapes; // +0x514 (Size: 0x4)
    TEditPanel* chatInput; // +0x518 (Size: 0x4)
    TTextPanel* chatTitle; // +0x51C (Size: 0x4)
    TButtonPanel* okButton; // +0x520 (Size: 0x4)
    TButtonPanel* help_button; // +0x524 (Size: 0x4)
    TShape* backgroundPics; // +0x528 (Size: 0x4)
    int commPlayers[8]; // +0x52C (Size: 0x20)
};

// Size: 0x49C (1180 bytes)
class TribeSendQuickMessageDialog : public TDialogPanel {
public:
    TEditPanel* chatInput; // +0x490 (Size: 0x4)
    TTextPanel* chatTitle; // +0x494 (Size: 0x4)
    TribeSendQuickMessageDialog::Mode modeValue; // +0x498 (Size: 0x4)
};

// Size: 0x134 (308 bytes)
class TribeSoldierUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x5F8 (1528 bytes)
class TribeStrategyAIModule : public StrategyAIModule {
public:
    TribeMainDecisionAIModule* md; // +0xF0 (Size: 0x4)
    int currentVictoryConditionValue; // +0xF4 (Size: 0x4)
    char ruleSetNameValue[257]; // +0xF8 (Size: 0x101)
    unsigned char _pad_0[0x3]; // 0x01f9 (Gap: 3)
    int targetIDValue; // +0x1FC (Size: 0x4)
    int targetTypeValue; // +0x200 (Size: 0x4)
    int secondTargetIDValue; // +0x204 (Size: 0x4)
    int secondTargetTypeValue; // +0x208 (Size: 0x4)
    Waypoint targetPoint1Value; // +0x20C (Size: 0x10)
    Waypoint targetPoint2Value; // +0x21C (Size: 0x10)
    int targetAttributeValue; // +0x22C (Size: 0x4)
    int targetNumberValue; // +0x230 (Size: 0x4)
    int victoryConditionChangeTimeout; // +0x234 (Size: 0x4)
    ManagedArray<int> vcRuleSet; // +0x238 (Size: 0x10)
    ManagedArray<int> executingRules; // +0x248 (Size: 0x10)
    ManagedArray<int> idleRules; // +0x258 (Size: 0x10)
    VictoryConditionRuleSystem vcRules; // +0x268 (Size: 0x38C)
    int difficultyLevel; // +0x5F4 (Size: 0x4)
};

// Size: 0x100C (4108 bytes)
class TribeTacticalAIModule : public TacticalAIModule {
public:
    TribeMainDecisionAIModule* md; // +0xF0 (Size: 0x4)
    ManagedArray<int> civilians; // +0xF4 (Size: 0x10)
    ManagedArray<int> civilianExplorers; // +0x104 (Size: 0x10)
    ManagedArray<int> soldiers; // +0x114 (Size: 0x10)
    ManagedArray<int> ungroupedSoldiers; // +0x124 (Size: 0x10)
    ManagedArray<int> boats; // +0x134 (Size: 0x10)
    ManagedArray<int> warBoats; // +0x144 (Size: 0x10)
    ManagedArray<int> fishingBoats; // +0x154 (Size: 0x10)
    ManagedArray<int> tradeBoats; // +0x164 (Size: 0x10)
    ManagedArray<int> transportBoats; // +0x174 (Size: 0x10)
    ManagedArray<int> artifacts; // +0x184 (Size: 0x10)
    int sn[226]; // +0x194 (Size: 0x388)
    UnitData gatherers[50]; // +0x51C (Size: 0x4B0)
    int numberGatherersValue; // +0x9CC (Size: 0x4)
    int desiredNumberGatherersValue; // +0x9D0 (Size: 0x4)
    TacticalAIGroup groups; // +0x9D4 (Size: 0x330)
    int groupIDValue; // +0xD04 (Size: 0x4)
    int numberGroupsValue; // +0xD08 (Size: 0x4)
    unsigned long lastGroupAttackTime; // +0xD0C (Size: 0x4)
    unsigned long lastGroupRebalanceTime; // +0xD10 (Size: 0x4)
    unsigned long lastAttackResponseTime; // +0xD14 (Size: 0x4)
    unsigned long lastBoatAttackResponseTime; // +0xD18 (Size: 0x4)
    unsigned long lastScalingUpdateValue; // +0xD1C (Size: 0x4)
    int numberBuildUpdatesSkipped; // +0xD20 (Size: 0x4)
    int randomizedAttackSeparationTime; // +0xD24 (Size: 0x4)
    ManagedArray<int> playersToAttack; // +0xD28 (Size: 0x10)
    ManagedArray<int> playersToDefend; // +0xD38 (Size: 0x10)
    ManagedArray<int> workingArea; // +0xD48 (Size: 0x10)
    ManagedArray<int> unitsTaskedThisUpdate; // +0xD58 (Size: 0x10)
    int actualGathererDistribution[4]; // +0xD68 (Size: 0x10)
    int desiredGathererDistribution[4]; // +0xD78 (Size: 0x10)
    int neededResourceValue[4]; // +0xD88 (Size: 0x10)
    int resourceDifferenceValue[4]; // +0xD98 (Size: 0x10)
    ResourceItem neededResources; // +0xDA8 (Size: 0x70)
    int attackEnabledValue; // +0xE18 (Size: 0x4)
    int updateArea; // +0xE1C (Size: 0x4)
    int firstNeededResourceUpdateDone; // +0xE20 (Size: 0x4)
    int numberStoragePitsBuilt[4]; // +0xE24 (Size: 0x10)
    int numberGranariesBuilt[4]; // +0xE34 (Size: 0x10)
    int wonderInProgressValue; // +0xE44 (Size: 0x4)
    int wonderBuiltValue; // +0xE48 (Size: 0x4)
    PlacementState placementStateValue; // +0xE4C (Size: 0x130)
    int nextCivilianToTaskValue; // +0xF7C (Size: 0x4)
    int nextIdleSoldierGroupToTaskValue; // +0xF80 (Size: 0x4)
    int nextActiveSoldierGroupToTaskValue; // +0xF84 (Size: 0x4)
    int builtFirstStoragePit; // +0xF88 (Size: 0x4)
    int builtFirstGranary; // +0xF8C (Size: 0x4)
    unsigned long lastBuildTime; // +0xF90 (Size: 0x4)
    unsigned long lastAttackResponseBuildInsertionTime; // +0xF94 (Size: 0x4)
    unsigned long lastCoopTributeDemandTime; // +0xF98 (Size: 0x4)
    unsigned long lastCoopTributeGiftTime; // +0xF9C (Size: 0x4)
    unsigned long lastCoopAttackDemandTime; // +0xFA0 (Size: 0x4)
    int zoomingToNextAge; // +0xFA4 (Size: 0x4)
    unsigned long lastUngroupedSoldierTaskTime; // +0xFA8 (Size: 0x4)
    AttackState attackStateValue; // +0xFAC (Size: 0x2C)
    int hitsByPlayer[9]; // +0xFD8 (Size: 0x24)
    int lastUpdateAreaTimeValue; // +0xFFC (Size: 0x4)
    int averageUpdateAreaTimeValue; // +0x1000 (Size: 0x4)
    int updateAreaAverageCount; // +0x1004 (Size: 0x4)
    int updateAreaAverageTotal; // +0x1008 (Size: 0x4)
};

// Size: 0x134 (308 bytes)
class TribeTowerUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x134 (308 bytes)
class TribeTradeShipUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x134 (308 bytes)
class TribeTransportShipUnitAIModule : public UnitAIModule {
public:
};

// Size: 0x134 (308 bytes)
class UnitAIModule {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    RGE_Static_Object* objectValue; // +0x4 (Size: 0x4)
    int moodValue; // +0x8 (Size: 0x4)
    int objectCategoryValue; // +0xC (Size: 0x4)
    int orderQueueSizeValue; // +0x10 (Size: 0x4)
    int orderQueueMaxSizeValue; // +0x14 (Size: 0x4)
    OrderEvent* orderQueueValue; // +0x18 (Size: 0x4)
    int notifyQueueSizeValue; // +0x1C (Size: 0x4)
    int notifyQueueMaxSizeValue; // +0x20 (Size: 0x4)
    NotifyEvent* notifyQueueValue; // +0x24 (Size: 0x4)
    int currentOrderValue; // +0x28 (Size: 0x4)
    int currentOrderPriorityValue; // +0x2C (Size: 0x4)
    int currentActionValue; // +0x30 (Size: 0x4)
    int currentTargetValue; // +0x34 (Size: 0x4)
    int currentTargetTypeValue; // +0x38 (Size: 0x4)
    float currentTargetXValue; // +0x3C (Size: 0x4)
    float currentTargetYValue; // +0x40 (Size: 0x4)
    float currentTargetZValue; // +0x44 (Size: 0x4)
    float desiredTargetDistanceValue; // +0x48 (Size: 0x4)
    int defendTargetValue; // +0x4C (Size: 0x4)
    int lastOrderValue; // +0x50 (Size: 0x4)
    int lastActionValue; // +0x54 (Size: 0x4)
    int lastTargetValue; // +0x58 (Size: 0x4)
    int lastTargetTypeValue; // +0x5C (Size: 0x4)
    ManagedArray<int> attackingUnitsValue; // +0x60 (Size: 0x10)
    Waypoint waypointQueue[8]; // +0x70 (Size: 0x80)
    int waypointQueueSizeValue; // +0xF0 (Size: 0x4)
    unsigned long lastUpdateTimeValue; // +0xF4 (Size: 0x4)
    unsigned long idleTimerValue; // +0xF8 (Size: 0x4)
    unsigned long adjustedIdleTimeoutValue; // +0xFC (Size: 0x4)
    unsigned long idleTimeoutValue; // +0x100 (Size: 0x4)
    unsigned long secondaryTimerValue; // +0x104 (Size: 0x4)
    unsigned long lookAroundTimerValue; // +0x108 (Size: 0x4)
    unsigned long lookAroundTimeoutValue; // +0x10C (Size: 0x4)
    Waypoint lastWorldPositionValue; // +0x110 (Size: 0x10)
    float defenseBufferValue; // +0x120 (Size: 0x4)
    int* importantObjects; // +0x124 (Size: 0x4)
    int numberImportantObjects; // +0x128 (Size: 0x4)
    AIPlayStatus* playStatus; // +0x12C (Size: 0x4)
    unsigned char stopAfterTargetKilledValue; // +0x130 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x0131 (Gap: 3)
};

// Size: 0x18 (24 bytes)
class UnitData {
public:
    int id; // +0x0 (Size: 0x4)
    int data1; // +0x4 (Size: 0x4)
    int data2; // +0x8 (Size: 0x4)
    int data3; // +0xC (Size: 0x4)
    int target; // +0x10 (Size: 0x4)
    unsigned long lastTaskTime; // +0x14 (Size: 0x4)
};

// Size: 0x24 (36 bytes)
class VC_LOG {
public:
    int world_time; // +0x0 (Size: 0x4)
    int player_id; // +0x4 (Size: 0x4)
    int action; // +0x8 (Size: 0x4)
    int object_id; // +0xC (Size: 0x4)
    int x1; // +0x10 (Size: 0x4)
    int y1; // +0x14 (Size: 0x4)
    int x2; // +0x18 (Size: 0x4)
    int y2; // +0x1C (Size: 0x4)
    int supress; // +0x20 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class VISIBLE_RESOURCE_REC {
public:
    int object_id; // +0x0 (Size: 0x4)
    unsigned char distance; // +0x4 (Size: 0x1)
    unsigned char zone; // +0x5 (Size: 0x1)
    unsigned char pos_x; // +0x6 (Size: 0x1)
    unsigned char pos_y; // +0x7 (Size: 0x1)
};

// Size: 0x8 (8 bytes)
class VISIBLE_UNIT_PTR {
public:
    VISIBLE_UNIT_REC* unit_list; // +0x0 (Size: 0x4)
    short list_size; // +0x4 (Size: 0x2)
    short used; // +0x6 (Size: 0x2)
};

// Size: 0x8 (8 bytes)
class VISIBLE_UNIT_REC {
public:
    int object_id; // +0x0 (Size: 0x4)
    unsigned char distance; // +0x4 (Size: 0x1)
    unsigned char player; // +0x5 (Size: 0x1)
    unsigned char pos_x; // +0x6 (Size: 0x1)
    unsigned char pos_y; // +0x7 (Size: 0x1)
};

// Size: 0x3 (3 bytes)
class VSpanMiniList {
public:
    unsigned char Y_delta; // +0x0 (Size: 0x1)
    unsigned char X_start; // +0x1 (Size: 0x1)
    unsigned char X_end; // +0x2 (Size: 0x1)
};

// Size: 0x10 (16 bytes)
class VSpan_Node {
public:
    VSpan_Node* Next; // +0x0 (Size: 0x4)
    VSpan_Node* Prev; // +0x4 (Size: 0x4)
    int StartPx; // +0x8 (Size: 0x4)
    int EndPx; // +0xC (Size: 0x4)
};

// Size: 0x38C (908 bytes)
class VictoryConditionRuleSystem {
public:
    void* vtable_ptr; // +0x0 (Size: 0x4)
    int sn[226]; // +0x4 (Size: 0x388)
};

// Size: 0x18 (24 bytes)
class Victory_StartInfo {
public:
    int MP_Conquest; // +0x0 (Size: 0x4)
    int MP_Ruins; // +0x4 (Size: 0x4)
    int MP_Artifacts; // +0x8 (Size: 0x4)
    int MP_Discoveries; // +0xC (Size: 0x4)
    int MP_Exploration; // +0x10 (Size: 0x4)
    int MP_Gold; // +0x14 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class Visible_Resource_Manager {
public:
    VISIBLE_RESOURCE_REC** VR_List; // +0x0 (Size: 0x4)
    int* VR_ListSize; // +0x4 (Size: 0x4)
    int* VR_ListUsed; // +0x8 (Size: 0x4)
    RGE_Player* owner; // +0xC (Size: 0x4)
    int num_visible_resource_lists; // +0x10 (Size: 0x4)
};

// Size: 0x24 (36 bytes)
class Visible_Unit_Manager {
public:
    VISIBLE_UNIT_PTR** PlayerDataPtrs; // +0x0 (Size: 0x4)
    VISIBLE_UNIT_REC* Return_Buffer[5]; // +0x4 (Size: 0x14)
    int Player_Count; // +0x18 (Size: 0x4)
    int Category_Count; // +0x1C (Size: 0x4)
    unsigned char* distanceTable; // +0x20 (Size: 0x4)
};

// Size: 0x190 (400 bytes)
class WSAData {
public:
    unsigned short wVersion; // +0x0 (Size: 0x2)
    unsigned short wHighVersion; // +0x2 (Size: 0x2)
    char szDescription[257]; // +0x4 (Size: 0x101)
    char szSystemStatus[129]; // +0x105 (Size: 0x81)
    unsigned short iMaxSockets; // +0x186 (Size: 0x2)
    unsigned short iMaxUdpDg; // +0x188 (Size: 0x2)
    unsigned char _pad_0[0x2]; // 0x018a (Gap: 2)
    char* lpVendorInfo; // +0x18C (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class Waypoint {
public:
    float x; // +0x0 (Size: 0x4)
    float y; // +0x4 (Size: 0x4)
    float z; // +0x8 (Size: 0x4)
    unsigned char facetToNextWaypoint; // +0xC (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x000d (Gap: 3)
};

// Size: 0x8 (8 bytes)
class XYPoint {
public:
    int x; // +0x0 (Size: 0x4)
    int y; // +0x4 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class XYZ {
public:
    int xValue; // +0x0 (Size: 0x4)
    int yValue; // +0x4 (Size: 0x4)
    int zValue; // +0x8 (Size: 0x4)
};

// Size: 0x3 (3 bytes)
class XYZBYTEPoint {
public:
    unsigned char x; // +0x0 (Size: 0x1)
    unsigned char y; // +0x1 (Size: 0x1)
    unsigned char z; // +0x2 (Size: 0x1)
};

// Size: 0xC (12 bytes)
class XYZPoint {
public:
    int x; // +0x0 (Size: 0x4)
    int y; // +0x4 (Size: 0x4)
    int z; // +0x8 (Size: 0x4)
};

// Size: 0xC (12 bytes)
class Zone_Queue {
public:
    long x; // +0x0 (Size: 0x4)
    long y; // +0x4 (Size: 0x4)
    Zone_Queue* next; // +0x8 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class _DDBLTBATCH {
public:
    tagRECT* lprDest; // +0x0 (Size: 0x4)
    IDirectDrawSurface* lpDDSSrc; // +0x4 (Size: 0x4)
    tagRECT* lprSrc; // +0x8 (Size: 0x4)
    unsigned long dwFlags; // +0xC (Size: 0x4)
    _DDBLTFX* lpDDBltFx; // +0x10 (Size: 0x4)
};

// Size: 0x64 (100 bytes)
class _DDBLTFX {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwDDFX; // +0x4 (Size: 0x4)
    unsigned long dwROP; // +0x8 (Size: 0x4)
    unsigned long dwDDROP; // +0xC (Size: 0x4)
    unsigned long dwRotationAngle; // +0x10 (Size: 0x4)
    unsigned long dwZBufferOpCode; // +0x14 (Size: 0x4)
    unsigned long dwZBufferLow; // +0x18 (Size: 0x4)
    unsigned long dwZBufferHigh; // +0x1C (Size: 0x4)
    unsigned long dwZBufferBaseDest; // +0x20 (Size: 0x4)
    unsigned long dwZDestConstBitDepth; // +0x24 (Size: 0x4)
    unsigned long dwZDestConst; // +0x28 (Size: 0x4)
    unsigned long dwZSrcConstBitDepth; // +0x2C (Size: 0x4)
    unsigned long dwZSrcConst; // +0x30 (Size: 0x4)
    unsigned long dwAlphaEdgeBlendBitDepth; // +0x34 (Size: 0x4)
    unsigned long dwAlphaEdgeBlend; // +0x38 (Size: 0x4)
    unsigned long dwReserved; // +0x3C (Size: 0x4)
    unsigned long dwAlphaDestConstBitDepth; // +0x40 (Size: 0x4)
    unsigned long dwAlphaDestConst; // +0x44 (Size: 0x4)
    unsigned long dwAlphaSrcConstBitDepth; // +0x48 (Size: 0x4)
    unsigned long dwAlphaSrcConst; // +0x4C (Size: 0x4)
    unsigned long dwFillColor; // +0x50 (Size: 0x4)
    _DDCOLORKEY ddckDestColorkey; // +0x54 (Size: 0x8)
    _DDCOLORKEY ddckSrcColorkey; // +0x5C (Size: 0x8)
};

// Size: 0x13C (316 bytes)
class _DDCAPS {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwCaps; // +0x4 (Size: 0x4)
    unsigned long dwCaps2; // +0x8 (Size: 0x4)
    unsigned long dwCKeyCaps; // +0xC (Size: 0x4)
    unsigned long dwFXCaps; // +0x10 (Size: 0x4)
    unsigned long dwFXAlphaCaps; // +0x14 (Size: 0x4)
    unsigned long dwPalCaps; // +0x18 (Size: 0x4)
    unsigned long dwSVCaps; // +0x1C (Size: 0x4)
    unsigned long dwAlphaBltConstBitDepths; // +0x20 (Size: 0x4)
    unsigned long dwAlphaBltPixelBitDepths; // +0x24 (Size: 0x4)
    unsigned long dwAlphaBltSurfaceBitDepths; // +0x28 (Size: 0x4)
    unsigned long dwAlphaOverlayConstBitDepths; // +0x2C (Size: 0x4)
    unsigned long dwAlphaOverlayPixelBitDepths; // +0x30 (Size: 0x4)
    unsigned long dwAlphaOverlaySurfaceBitDepths; // +0x34 (Size: 0x4)
    unsigned long dwZBufferBitDepths; // +0x38 (Size: 0x4)
    unsigned long dwVidMemTotal; // +0x3C (Size: 0x4)
    unsigned long dwVidMemFree; // +0x40 (Size: 0x4)
    unsigned long dwMaxVisibleOverlays; // +0x44 (Size: 0x4)
    unsigned long dwCurrVisibleOverlays; // +0x48 (Size: 0x4)
    unsigned long dwNumFourCCCodes; // +0x4C (Size: 0x4)
    unsigned long dwAlignBoundarySrc; // +0x50 (Size: 0x4)
    unsigned long dwAlignSizeSrc; // +0x54 (Size: 0x4)
    unsigned long dwAlignBoundaryDest; // +0x58 (Size: 0x4)
    unsigned long dwAlignSizeDest; // +0x5C (Size: 0x4)
    unsigned long dwAlignStrideAlign; // +0x60 (Size: 0x4)
    unsigned long dwRops[8]; // +0x64 (Size: 0x20)
    _DDSCAPS ddsCaps; // +0x84 (Size: 0x4)
    unsigned long dwMinOverlayStretch; // +0x88 (Size: 0x4)
    unsigned long dwMaxOverlayStretch; // +0x8C (Size: 0x4)
    unsigned long dwMinLiveVideoStretch; // +0x90 (Size: 0x4)
    unsigned long dwMaxLiveVideoStretch; // +0x94 (Size: 0x4)
    unsigned long dwMinHwCodecStretch; // +0x98 (Size: 0x4)
    unsigned long dwMaxHwCodecStretch; // +0x9C (Size: 0x4)
    unsigned long dwReserved1; // +0xA0 (Size: 0x4)
    unsigned long dwReserved2; // +0xA4 (Size: 0x4)
    unsigned long dwReserved3; // +0xA8 (Size: 0x4)
    unsigned long dwSVBCaps; // +0xAC (Size: 0x4)
    unsigned long dwSVBCKeyCaps; // +0xB0 (Size: 0x4)
    unsigned long dwSVBFXCaps; // +0xB4 (Size: 0x4)
    unsigned long dwSVBRops[8]; // +0xB8 (Size: 0x20)
    unsigned long dwVSBCaps; // +0xD8 (Size: 0x4)
    unsigned long dwVSBCKeyCaps; // +0xDC (Size: 0x4)
    unsigned long dwVSBFXCaps; // +0xE0 (Size: 0x4)
    unsigned long dwVSBRops[8]; // +0xE4 (Size: 0x20)
    unsigned long dwSSBCaps; // +0x104 (Size: 0x4)
    unsigned long dwSSBCKeyCaps; // +0x108 (Size: 0x4)
    unsigned long dwSSBFXCaps; // +0x10C (Size: 0x4)
    unsigned long dwSSBRops[8]; // +0x110 (Size: 0x20)
    unsigned long dwReserved4; // +0x130 (Size: 0x4)
    unsigned long dwReserved5; // +0x134 (Size: 0x4)
    unsigned long dwReserved6; // +0x138 (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class _DDCOLORKEY {
public:
    unsigned long dwColorSpaceLowValue; // +0x0 (Size: 0x4)
    unsigned long dwColorSpaceHighValue; // +0x4 (Size: 0x4)
};

// Size: 0x38 (56 bytes)
class _DDOVERLAYFX {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwAlphaEdgeBlendBitDepth; // +0x4 (Size: 0x4)
    unsigned long dwAlphaEdgeBlend; // +0x8 (Size: 0x4)
    unsigned long dwReserved; // +0xC (Size: 0x4)
    unsigned long dwAlphaDestConstBitDepth; // +0x10 (Size: 0x4)
    unsigned long dwAlphaDestConst; // +0x14 (Size: 0x4)
    unsigned long dwAlphaSrcConstBitDepth; // +0x18 (Size: 0x4)
    unsigned long dwAlphaSrcConst; // +0x1C (Size: 0x4)
    _DDCOLORKEY dckDestColorkey; // +0x20 (Size: 0x8)
    _DDCOLORKEY dckSrcColorkey; // +0x28 (Size: 0x8)
    unsigned long dwDDFX; // +0x30 (Size: 0x4)
    unsigned long dwFlags; // +0x34 (Size: 0x4)
};

// Size: 0x20 (32 bytes)
class _DDPIXELFORMAT {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned long dwFourCC; // +0x8 (Size: 0x4)
    unsigned long dwRGBBitCount; // +0xC (Size: 0x4)
    unsigned long dwRBitMask; // +0x10 (Size: 0x4)
    unsigned long dwGBitMask; // +0x14 (Size: 0x4)
    unsigned long dwBBitMask; // +0x18 (Size: 0x4)
    unsigned long dwRGBAlphaBitMask; // +0x1C (Size: 0x4)
};

// Size: 0x4 (4 bytes)
class _DDSCAPS {
public:
    unsigned long dwCaps; // +0x0 (Size: 0x4)
};

// Size: 0x6C (108 bytes)
class _DDSURFACEDESC {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned long dwHeight; // +0x8 (Size: 0x4)
    unsigned long dwWidth; // +0xC (Size: 0x4)
    long lPitch; // +0x10 (Size: 0x4)
    unsigned long dwBackBufferCount; // +0x14 (Size: 0x4)
    unsigned long dwMipMapCount; // +0x18 (Size: 0x4)
    unsigned long dwAlphaBitDepth; // +0x1C (Size: 0x4)
    unsigned long dwReserved; // +0x20 (Size: 0x4)
    void* lpSurface; // +0x24 (Size: 0x4)
    _DDCOLORKEY ddckCKDestOverlay; // +0x28 (Size: 0x8)
    _DDCOLORKEY ddckCKDestBlt; // +0x30 (Size: 0x8)
    _DDCOLORKEY ddckCKSrcOverlay; // +0x38 (Size: 0x8)
    _DDCOLORKEY ddckCKSrcBlt; // +0x40 (Size: 0x8)
    _DDPIXELFORMAT ddpfPixelFormat; // +0x48 (Size: 0x20)
    _DDSCAPS ddsCaps; // +0x68 (Size: 0x4)
};

// Size: 0x18 (24 bytes)
class _DIDATAFORMAT {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwObjSize; // +0x4 (Size: 0x4)
    unsigned long dwFlags; // +0x8 (Size: 0x4)
    unsigned long dwDataSize; // +0xC (Size: 0x4)
    unsigned long dwNumObjs; // +0x10 (Size: 0x4)
    _DIOBJECTDATAFORMAT* rgodf; // +0x14 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class _DIOBJECTDATAFORMAT {
public:
    _GUID* pguid; // +0x0 (Size: 0x4)
    unsigned long dwOfs; // +0x4 (Size: 0x4)
    unsigned long dwType; // +0x8 (Size: 0x4)
    unsigned long dwFlags; // +0xC (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class _DSBCAPS {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned long dwBufferBytes; // +0x8 (Size: 0x4)
    unsigned long dwUnlockTransferRate; // +0xC (Size: 0x4)
    unsigned long dwPlayCpuOverhead; // +0x10 (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class _DSBUFFERDESC {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned long dwBufferBytes; // +0x8 (Size: 0x4)
    unsigned long dwReserved; // +0xC (Size: 0x4)
    tWAVEFORMATEX* lpwfxFormat; // +0x10 (Size: 0x4)
};

// Size: 0x60 (96 bytes)
class _DSCAPS {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long dwFlags; // +0x4 (Size: 0x4)
    unsigned long dwMinSecondarySampleRate; // +0x8 (Size: 0x4)
    unsigned long dwMaxSecondarySampleRate; // +0xC (Size: 0x4)
    unsigned long dwPrimaryBuffers; // +0x10 (Size: 0x4)
    unsigned long dwMaxHwMixingAllBuffers; // +0x14 (Size: 0x4)
    unsigned long dwMaxHwMixingStaticBuffers; // +0x18 (Size: 0x4)
    unsigned long dwMaxHwMixingStreamingBuffers; // +0x1C (Size: 0x4)
    unsigned long dwFreeHwMixingAllBuffers; // +0x20 (Size: 0x4)
    unsigned long dwFreeHwMixingStaticBuffers; // +0x24 (Size: 0x4)
    unsigned long dwFreeHwMixingStreamingBuffers; // +0x28 (Size: 0x4)
    unsigned long dwMaxHw3DAllBuffers; // +0x2C (Size: 0x4)
    unsigned long dwMaxHw3DStaticBuffers; // +0x30 (Size: 0x4)
    unsigned long dwMaxHw3DStreamingBuffers; // +0x34 (Size: 0x4)
    unsigned long dwFreeHw3DAllBuffers; // +0x38 (Size: 0x4)
    unsigned long dwFreeHw3DStaticBuffers; // +0x3C (Size: 0x4)
    unsigned long dwFreeHw3DStreamingBuffers; // +0x40 (Size: 0x4)
    unsigned long dwTotalHwMemBytes; // +0x44 (Size: 0x4)
    unsigned long dwFreeHwMemBytes; // +0x48 (Size: 0x4)
    unsigned long dwMaxContigFreeHwMemBytes; // +0x4C (Size: 0x4)
    unsigned long dwUnlockTransferRateHwBuffers; // +0x50 (Size: 0x4)
    unsigned long dwPlayCpuOverheadSwBuffers; // +0x54 (Size: 0x4)
    unsigned long dwReserved1; // +0x58 (Size: 0x4)
    unsigned long dwReserved2; // +0x5C (Size: 0x4)
};

// Size: 0x8 (8 bytes)
class _FILETIME {
public:
    unsigned long dwLowDateTime; // +0x0 (Size: 0x4)
    unsigned long dwHighDateTime; // +0x4 (Size: 0x4)
};

// Size: 0x10 (16 bytes)
class _GUID {
public:
    unsigned long x; // +0x0 (Size: 0x4)
    unsigned short s1; // +0x4 (Size: 0x2)
    unsigned short s2; // +0x6 (Size: 0x2)
    unsigned char c[8]; // +0x8 (Size: 0x8)
};

// Size: 0x20 (32 bytes)
class _MEMORYSTATUS {
public:
    unsigned long dwLength; // +0x0 (Size: 0x4)
    unsigned long dwMemoryLoad; // +0x4 (Size: 0x4)
    unsigned long dwTotalPhys; // +0x8 (Size: 0x4)
    unsigned long dwAvailPhys; // +0xC (Size: 0x4)
    unsigned long dwTotalPageFile; // +0x10 (Size: 0x4)
    unsigned long dwAvailPageFile; // +0x14 (Size: 0x4)
    unsigned long dwTotalVirtual; // +0x18 (Size: 0x4)
    unsigned long dwAvailVirtual; // +0x1C (Size: 0x4)
};

// Size: 0x14 (20 bytes)
class _MMCKINFO {
public:
    unsigned long ckid; // +0x0 (Size: 0x4)
    unsigned long cksize; // +0x4 (Size: 0x4)
    unsigned long fccType; // +0x8 (Size: 0x4)
    unsigned long dwDataOffset; // +0xC (Size: 0x4)
    unsigned long dwFlags; // +0x10 (Size: 0x4)
};

// Size: 0x48 (72 bytes)
class _MMIOINFO {
public:
    unsigned long dwFlags; // +0x0 (Size: 0x4)
    unsigned long fccIOProc; // +0x4 (Size: 0x4)
    long  (__stdcall * pIOProc)(char*, unsigned int, long, long); // +0x8 (Size: 0x4)
    unsigned int wErrorRet; // +0xC (Size: 0x4)
    void* htask; // +0x10 (Size: 0x4)
    long cchBuffer; // +0x14 (Size: 0x4)
    char* pchBuffer; // +0x18 (Size: 0x4)
    char* pchNext; // +0x1C (Size: 0x4)
    char* pchEndRead; // +0x20 (Size: 0x4)
    char* pchEndWrite; // +0x24 (Size: 0x4)
    long lBufOffset; // +0x28 (Size: 0x4)
    long lDiskOffset; // +0x2C (Size: 0x4)
    unsigned long adwInfo[3]; // +0x30 (Size: 0xC)
    unsigned long dwReserved1; // +0x3C (Size: 0x4)
    unsigned long dwReserved2; // +0x40 (Size: 0x4)
    void* hmmio; // +0x44 (Size: 0x4)
};

// Size: 0x88 (136 bytes)
class _OFSTRUCT {
public:
    unsigned char cBytes; // +0x0 (Size: 0x1)
    unsigned char fFixedDisk; // +0x1 (Size: 0x1)
    unsigned short nErrCode; // +0x2 (Size: 0x2)
    unsigned short Reserved1; // +0x4 (Size: 0x2)
    unsigned short Reserved2; // +0x6 (Size: 0x2)
    char szPathName[128]; // +0x8 (Size: 0x80)
};

// Size: 0x94 (148 bytes)
class _OSVERSIONINFOA {
public:
    unsigned long dwOSVersionInfoSize; // +0x0 (Size: 0x4)
    unsigned long dwMajorVersion; // +0x4 (Size: 0x4)
    unsigned long dwMinorVersion; // +0x8 (Size: 0x4)
    unsigned long dwBuildNumber; // +0xC (Size: 0x4)
    unsigned long dwPlatformId; // +0x10 (Size: 0x4)
    char szCSDVersion[128]; // +0x14 (Size: 0x80)
};

// Size: 0x24 (36 bytes)
class _RGNDATA {
public:
    _RGNDATAHEADER rdh; // +0x0 (Size: 0x20)
    char Buffer[1]; // +0x20 (Size: 0x1)
    unsigned char _pad_end[0x3]; // 0x0021 (Gap: 3)
};

// Size: 0x20 (32 bytes)
class _RGNDATAHEADER {
public:
    unsigned long dwSize; // +0x0 (Size: 0x4)
    unsigned long iType; // +0x4 (Size: 0x4)
    unsigned long nCount; // +0x8 (Size: 0x4)
    unsigned long nRgnSize; // +0xC (Size: 0x4)
    tagRECT rcBound; // +0x10 (Size: 0x10)
};

// Size: 0x10 (16 bytes)
class _SYSTEMTIME {
public:
    unsigned short wYear; // +0x0 (Size: 0x2)
    unsigned short wMonth; // +0x2 (Size: 0x2)
    unsigned short wDayOfWeek; // +0x4 (Size: 0x2)
    unsigned short wDay; // +0x6 (Size: 0x2)
    unsigned short wHour; // +0x8 (Size: 0x2)
    unsigned short wMinute; // +0xA (Size: 0x2)
    unsigned short wSecond; // +0xC (Size: 0x2)
    unsigned short wMilliseconds; // +0xE (Size: 0x2)
};

// Size: 0x140 (320 bytes)
class _WIN32_FIND_DATAA {
public:
    unsigned long dwFileAttributes; // +0x0 (Size: 0x4)
    _FILETIME ftCreationTime; // +0x4 (Size: 0x8)
    _FILETIME ftLastAccessTime; // +0xC (Size: 0x8)
    _FILETIME ftLastWriteTime; // +0x14 (Size: 0x8)
    unsigned long nFileSizeHigh; // +0x1C (Size: 0x4)
    unsigned long nFileSizeLow; // +0x20 (Size: 0x4)
    unsigned long dwReserved0; // +0x24 (Size: 0x4)
    unsigned long dwReserved1; // +0x28 (Size: 0x4)
    char cFileName[260]; // +0x2C (Size: 0x104)
    char cAlternateFileName[14]; // +0x130 (Size: 0xE)
    unsigned char _pad_end[0x2]; // 0x013e (Gap: 2)
};

// Size: 0x20 (32 bytes)
class __unnamed {
public:
    float from_angle1; // +0x0 (Size: 0x4)
    float to_angle1; // +0x4 (Size: 0x4)
    float from_angle2; // +0x8 (Size: 0x4)
    float to_angle2; // +0xC (Size: 0x4)
    float line_x1; // +0x10 (Size: 0x4)
    float line_y1; // +0x14 (Size: 0x4)
    float line_x2; // +0x18 (Size: 0x4)
    float line_y2; // +0x1C (Size: 0x4)
};

// Size: 0x118 (280 bytes)
class _finddata_t {
public:
    unsigned int attrib; // +0x0 (Size: 0x4)
    long time_create; // +0x4 (Size: 0x4)
    long time_access; // +0x8 (Size: 0x4)
