#pragma once
#include "common.h"
#include "PanelNode.h"

class TPanel {
public:
    enum PositionMode : int {
        Fixed = 0,
        Relative = 1,
        Center = 2
    };
    enum RedrawMode : int {
        NoRedraw = 0,
        Redraw = 1
    };

    TPanel(char* name = nullptr);

    // Virtuals (best-effort)
    virtual ~TPanel(); // vt[0] (0x0)
    virtual long setup(TDrawArea* param_1, TPanel* param_2, long param_3, long param_4, long param_5, long param_6, uchar param_7); // vt[1] (0x4)
    virtual void set_rect(tagRECT param_1); // vt[2] (0x8)
    virtual void set_rect(long param_1, long param_2, long param_3, long param_4); // vt[3] (0xC)
    virtual void set_color(uchar param_1); // vt[4] (0x10)
    virtual void set_active(int param_1); // vt[5] (0x14)
    virtual void set_positioning(PositionMode param_1, long param_2, long param_3, long param_4, long param_5, long param_6, long param_7, long param_8, long param_9); // vt[6] (0x18)
    virtual void set_fixed_position(long param_1, long param_2, long param_3, long param_4); // vt[7] (0x1C)
    virtual void set_redraw(RedrawMode param_1); // vt[8] (0x20)
    virtual void set_overlapped_redraw(RedrawMode param_1); // vt[9] (0x24)
    virtual void draw_setup(int param_1); // vt[10] (0x28)
    virtual void draw_finish(); // vt[11] (0x2C)
    virtual void draw(); // vt[12] (0x30)
    virtual void draw_rect(tagRECT* param_1); // vt[13] (0x34)
    virtual void draw_offset(long param_1, long param_2, tagRECT* param_3); // vt[14] (0x38)
    virtual void draw_rect2(tagRECT* param_1); // vt[15] (0x3C)
    virtual void draw_offset2(long param_1, long param_2, tagRECT* param_3); // vt[16] (0x40)
    virtual void paint(); // vt[17] (0x44)
    virtual long wnd_proc(void* param_1, uint param_2, uint param_3, long param_4); // vt[18] (0x48)
    virtual long handle_idle(); // vt[19] (0x4C)
    virtual long handle_size(long param_1, long param_2); // vt[20] (0x50)
    virtual long handle_paint(); // vt[21] (0x54)
    virtual long handle_key_down(long param_1, short param_2, int param_3, int param_4, int param_5); // vt[22] (0x58)
    virtual long handle_char(long param_1, short param_2); // vt[23] (0x5C)
    virtual long handle_command(uint param_1, long param_2); // vt[24] (0x60)
    virtual long handle_user_command(uint param_1, long param_2); // vt[25] (0x64)
    virtual long handle_timer_command(uint param_1, long param_2); // vt[26] (0x68)
    virtual long handle_scroll(long param_1, long param_2); // vt[27] (0x6C)
    virtual long handle_mouse_down(uchar param_1, long param_2, long param_3, int param_4, int param_5); // vt[28] (0x70)
    virtual long handle_mouse_move(long param_1, long param_2, int param_3, int param_4); // vt[29] (0x74)
    virtual long handle_mouse_up(uchar param_1, long param_2, long param_3, int param_4, int param_5); // vt[30] (0x78)
    virtual long handle_mouse_dbl_click(uchar param_1, long param_2, long param_3, int param_4, int param_5); // vt[31] (0x7C)
    virtual long mouse_move_action(long param_1, long param_2, int param_3, int param_4); // vt[32] (0x80)
    virtual long mouse_left_down_action(long param_1, long param_2, int param_3, int param_4); // vt[33] (0x84)
    virtual long mouse_left_hold_action(long param_1, long param_2, int param_3, int param_4); // vt[34] (0x88)
    virtual long mouse_left_move_action(long param_1, long param_2, int param_3, int param_4); // vt[35] (0x8C)
    virtual long mouse_left_up_action(long param_1, long param_2, int param_3, int param_4); // vt[36] (0x90)
    virtual long mouse_left_dbl_click_action(long param_1, long param_2, int param_3, int param_4); // vt[37] (0x94)
    virtual long mouse_right_down_action(long param_1, long param_2, int param_3, int param_4); // vt[38] (0x98)
    virtual long mouse_right_hold_action(long param_1, long param_2, int param_3, int param_4); // vt[39] (0x9C)
    virtual long mouse_right_move_action(long param_1, long param_2, int param_3, int param_4); // vt[40] (0xA0)
    virtual long mouse_right_up_action(long param_1, long param_2, int param_3, int param_4); // vt[41] (0xA4)
    virtual long mouse_right_dbl_click_action(long param_1, long param_2, int param_3, int param_4); // vt[42] (0xA8)
    virtual long key_down_action(long param_1, short param_2, int param_3, int param_4, int param_5); // vt[43] (0xAC)
    virtual long char_action(long param_1, short param_2); // vt[44] (0xB0)
    virtual long action(long param_1, ulong param_2, ulong param_3); // vt[45] (0xB4)
    virtual void get_true_render_rect(tagRECT* param_1); // vt[46] (0xB8)
    virtual int is_inside(long param_1, long param_2); // vt[47] (0xBC)
    virtual void set_focus(int param_1); // vt[48] (0xC0)
    virtual void set_tab_order(); // vt[49] (0xC4)
    virtual void set_tab_order(TPanel** param_1, short param_2); // vt[50] (0xC8)
    virtual uchar get_help_info(char** param_1, long* param_2, long param_3, long param_4); // vt[51] (0xCC)
    virtual void stop_sound_system(); // vt[52] (0xD0)
    virtual int restart_sound_system(); // vt[53] (0xD4)
    virtual void take_snapshot(); // vt[54] (0xD8)
    virtual void handle_reactivate(); // vt[55] (0xDC)
    
    int get_string(int resid, char* buffer, int len);
    char* get_string(int resid);

    TPanel* previousPanelValue; // +0x4 (Size: 0x4)
    TPanel* previousModalPanelValue; // +0x8 (Size: 0x4)
    long pnl_x; // +0xC (Size: 0x4)
    long pnl_y; // +0x10 (Size: 0x4)
    long pnl_wid; // +0x14 (Size: 0x4)
    long pnl_hgt; // +0x18 (Size: 0x4)
    char* panelNameValue; // +0x1C (Size: 0x4)
    TDrawArea* render_area; // +0x20 (Size: 0x4)
    tagRECT clip_rect; // +0x24 (Size: 0x10)
    TPanel::PositionMode position_mode; // +0x34 (Size: 0x4)
    TPanel::RedrawMode need_redraw; // +0x38 (Size: 0x4)
    TPanel* curr_child; // +0x3C (Size: 0x4)
    TPanel* parent_panel; // +0x40 (Size: 0x4)
    TPanel* left_panel; // +0x44 (Size: 0x4)
    TPanel* top_panel; // +0x48 (Size: 0x4)
    TPanel* right_panel; // +0x4C (Size: 0x4)
    TPanel* bottom_panel; // +0x50 (Size: 0x4)
    PanelNode* node; // +0x54 (Size: 0x4)
    PanelNode* first_child_node; // +0x58 (Size: 0x4)
    PanelNode* last_child_node; // +0x5C (Size: 0x4)
    TPanel* tab_prev_panel; // +0x60 (Size: 0x4)
    TPanel* tab_next_panel; // +0x64 (Size: 0x4)
    int mouse_captured; // +0x68 (Size: 0x4)
    int active; // +0x6C (Size: 0x4)
    int visible; // +0x70 (Size: 0x4)
    int tab_stop; // +0x74 (Size: 0x4)
    int have_focus; // +0x78 (Size: 0x4)
    int overlapping_children; // +0x7C (Size: 0x4)
    int handle_mouse_input; // +0x80 (Size: 0x4)
    int just_drawn; // +0x84 (Size: 0x4)
    void* clip_rgn; // +0x88 (Size: 0x4)
    tagRECT render_rect; // +0x8C (Size: 0x10)
    long left_border; // +0x9C (Size: 0x4)
    long top_border; // +0xA0 (Size: 0x4)
    long right_border; // +0xA4 (Size: 0x4)
    long bottom_border; // +0xA8 (Size: 0x4)
    long min_wid; // +0xAC (Size: 0x4)
    long max_wid; // +0xB0 (Size: 0x4)
    long min_hgt; // +0xB4 (Size: 0x4)
    long max_hgt; // +0xB8 (Size: 0x4)
    long mouse_hold_interval; // +0xBC (Size: 0x4)
    long mouse_move_tolerance; // +0xC0 (Size: 0x4)
    long mouse_down_x; // +0xC4 (Size: 0x4)
    long mouse_down_y; // +0xC8 (Size: 0x4)
    int mouse_down_ctrl; // +0xCC (Size: 0x4)
    int mouse_down_shift; // +0xD0 (Size: 0x4)
    unsigned long mouse_down_time; // +0xD4 (Size: 0x4)
    int error_code; // +0xD8 (Size: 0x4)
    int z_order; // +0xDC (Size: 0x4)
    int display_changed_count; // +0xE0 (Size: 0x4)
    long help_string_id; // +0xE4 (Size: 0x4)
    long help_page_id; // +0xE8 (Size: 0x4)
    unsigned char mouse_action; // +0xEC (Size: 0x1)
    unsigned char mouse_down_button; // +0xED (Size: 0x1)
    unsigned char panel_type; // +0xEE (Size: 0x1)
    unsigned char color; // +0xEF (Size: 0x1)
    unsigned char fill_in_background; // +0xF0 (Size: 0x1)
    unsigned char clip_to_parent; // +0xF1 (Size: 0x1)
    unsigned char draw_rect2_flag; // +0xF2 (Size: 0x1)
    unsigned char need_restore; // +0xF3 (Size: 0x1)
};
static_assert(sizeof(TPanel) == 0xF4, "Size mismatch");
